[
    {
        "letter": "A",
        "name": "Atta ur Rehman Khan",
        "awards": 10,
        "education": "\nKhan was a Bright Sparks scholar and received his PhD degree in Computer Science from University of Malaya. He received his master's degree and bachelor's degree (with honors) in Computer Science from COMSATS University under COMSATS scholarship. He has also attended a summer camp on Advance Wireless Networks at Technische Universität Ilmenau under DAAD scholarship.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "A",
        "name": "Wil van der Aalst",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1104
    },
    {
        "letter": "A",
        "name": "Scott Aaronson",
        "awards": 4,
        "education": "\nAaronson grew up in the United States, though he spent a year in Asia when his father—a science writer turned public-relations executive—was posted to Hong Kong. He enrolled in a school there that permitted him to skip ahead several years in math, but upon returning to the US, he found his education restrictive, getting bad grades and having run-ins with teachers. He enrolled in The Clarkson School, a gifted education program run by Clarkson University, which enabled Aaronson to apply for colleges while only in his freshman year of high school. He was accepted into Cornell University, where he obtained his BSc in computer science in 2000, and where he resided at the Telluride House. He then attended the University of California, Berkeley, for his PhD, which he got in 2004 under the supervision of Umesh Vazirani.\nAaronson had shown ability in mathematics from an early age, teaching himself calculus at the age of 11, provoked by symbols in a babysitter's textbook. He discovered computer programming at age 11, and felt he lagged behind peers, who had already been coding for years. In part due to Aaronson getting into advanced mathematics before getting into computer programming, he felt drawn to theoretical computing, particularly computational complexity theory. At Cornell, he became interested in quantum computing and devoted himself to computational complexity and quantum computing.\n\n",
        "dblp_record": 228
    },
    {
        "letter": "A",
        "name": "Rediet Abebe",
        "awards": 3,
        "education": "\nAbebe was born and raised in Addis Ababa, Ethiopia. She was educated in the Ethiopian National Curriculum at Nazareth School before winning a competitive merit-based scholarship to attend the International Community School of Addis Ababa for high school.\nAbebe attended Harvard University where she earned a Bachelor of Arts degree in mathematics and later a Master of Science degree in applied mathematics. As an undergraduate, she co-authored research papers in mathematics, physics, and public health. While at Harvard, Abebe contributed to The Harvard Crimson as a staff writer, where she focused on the Cambridge public school system (2009-2011).\nAfter college, she attended the University of Cambridge as the Governor William Shirley Scholar at Pembroke College. She completed Part III of the Mathematics Tripos and earned a Master of Advanced Studies in pure mathematics under the supervision of Imre Leader.\nAbebe completed her doctoral degree in computer science at Cornell University, where she was advised by Jon Kleinberg. Her dissertation made notable contributions across multiple fields in computer science, receiving the 2020 ACM SIGKDD Dissertation Award and an honorable mention for the ACM SIGecom Dissertation Award. She is the first Black woman to complete a Ph.D. in computer science in the university's history.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "A",
        "name": "Hal Abelson",
        "awards": 1,
        "education": "\nAbelson graduated with a Bachelor of Arts degree in mathematics from Princeton University in 1969 after completing a senior thesis on Actions with fixed-point set: a homology sphere, supervised by William Browder.\n\nHe received his PhD in mathematics from the Massachusetts Institute of Technology in 1973 after completing his research on Topologically distinct conjugate varieties with finite fundamental group supervised by Dennis Sullivan.\n\n",
        "dblp_record": 50
    },
    {
        "letter": "A",
        "name": "Serge Abiteboul",
        "awards": 4,
        "education": "\nThe son of two hardware store owners, Abiteboul attended high-school in Romorantin, and Higher School Preparatory Classes in Tours. He was admitted to the Télécom Paris engineering school and studied at the Technion in Haifa for a year.\nAbiteboul received his PhD from the University of Southern California under the supervision of Seymour Ginsburg, in 1982.\n\n",
        "dblp_record": 312
    },
    {
        "letter": "A",
        "name": "Samson Abramsky",
        "awards": 4,
        "education": "\nAbramsky was educated at Hasmonean Grammar School for Boys, Hendon and at King's College, Cambridge (BA 1975, MA Philosophy 1979, Diploma in Computer Science) and Queen Mary, University of London (PhD Computer Science 1988, supervised by Richard Bornat).\n\n",
        "dblp_record": 214
    },
    {
        "letter": "A",
        "name": "Leonard Adleman",
        "awards": 2,
        "education": "Null",
        "dblp_record": 54
    },
    {
        "letter": "A",
        "name": "Manindra Agrawal",
        "awards": 9,
        "education": "Null",
        "dblp_record": 105
    },
    {
        "letter": "A",
        "name": "Luis von Ahn",
        "awards": 3,
        "education": "Null",
        "dblp_record": 39
    },
    {
        "letter": "A",
        "name": "Alfred Aho",
        "awards": 7,
        "education": "Null",
        "dblp_record": 112
    },
    {
        "letter": "A",
        "name": "Frances E. Allen",
        "awards": 6,
        "education": "\nAllen grew up on a farm in Peru, New York, near Lake Champlain, as the oldest of six children. Her father was a farmer, and her mother an elementary schoolteacher. Her early elementary education took place in a one-room school house a mile away from her home, and she later attended a local high school.\nShe graduated from The New York State College for Teachers (now part of the University at Albany, SUNY) with a Bachelor of Science degree in mathematics in 1954 and began teaching school in Peru, New York. After two years, she enrolled at the University of Michigan and earned a Master of Science degree in mathematics in 1957.\n\n",
        "dblp_record": 21
    },
    {
        "letter": "A",
        "name": "Gene Amdahl",
        "awards": 4,
        "education": "\nAmdahl was born to immigrant parents of Norwegian and Swedish descent in Flandreau, South Dakota. After serving in the Navy during World War II he completed a degree in engineering physics at South Dakota State University in 1948.\nHe went on to study theoretical physics at the University of Wisconsin–Madison under Robert G. Sachs. However, in 1950, Amdahl and Charles H. \"Charlie\" Davidson, a fellow PhD student in the Department of Physics, approached Harold A. Peterson with the idea of a digital computer. Amdahl and Davidson gained the support of Peterson and fellow electrical engineering professor Vincent C. Rideout, who encouraged them to build a computer of their unique design. Amdahl completed his doctorate at UW–Madison in 1952 with a thesis titled A Logical Design of an Intermediate Speed Digital Computer and created his first computer, the Wisconsin Integrally Synchronized Computer (WISC). He then went straight from Wisconsin to a position at IBM in June 1952.\n\n",
        "dblp_record": 11
    },
    {
        "letter": "A",
        "name": "David P. Anderson",
        "awards": 5,
        "education": "\nAnderson received a BA in mathematics from Wesleyan University, and MS and PhD degrees in mathematics and computer science from the University of Wisconsin–Madison. While in graduate school he published four research papers in computer graphics.  His PhD research involved using enhanced attribute grammars to specify and implement communication protocols.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "A",
        "name": "Lisa Anthony",
        "awards": 0,
        "education": "\nLisa Anthony earned her B.S. and M.S. in computer science with official concentrations in artificial intelligence, human-computer Interaction, and software engineering at Drexel University. Her M.S. thesis involved using genetic programming to evolve board evaluation functions for the strategy board game Acquire.citation needed] As a summer graduate intern, she worked on the Collaborative Exploratory Search project at the Fuji-Xerox Palo Alto Laboratory (FXPAL).citation needed]\nIn 2008, she earned her Ph.D. from the Human Computer Interaction Institute in the School of Computer Science at Carnegie Mellon University in 2008. Her Ph.D. thesis focused on developing handwriting-based systems for algebra equation-solving.citation needed]\n\n",
        "dblp_record": 77
    },
    {
        "letter": "A",
        "name": "Andrew Appel",
        "awards": 0,
        "education": "Null",
        "dblp_record": 133
    },
    {
        "letter": "A",
        "name": "Cecilia R. Aragon",
        "awards": 4,
        "education": "\nAragon received her B.S. in mathematics from the California Institute of Technology in 1982, M.S. from the University of California, Berkeley in 1987 and, Ph.D. in computer science from the same institution in 2004. For her doctoral studies, Aragon worked under the direction of Marti Hearst.\n\n",
        "dblp_record": 81
    },
    {
        "letter": "A",
        "name": "Bruce Arden",
        "awards": 0,
        "education": "Null",
        "dblp_record": 36
    },
    {
        "letter": "A",
        "name": "Angie Jones",
        "awards": 0,
        "education": "\nAngie Jones was born in New Orleans, Louisiana. She attended Marion Abramson Senior High School in New Orleans, LA. After graduating from high school, she enrolled as a Business major at Tennessee State University. However, after taking an introductory C++ course which sparked her interest in tech, she changed her major to Computer Science. She has a Bachelor of Science in Computer Science from Tennessee State University. In 2010, she obtained a Master's Degree in Computer Science from North Carolina State University\n\n",
        "dblp_record": 0
    },
    {
        "letter": "A",
        "name": "Sanjeev Arora",
        "awards": 0,
        "education": "Null",
        "dblp_record": 228
    },
    {
        "letter": "A",
        "name": "Winifred \"Tim\" Alice Asprey",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "A",
        "name": "John Vincent Atanasoff",
        "awards": 17,
        "education": "\nAtanasoff was born on October 4, 1903, in Hamilton, New York to an electrical engineer and a school teacher. Atanasoff's father, Ivan Atanasov, was of Bulgarian origin, born in 1876 in the village of Boyadzhik, close to Yambol, then in the Ottoman Empire. While Ivan Atanasov was still an infant, his own father was killed by Ottoman soldiers after the Bulgarian April Uprising. In 1889, Ivan immigrated to the United States with his uncle. John's father later became an electrical engineer, whereas his mother, Iva Lucena Purdy (of mixed French and Irish ancestry), was a teacher of mathematics.\nAtanasoff was raised in Brewster, Florida. Young Atanasoff's ambitions and intellectual pursuits were in part influenced by his parents, whose interests in the natural and applied sciences cultivated in him a sense of critical curiosity and confidence.citation needed] At the age of nine, he learned to use a slide rule, followed shortly by the study of logarithms, and subsequently completed high school at Mulberry High School in two years.citation needed] In 1925, Atanasoff received his Bachelor of Science degree in electrical engineering from the University of Florida.\nHe continued his education at Iowa State College and in 1926 earned a master's degree in mathematics. He completed his formal education in 1930 by earning a PhD in theoretical physics from the University of Wisconsin–Madison with his thesis, The Dielectric Constant of Helium. Upon completion of his doctorate, Atanasoff accepted an assistant professorship at Iowa State College in mathematics and physics.citation needed]\n\n",
        "dblp_record": 2
    },
    {
        "letter": "A",
        "name": "Shakuntala Atre",
        "awards": 0,
        "education": "\nAtre was born in 1940 in India and grew up in Panvel, a village near Mumbai. She earned a Master of Science from the University of Poona, studying mathematics and statistics. During her education, she also studied languages, gaining proficiency in speaking five different languages. Atre went on to begin her graduate studies in mathematics and physics at the University of Heidelberg, writing her thesis on astronomy. Because she needed to make large scale calculations to develop her thesis, she began studying computer programming, which led to an interest in the field of computer technology. During her studies, she was hired by IBM in 1967. When her student visa expired three and a half years later, Atre and her husband immigrated to the United States.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Charles Babbage",
        "awards": 8,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Charles Bachman",
        "awards": 5,
        "education": "Null",
        "dblp_record": 27
    },
    {
        "letter": "B",
        "name": "Roland Carl Backhouse",
        "awards": 0,
        "education": "\nBackhouse was born and raised in the Thorntree district of Middlesbrough, an industrial town in the north-east of England. In 1959, he won a place at the then all-male Acklam Hall Grammar School before going on to Churchill College, Cambridge, in 1966. His doctorate (Ph.D.) was completed under the supervision of Jim Cunningham at Imperial College London.\n\n",
        "dblp_record": 71
    },
    {
        "letter": "B",
        "name": "John Backus",
        "awards": 9,
        "education": "Null",
        "dblp_record": 17
    },
    {
        "letter": "B",
        "name": "David F. Bacon",
        "awards": 3,
        "education": "Null",
        "dblp_record": 85
    },
    {
        "letter": "B",
        "name": "David Bader",
        "awards": 1,
        "education": "\nBader is the son of chemistry professor Morris Bader and his wife Karen. He is an Eagle Scout in the Boy Scouts of America, earning the rank in 1985. Bader graduated from Liberty High School in Bethlehem, Pennsylvania in 1987.\nHe received a B.S. in computer engineering in 1990 and an M.S. in electrical engineering in 1991 from Lehigh University in Bethlehem, Pennsylvania. He then received a Ph.D. in electrical engineering in 1996 from the University of Maryland, College Park. While at UMD in 1992, Bader was awarded a NASA Graduate Student Researchers Fellowship by Gerald Soffen, project scientist for the Viking missions to Mars, at Goddard Space Flight Center.\n\n",
        "dblp_record": 271
    },
    {
        "letter": "B",
        "name": "Victor Bahl",
        "awards": 3,
        "education": "\nPhD, Electrical and Computer Engineering, University of Massachusetts, Amherst. Thesis title: Real-Time Visual Communications over Narrowband Wireless Radio Networks. Doctoral fellow at Digital Equipment Corporation.\nMaster of Science, Electrical and Computer Engineering, University at Buffalo. Thesis title: Recognition of Handwritten Script: A Hidden Markov Model Approach.\nBachelor of Science, Electrical and Computer Engineering, University at Buffalo. Thesis title: Conic Shape Detection Using a Non-Linearized Iterative Approach.\n",
        "dblp_record": 127
    },
    {
        "letter": "B",
        "name": "Anthony James Barr",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Jean Bartik",
        "awards": 3,
        "education": "\nBorn Betty Jean Jennings in Gentry County, Missouri in 1924, she was the sixth of seven children. Her father, William Smith Jennings (1893–1971) was from Alanthus Grove, where he was a schoolteacher as well as a farmer. Her mother, Lula May Spainhower (1887–1988) was from Alanthus. Jennings had three older brothers, William (January 10, 1915) Robert (March 15, 1918); and Raymond (January 23, 1922); two older sisters, Emma (August 11, 1916) and Lulu (August 22, 1919), and one younger sister, Mable (December 15, 1928).\nIn her childhood, she would ride on horseback to visit her grandmother, who bought the young girl a newspaper to read every day and became a role model for the rest of her life. She began her education at a local one-room school, and gained local attention for her softball skill. In order to attend high school, she lived with her older sister in the neighboring town, where the school was located, and then began to drive every day despite being only 14. She graduated from Stanberry High School in 1941, aged 16. She was given the title of salutatorian on her graduation.\nShe attended Northwest Missouri State Teachers College now known Northwest Missouri State University, majoring in mathematics with a minor in English and graduated in 1945. Jennings was awarded the only mathematics degree in her class. Although she had originally intended to study journalism, she decided to change to mathematics because she had a bad relationship with her adviser. Later in her life, she earned a master's degree in English at the University of Pennsylvania in 1967 and was awarded an honorary doctorate degree from Northwest Missouri State University in 2002.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Andrew Barto",
        "awards": 2,
        "education": "\nBarto received his B.S. with distinction in mathematics from the University of Michigan in 1970, after having initially majored in naval architecture and engineering. After reading work by Michael Arbib and McCulloch and Pitts he became interested in using computers and mathematics to model the brain, and five years later was awarded a Ph.D. in computer science for a thesis on cellular automata.\n\n",
        "dblp_record": 107
    },
    {
        "letter": "B",
        "name": "Friedrich L. Bauer",
        "awards": 2,
        "education": "Null",
        "dblp_record": 181
    },
    {
        "letter": "B",
        "name": "Rudolf Bayer",
        "awards": 1,
        "education": "Null",
        "dblp_record": 84
    },
    {
        "letter": "B",
        "name": "Gordon Bell",
        "awards": 8,
        "education": "\nGordon Bell was born in Kirksville, Missouri. He grew up helping with the family business, Bell Electric, repairing appliances and wiring homes.\nBell received a BS (1956), and MS (1957) in electrical engineering from MIT. He then went to the New South Wales University of Technology (now UNSW) in Australia on a Fulbright Scholarship, where he taught classes on computer design, programmed one of the first computers to arrive in Australia (called UTECOM, an English Electric DEUCE), and published his first academic paper. Returning to the US, he worked in the MIT Speech Computation Laboratory under Professor Ken Stevens, where he wrote the first analysis by synthesis program.\n\n",
        "dblp_record": 76
    },
    {
        "letter": "B",
        "name": "Steven M. Bellovin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 167
    },
    {
        "letter": "B",
        "name": "Cecilia Berdichevsky",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "B",
        "name": "Tim Berners-Lee",
        "awards": 9,
        "education": "\nBerners-Lee was born on 8 June 1955 in London, England, the eldest of the four children of Mary Lee Woods and Conway Berners-Lee; his brother Mike is a professor of ecology and climate change management. His parents were computer scientists who worked on the first commercially built computer, the Ferranti Mark 1. He attended Sheen Mount Primary School, and then went on to attend south-west London's Emanuel School from 1969 to 1973, at the time a direct grant grammar school, which became an independent school in 1975. A keen trainspotter as a child, he learnt about electronics from tinkering with a model railway. He studied at The Queen's College, Oxford, from 1973 to 1976, where he received a first-class Bachelor of Arts degree in physics. While at university, Berners-Lee made a computer out of an old television set, which he bought from a repair shop.\n\n",
        "dblp_record": 74
    },
    {
        "letter": "B",
        "name": "Daniel J. Bernstein",
        "awards": 0,
        "education": "Null",
        "dblp_record": 192
    },
    {
        "letter": "B",
        "name": "Peter Bernus",
        "awards": 0,
        "education": "Null",
        "dblp_record": 71
    },
    {
        "letter": "B",
        "name": "Abhay Bhushan",
        "awards": 0,
        "education": "Null",
        "dblp_record": 30
    },
    {
        "letter": "B",
        "name": "Dines Bjørner",
        "awards": 6,
        "education": "Null",
        "dblp_record": 97
    },
    {
        "letter": "B",
        "name": "Gerrit Blaauw",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Sue Black",
        "awards": 5,
        "education": "\nSue Black was born in 1962 in Fareham, Hampshire. She left school and home at 16, the earliest legal age. She married at 20 and soon had three children.\nAfter her husband forced Black and her children out, she sought safety at a local women's refuge. She began a maths access course at night school that led to enrolling in undergraduate degree. Black graduated with a bachelor's degree in computing from London South Bank University in 1993, and obtained her PhD in software engineering in 2001 for research on the ripple effect supervised by Robin Whitty\n\n",
        "dblp_record": 31
    },
    {
        "letter": "B",
        "name": "David Blei",
        "awards": 4,
        "education": "Null",
        "dblp_record": 276
    },
    {
        "letter": "B",
        "name": "Dorothy Blum",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Lenore Blum",
        "awards": 3,
        "education": "\nBlum was born to a Jewish family in New York City, where her mother was a science teacher. They moved to Venezuela when Blum was nine.\nAfter graduating from her Venezuelan high school at age 16, she studied architecture at Carnegie Institute of Technology (now Carnegie Mellon University) beginning in 1959. With the assistance of Alan Perlis, she shifted fields to mathematics in 1960. She married Manuel Blum, then a student at the Massachusetts Institute of Technology, and transferred in 1961 to Simmons College, a private women's liberal arts college in Boston. Simmons did not have a strong mathematics program but she was eventually able to take Isadore Singer's mathematics classes at MIT, graduating from Simmons with a B.S. in mathematics in 1963.\nShe received her Ph.D. in mathematics from the Massachusetts Institute of Technology in 1968.   Her dissertation, Generalized Algebraic Theories: A Model Theoretic Approach, was supervised by Gerald Sacks. She had switched to being advised by Sacks after being unable to follow an earlier advisor in his move to Princeton University because, at the time, Princeton did not accept female graduate students.\n\n",
        "dblp_record": 23
    },
    {
        "letter": "B",
        "name": "Manuel Blum",
        "awards": 5,
        "education": "\nBlum was born to a Jewish family in Venezuela. Blum was educated at MIT, where he received his bachelor's degree and his master's degree in electrical engineering in 1959 and 1961 respectively, and his Ph.D. in mathematics in 1964 supervised by Marvin Minsky.\n\n",
        "dblp_record": 84
    },
    {
        "letter": "B",
        "name": "Barry Boehm",
        "awards": 1,
        "education": "Null",
        "dblp_record": 382
    },
    {
        "letter": "B",
        "name": "Corrado Böhm",
        "awards": 0,
        "education": "Null",
        "dblp_record": 30
    },
    {
        "letter": "B",
        "name": "Kurt Bollacker",
        "awards": 0,
        "education": "Null",
        "dblp_record": 23
    },
    {
        "letter": "B",
        "name": "Jeff Bonwick",
        "awards": 0,
        "education": "Null",
        "dblp_record": 6
    },
    {
        "letter": "B",
        "name": "Grady Booch",
        "awards": 2,
        "education": "\nBooch earned his bachelor's degree in 1977 from the United States Air Force Academy and a master's degree in electrical engineering in 1979 from the University of California, Santa Barbara.\n\n",
        "dblp_record": 129
    },
    {
        "letter": "B",
        "name": "George Boole",
        "awards": 1,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Andrew Booth",
        "awards": 0,
        "education": "Null",
        "dblp_record": 3
    },
    {
        "letter": "B",
        "name": "Kathleen Booth",
        "awards": 0,
        "education": "\nKathleen Britten was born in Stourbridge, Worcestershire, England, on 9 July 1922. She obtained a BSc in mathematics from the University of London in 1944 and went on to get a PhD in Applied Mathematics in 1950. She married her colleague Andrew Donald Booth in 1950 and had two children.\n\n",
        "dblp_record": 1
    },
    {
        "letter": "B",
        "name": "Anita Borg",
        "awards": 0,
        "education": "Null",
        "dblp_record": 16
    },
    {
        "letter": "B",
        "name": "Bert Bos",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Mikhail Botvinnik",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "Jonathan Bowen",
        "awards": 12,
        "education": "\nBowen was born in Oxford, the son of Humphry Bowen, and was educated at the Dragon School, Bryanston School, prior to his matriculation at University College, Oxford (Oxford University) where he received the MA degree in Engineering Science.\n\n",
        "dblp_record": 258
    },
    {
        "letter": "B",
        "name": "Stephen R. Bourne",
        "awards": 1,
        "education": "Null",
        "dblp_record": 9
    },
    {
        "letter": "B",
        "name": "Harry Bouwman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 125
    },
    {
        "letter": "B",
        "name": "Robert S. Boyer",
        "awards": 0,
        "education": "Null",
        "dblp_record": 36
    },
    {
        "letter": "B",
        "name": "Karlheinz Brandenburg",
        "awards": 1,
        "education": "Null",
        "dblp_record": 25
    },
    {
        "letter": "B",
        "name": "Gilles Brassard",
        "awards": 0,
        "education": "Null",
        "dblp_record": 133
    },
    {
        "letter": "B",
        "name": "Lawrence M. Breed",
        "awards": 2,
        "education": "Null",
        "dblp_record": 10
    },
    {
        "letter": "B",
        "name": "Jack E. Bresenham",
        "awards": 0,
        "education": "Null",
        "dblp_record": 13
    },
    {
        "letter": "B",
        "name": "Sergey Brin",
        "awards": 0,
        "education": "\nSergey Mikhailovich Brin was born on August 21, 1973, in Moscow in the Soviet Union, to Russian Jewish parents, Mikhail and Eugenia Brin, both graduates of Moscow State University (MSU). His father is a retired mathematics professor at the University of Maryland, and his mother is a researcher at NASA's Goddard Space Flight Center.\nThe Brin family lived in a three-room apartment in central Moscow, which they also shared with Sergey's paternal grandmother. In 1977, after his father returned from a mathematics conference in Warsaw, Poland, Mikhail Brin announced that it was time for the family to emigrate. They formally applied for their exit visa in September 1978, and as a result, his father was \"promptly fired\". For related reasons, his mother had to leave her job. For the next eight months, without any steady income, they were forced to take on temporary jobs as they waited, afraid their request would be denied as it was for many refuseniks. In May 1979, they were granted their official exit visas and were allowed to leave the country.\nThe Brin family lived in Vienna and Paris while Mikhail Brin secured a teaching position at the University of Maryland with help from Anatole Katok. During this time, the Brin family received support and assistance from the Hebrew Immigrant Aid Society. They arrived in the United States on October 25, 1979.\nBrin attended elementary school at Paint Branch Montessori School in Adelphi, Maryland, but he received further education at home; his father, a professor in the department of mathematics at the University of Maryland, encouraged him to learn mathematics and his family helped him retain his Russian-language skills. He attended Eleanor Roosevelt High School, Maryland. In September 1990, Brin enrolled in the University of Maryland, where he received his Bachelor of Science from the Department of Computer Science in 1993 with honors in computer science and mathematics at the age of 19. In 1993, he interned at Wolfram Research, the developers of Mathematica.\nBrin began his graduate study in computer science at Stanford University on a graduate fellowship from the National Science Foundation, receiving an M.S. in computer science in 1995. As of 2008, he was on leave from his PhD studies at Stanford.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "B",
        "name": "David J. Brown",
        "awards": 0,
        "education": "\nBrown received his primary and secondary school education in Delmar, New York, and then studied at the University of Pennsylvania, Moore School of Electrical Engineering where he received a B.S.E. degree in 1979 and an M.S.E. under advisor Ruzena Bajcsy in 1980.\nIn 1984, Brown was introduced to David Wheeler, who invited him to join the University of Cambridge Computer Laboratory as a doctoral candidate. In October 1986, he matriculated at St John's College, University of Cambridge, England to pursue a Ph.D. degree. His dissertation introduced the concept of Unified Memory Architecture. This idea has subsequently been widely applied — such as by Intel in their processors and platform architecture of the late 1990s and onward.\n\n",
        "dblp_record": 14
    },
    {
        "letter": "B",
        "name": "Per Brinch Hansen",
        "awards": 1,
        "education": "Null",
        "dblp_record": 55
    },
    {
        "letter": "B",
        "name": "Sjaak Brinkkemper",
        "awards": 0,
        "education": "Null",
        "dblp_record": 292
    },
    {
        "letter": "B",
        "name": "Fred Brooks",
        "awards": 5,
        "education": "\nBorn on April 19, 1931, in Durham, North Carolina, he attended Duke University, graduating in 1953 with a Bachelor of Science degree in physics, and he received a Ph.D. in applied mathematics (computer science) from Harvard University in 1956, supervised by Howard Aiken.\nBrooks served as the graduate teaching assistant for Ken Iverson at Harvard's graduate program in \"automatic data processing\", the first such program in the world.\n\n",
        "dblp_record": 90
    },
    {
        "letter": "B",
        "name": "Rod Brooks",
        "awards": 13,
        "education": "Null",
        "dblp_record": 60
    },
    {
        "letter": "B",
        "name": "Margaret Burnett",
        "awards": 0,
        "education": "Null",
        "dblp_record": 260
    },
    {
        "letter": "B",
        "name": "Michael Butler",
        "awards": 0,
        "education": "Null",
        "dblp_record": 191
    },
    {
        "letter": "C",
        "name": "Pino Caballero Gil",
        "awards": 0,
        "education": "Null",
        "dblp_record": 214
    },
    {
        "letter": "C",
        "name": "Tracy Camp",
        "awards": 2,
        "education": "Null",
        "dblp_record": 117
    },
    {
        "letter": "C",
        "name": "Martin Campbell-Kelly",
        "awards": 0,
        "education": "\nCampell-Kelly was educated at Sunderland Polytechnic where he was awarded a PhD in 1980 on the Foundations of computer programming in Britain 1945–1955.\n\n",
        "dblp_record": 44
    },
    {
        "letter": "C",
        "name": "Rosemary Candlin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 4
    },
    {
        "letter": "C",
        "name": "Rod Canion",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Bryan Cantrill",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Luca Cardelli",
        "awards": 0,
        "education": "\nHe was born in Montecatini Terme, Italy. He attended the University of Pisa before receiving his PhD from the University of Edinburgh in 1982 for research supervised by Gordon Plotkin.\n\n",
        "dblp_record": 234
    },
    {
        "letter": "C",
        "name": "John Carmack",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Michael Caspersen",
        "awards": 8,
        "education": "\nMichael was born in Svendborg, Denmark. He went to Nordre Skole for primary and lower secondary school and to Svendborg Statsgymnasium for upper secondary school. He earned an M.Sc. in computer science from Aarhus University.\nAt Aarhus University, Michael was exposed to world-class computing education; new ideas of programming methodology developed by Dijkstra found their way into the first-year course, as did relational algebra and the semantics of programs. This educational experience had a profound impact on Michael's perspective on computing and devotion to computer science education, leading to his PhD thesis.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Edwin Catmull",
        "awards": 4,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "C",
        "name": "Vint Cerf",
        "awards": 12,
        "education": "Null",
        "dblp_record": 273
    },
    {
        "letter": "C",
        "name": "Gregory Chaitin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 45
    },
    {
        "letter": "C",
        "name": "Robert Cailliau",
        "awards": 13,
        "education": "Null",
        "dblp_record": 13
    },
    {
        "letter": "C",
        "name": "Zhou Chaochen",
        "awards": 1,
        "education": "Null",
        "dblp_record": 34
    },
    {
        "letter": "C",
        "name": "Peter Chen",
        "awards": 15,
        "education": "Null",
        "dblp_record": 99
    },
    {
        "letter": "C",
        "name": "Leonardo Chiariglione",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Tracy Chou",
        "awards": 0,
        "education": "\nChou studied computer science at Stanford University with a specialization in machine learning and artificial intelligence. During that time, she interned at Google and Facebook, and went on to receive a master's degree in computer science. Describing her undergraduate experience studying computer science, Chou said she felt, \"really out of place\" and less confident than her male colleagues at the beginning and took time to realize that she was outperforming most of them in coursework.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Alonzo Church",
        "awards": 0,
        "education": "Null",
        "dblp_record": 6
    },
    {
        "letter": "C",
        "name": "Alberto Ciaramella",
        "awards": 0,
        "education": "Null",
        "dblp_record": 10
    },
    {
        "letter": "C",
        "name": "Edmund M. Clarke",
        "awards": 4,
        "education": "Null",
        "dblp_record": 322
    },
    {
        "letter": "C",
        "name": "John Cocke",
        "awards": 4,
        "education": "Null",
        "dblp_record": 24
    },
    {
        "letter": "C",
        "name": "Edgar F. Codd",
        "awards": 5,
        "education": "Null",
        "dblp_record": 55
    },
    {
        "letter": "C",
        "name": "Jacques Cohen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 63
    },
    {
        "letter": "C",
        "name": "Ian Coldwater",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Simon Colton",
        "awards": 0,
        "education": "\nBorn in Nottingham, Colton graduated from the University of Durham in 1994 with a BSc degree in Mathematics. After a year spent as a programmer at a software company, he studied at the University of Liverpool, where he gained an MSc in Pure Mathematics in 1996. In 2000 he finished his PhD in Artificial Intelligence at the University of Edinburgh, having been supervised by Alan Bundy and Toby Walsh.\n\n",
        "dblp_record": 152
    },
    {
        "letter": "C",
        "name": "Alain Colmerauer",
        "awards": 0,
        "education": "Null",
        "dblp_record": 28
    },
    {
        "letter": "C",
        "name": "Douglas Comer",
        "awards": 8,
        "education": "Null",
        "dblp_record": 82
    },
    {
        "letter": "C",
        "name": "Paul Justin Compton",
        "awards": 0,
        "education": "Null",
        "dblp_record": 99
    },
    {
        "letter": "C",
        "name": "Richard W. Conway",
        "awards": 2,
        "education": "\nConway was born on December 12, 1931, in Milwaukee, Wisconsin.    He grew up in that state and attended Whitefish Bay High School in the Milwaukee County village of that name.  He was awarded a John McMullen Regional Scholarship for the study of engineering.\nHe arrived at Cornell University as a freshman in 1949.  Within the Sibley School of Mechanical Engineering, he embarked upon a five-year program of study.  While an undergraduate he was an officer of the university's chapter of the Alpha Delta Phi fraternity.  He participated in the Cornell University Orchestra and Concert Band.  In athletics, Conway did 150 pound crew, rowing stroke in the junior varsity boat during Spring 1952, then rowing a middle position in the varsity boat during Spring 1953.  He was elected to the Sphinx Head senior society.  He had a very early exposure to computing via attending a noncredit seminar on the IBM Card-Programmed Electronic Calculator that was given by Robert J. Walker and J. Barkley Rosser of the Cornell mathematics department.  He graduated with a Bachelor of Mechanical Engineering degree in 1954.\nHe married Edythe Davies on 29 August 1953, herself a Cornell graduate and later faculty member in the New York State College of Home Economics at Cornell University. They had three children, as well as a shared love of sailing.\nConway then went into graduate study at Cornell, focusing on industrial engineering.  He became interested in operations research and digital simulation, and was encouraged to continue in simulation by economist Harry Markowitz.  He received his Ph.D. degree in 1958, under the supervision of Andrew Schultz Jr.; his thesis was entitled \"An Experimental Investigation of Scheduling for Single-Stage Production\".  It was the first Ph.D. in industrial engineering at Cornell.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Gordon Cormack",
        "awards": 0,
        "education": "Null",
        "dblp_record": 133
    },
    {
        "letter": "C",
        "name": "Stephen Cook",
        "awards": 8,
        "education": "Null",
        "dblp_record": 132
    },
    {
        "letter": "C",
        "name": "James Cooley",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Danese Cooper",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Fernando J. Corbató",
        "awards": 8,
        "education": "Null",
        "dblp_record": 17
    },
    {
        "letter": "C",
        "name": "Kit Cosper",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Patrick Cousot",
        "awards": 2,
        "education": "Null",
        "dblp_record": 123
    },
    {
        "letter": "C",
        "name": "Ingemar Cox",
        "awards": 4,
        "education": "Null",
        "dblp_record": 179
    },
    {
        "letter": "C",
        "name": "Seymour Cray",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Nello Cristianini",
        "awards": 4,
        "education": "\nCristianini holds a degree in physics from the University of Trieste, a Master in computational intelligence from the University of London and a PhD from the University of Bristol. Previously he has been a professor of Artificial Intelligence at the University of Bristol, an associate professor at the University of California, Davis, and held visiting positions at other universities.\n\n",
        "dblp_record": 144
    },
    {
        "letter": "C",
        "name": "Jon Crowcroft",
        "awards": 0,
        "education": "\nCrowcroft was educated at Westminster School and graduated with a Bachelor of Arts degree in physics in 1979 from the University of Cambridge where he was an undergraduate student of Trinity College, Cambridge. He then gained a Master of Science degree in computing in 1981 and PhD in 1993, both from University College London.\n\n",
        "dblp_record": 556
    },
    {
        "letter": "C",
        "name": "W. Bruce Croft",
        "awards": 8,
        "education": "\nCroft earned a bachelor's degree with honors in 1973 and a master's degree in computer science in 1974 from Monash University in Melbourne, Australia.  He earned his Ph.D in computer science from the University of Cambridge in 1979 and joined the University of Massachusetts, Amherst faculty later that year.\n\n",
        "dblp_record": 455
    },
    {
        "letter": "C",
        "name": "Glen Culler",
        "awards": 2,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "C",
        "name": "Haskell Curry",
        "awards": 0,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "D",
        "name": "Luigi Dadda",
        "awards": 0,
        "education": "Null",
        "dblp_record": 28
    },
    {
        "letter": "D",
        "name": "Ole-Johan Dahl",
        "awards": 12,
        "education": "Null",
        "dblp_record": 20
    },
    {
        "letter": "D",
        "name": "Ryan Dahl",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Andries van Dam",
        "awards": 0,
        "education": "Null",
        "dblp_record": 98
    },
    {
        "letter": "D",
        "name": "Samir Das",
        "awards": 0,
        "education": "Null",
        "dblp_record": 175
    },
    {
        "letter": "D",
        "name": "Neil Daswani",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Christopher J. Date",
        "awards": 0,
        "education": "Null",
        "dblp_record": 55
    },
    {
        "letter": "D",
        "name": "Terry A. Davis",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Jeff Dean",
        "awards": 0,
        "education": "\nDean received a B.S., summa cum laude, from the University of Minnesota in computer science and economics in 1990. He received a Ph.D. in computer science from the University of Washington in 1996, working under Craig Chambers on compilers and whole-program optimization techniques for object-oriented programming languages. He was elected to the National Academy of Engineering in 2009, which recognized his work on \"the science and engineering of large-scale distributed computer systems\".\n\n",
        "dblp_record": 111
    },
    {
        "letter": "D",
        "name": "Erik Demaine",
        "awards": 2,
        "education": "\nDemaine was born in Halifax, Nova Scotia, to mathematician and sculptor Martin L. Demaine and Judy Anderson. From the age of 7, he was identified as a child prodigy and spent time traveling across North America with his father. He was home-schooled during that time span until entering university at the age of 12.\nDemaine completed his bachelor's degree at 14 years of age at Dalhousie University in Canada, and completed his PhD at the University of Waterloo by the time he was 20 years old.\nDemaine's PhD dissertation, a work in the field of computational origami, was completed at the University of Waterloo under the supervision of Anna Lubiw and Ian Munro. This work was awarded the Canadian Governor General's Gold Medal from the University of Waterloo and the NSERC Doctoral Prize (2003) for the best PhD thesis and research in Canada. Some of the work from this thesis was later incorporated into his book Geometric Folding Algorithms on the mathematics of paper folding published with Joseph O'Rourke in 2007.\n\n",
        "dblp_record": 739
    },
    {
        "letter": "D",
        "name": "Tom DeMarco",
        "awards": 11,
        "education": "\nTom DeMarco was born in Hazleton, Pennsylvania. He received a BSEE degree in Electrical Engineering from Cornell University, a M.S. from Columbia University, and a diplôme from the University of Paris.\n\n",
        "dblp_record": 33
    },
    {
        "letter": "D",
        "name": "Richard DeMillo",
        "awards": 0,
        "education": "\nA Minnesota native, Richard DeMillo was born and raised in Hibbing, Minnesota and received his Bachelor of Arts in mathematics from the University of St. Thomas in St. Paul Minnesota in 1969 and a Ph.D. in information and computer science from Georgia Tech in 1972.\n\n",
        "dblp_record": 61
    },
    {
        "letter": "D",
        "name": "Dorothy E. Denning",
        "awards": 4,
        "education": "\nDorothy Elizabeth Robling, daughter of C. Lowell and Helen Watson Robling, grew up in Grand Rapids, Michigan.  She earned a Bachelor of Arts degree in mathematics in 1967 followed by a Master of Arts degree in 1969 at the University of Michigan. Her PhD thesis was on Secure Information Flow in Computer Systems and awarded in 1975 by Purdue University.\n\n",
        "dblp_record": 68
    },
    {
        "letter": "D",
        "name": "Peter J. Denning",
        "awards": 6,
        "education": "\nDenning was born January 6, 1942, in Queens, New York, and raised in Darien, Connecticut. He took an early interest in science, pursuing astronomy, botany, radio, and electronics while in grade school.  At Fairfield Prep, he submitted home-designed computers to the science fair in 1958, 1959, and 1960.  His second computer, which solved linear equations using pinball machine parts, won the grand prize.\nHe attended Manhattan College for a Bachelor in EE (1964) and then MIT for a PhD (1968).  At MIT he worked on Project MAC and contributed to the design of the pioneering Multics operating system.  His PhD thesis, \"Resource allocation in multiprocess computer systems\", introduced seminal ideas in working sets, locality, thrashing, and system balance.\n\n",
        "dblp_record": 294
    },
    {
        "letter": "D",
        "name": "Michael Dertouzos",
        "awards": 0,
        "education": "Null",
        "dblp_record": 17
    },
    {
        "letter": "D",
        "name": "Alexander Dewdney",
        "awards": 0,
        "education": "Null",
        "dblp_record": 11
    },
    {
        "letter": "D",
        "name": "Robert Dewar",
        "awards": 0,
        "education": "\nDewar was born in Oxford, England, one of two sons of the theoretical chemist Michael J. S. Dewar and Mary Dewar, née Williamson (d. 1994), a historian and scholar of English Tudor history. In 1959, he moved with his parents from England to Chicago, Illinois, when his father accepted a teaching job at the University of Chicago. Dewar attended the University of Chicago, earning a Bachelor of Science (B.S.) in 1964, and a Doctor of Philosophy (Ph.D.) in chemistry in 1968. He began to work with computers during graduate school.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Vinod Dham",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Jan Dietz",
        "awards": 0,
        "education": "Null",
        "dblp_record": 118
    },
    {
        "letter": "D",
        "name": "Whitfield Diffie",
        "awards": 6,
        "education": "Null",
        "dblp_record": 43
    },
    {
        "letter": "D",
        "name": "Edsger W. Dijkstra",
        "awards": 5,
        "education": "Null",
        "dblp_record": 97
    },
    {
        "letter": "D",
        "name": "Matthew Dillon",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Alan Dix",
        "awards": 0,
        "education": "Null",
        "dblp_record": 257
    },
    {
        "letter": "D",
        "name": "Jack Dongarra",
        "awards": 15,
        "education": "\nDongarra received a BSc degree in mathematics from Chicago State University in 1972 and a MSc degree in Computer Science from the Illinois Institute of Technology in 1973. In 1980, he received PhD in Applied Mathematics from the University of New Mexico under the supervision of Cleve Moler.\n\n",
        "dblp_record": 983
    },
    {
        "letter": "D",
        "name": "Marco Dorigo",
        "awards": 0,
        "education": "Null",
        "dblp_record": 310
    },
    {
        "letter": "D",
        "name": "Paul Dourish",
        "awards": 7,
        "education": "Null",
        "dblp_record": 155
    },
    {
        "letter": "D",
        "name": "Charles Stark Draper",
        "awards": 5,
        "education": "\nDraper was born in Windsor, Missouri. He attended the University of Missouri in 1917, then transferred to Stanford University, California in 1919, from which he earned a B.A. in psychology in 1922. He matriculated at MIT in 1922, earning a Bachelor of Science degree in electrochemical engineering (1926), and Master of Science (1928), and a Doctor of Science (1938) degrees in physics. Charles Stark Draper's relatives were prominent in his home state of Missouri, including his cousin, Governor Lloyd C. Stark.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Susan Dumais",
        "awards": 1,
        "education": "Null",
        "dblp_record": 208
    },
    {
        "letter": "D",
        "name": "Adam Dunkels",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "D",
        "name": "Jon Michael Dunn",
        "awards": 2,
        "education": "\nDunn was born in Fort Wayne, Indiana. He went to high school in Lafayette, Indiana, where he worked in Purdue Biology laboratories after school and summers. He was the first in his family to go to college.\nHe obtained an A.B. in Philosophy from Oberlin College and a Ph.D. in philosophy (Logic) from the University of Pittsburgh, where he wrote his dissertation, The Algebra of Intensional Logics.\n\n",
        "dblp_record": 37
    },
    {
        "letter": "D",
        "name": "Schahram Dustdar",
        "awards": 0,
        "education": "Null",
        "dblp_record": 912
    },
    {
        "letter": "E",
        "name": "Peter Eades",
        "awards": 0,
        "education": "Null",
        "dblp_record": 219
    },
    {
        "letter": "E",
        "name": "Annie Easley",
        "awards": 0,
        "education": "\nBefore the Civil Rights Movement, educational and career opportunities for African-American children were very limited. Segregation was prevalent, African-American children were educated separately from white children, and their schools were often inferior to white schools. Annie's mother told her that she could be anything, but she would have to work at it. She encouraged Annie to get a good education. From the fifth grade through high school, Annie attended Holy Family High School, and was valedictorian of her graduating class. At a young age Annie had interest in becoming a nurse, but around the age of 16 she decided to study pharmacy.\nIn 1950, Easley enrolled in classes at Xavier University in New Orleans, an African-American Catholic university, and majored in pharmacy for about two years.\nIn 1977, she obtained a Bachelor of Science in Mathematics from Cleveland State University.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "Wim Ebbinkhuijsen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "John Presper Eckert",
        "awards": 1,
        "education": "\nEckert was born in Philadelphia to wealthy real estate developer John Eckert, and was raised in a large house in Philadelphia's Germantown section. During elementary school, he was driven by chauffeur to William Penn Charter School, and in high school joined the Engineer's Club of Philadelphia and spent afternoons at the electronics laboratory of television inventor Philo Farnsworth in Chestnut Hill. He placed second in the country on the math portion of the College Board examination.\nEckert initially enrolled in the University of Pennsylvania's Wharton School to study business at the encouragement of his parents, but in 1937 transferred to Penn's Moore School of Electrical Engineering. In 1940, at age 21, Eckert applied for his first patent, \"Light Modulating Method and Apparatus\". At the Moore School, Eckert participated in research on radar timing, made improvements to the speed and precision of the Moore School's differential analyzer, and in 1941 assisted in teaching a summer course in electronics under the Engineering, Science, and Management War Training (ESMWT) offered through the Moore School by the United States Department of War.\n\n",
        "dblp_record": 9
    },
    {
        "letter": "E",
        "name": "Alan Edelman",
        "awards": 7,
        "education": "\nEdelman received B.S. and M.S. degrees in mathematics from Yale University in 1984, and a Ph.D. in applied mathematics from MIT in 1989 under the direction of Lloyd N. Trefethen. Following a year at Thinking Machines Corporation, and at CERFACS in France, Edelman went to U.C. Berkeley as a Morrey Assistant Professor and Levy Fellow, 1990–93. He joined the MIT faculty in applied mathematics in 1993.\n\n\n",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "Brendan Eich",
        "awards": 0,
        "education": "Null",
        "dblp_record": 7
    },
    {
        "letter": "E",
        "name": "Philip Emeagwali",
        "awards": 0,
        "education": "\nHe traveled to the United States to study under a scholarship following completion of a course at the University of London. He received a bachelor's degree in mathematics from Oregon State University in 1977. He later moved to Washington D.C., receiving in 1986 a master's degree from George Washington University in ocean and marine engineering, and a second master's in applied mathematics from the University of Maryland. Next magazine suggested that Emeagwali claimed to have further degrees. During this time, he worked as a civil engineer at the Bureau of Land Reclamation in Wyoming.\n\nCourt case and the denial of degreeedit]\nEmeagwali studied for a Ph.D. degree from the University of Michigan from 1987 through 1991. His thesis was not accepted by a committee of internal and external examiners and thus he was not awarded the degree. Emeagwali filed a court challenge, stating that the decision was a violation of his civil rights and that the university had discriminated against him in several ways because of his race. The court challenge was dismissed, as was an appeal to the Michigan state Court of Appeals.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "E. Allen Emerson",
        "awards": 2,
        "education": "\nEmerson was born in Dallas, Texas. His early experiences with computing included exposure to BASIC, Fortran, and ALGOL 60 on the Dartmouth Time Sharing System and Burroughs large systems computers.\nHe went on to receive a Bachelor of Science degree in mathematics from the University of Texas at Austin in 1976 and a Doctor of Philosophy degree in applied mathematics at Harvard University in 1981.\n\n",
        "dblp_record": 119
    },
    {
        "letter": "E",
        "name": "Douglas Engelbart",
        "awards": 2,
        "education": "\nEngelbart was born in Portland, Oregon, on January 30, 1925, to Carl Louis Engelbart and Gladys Charlotte Amelia Munson Engelbart. His ancestors were of German, Swedish and Norwegian descent.\nHe was the middle of three children, with a sister Dorianne (three years older), and a brother David (14 months younger). The family lived in Portland, Oregon, in his early years, and moved to the surrounding countryside along Johnson Creek when he was 8. His father died one year later. He graduated from Portland's Franklin High School in 1942.\nMidway through his undergraduate years at Oregon State University, he served two years in the United States Navy as a radio and radar technician in the Philippines. It was there, on the remote island of  Leyte in a small traditional hut on stilts, that he read Vannevar Bush's article \"As We May Think\", which would have a large influence on his thinking and work. He returned to Oregon State and completed his bachelor's degree in electrical engineering in 1948. While at Oregon State, he was a member of Sigma Phi Epsilon social fraternity. He was hired by the National Advisory Committee for Aeronautics at the Ames Research Center, where he worked in wind tunnel maintenance. In his off hours he enjoyed hiking, camping, and folk dancing. It was there he met Ballard Fish (August 18, 1928 – June 18, 1997), who was just completing her training to become an occupational therapist. They were married in Portola State Park on May 5, 1951. Soon after, Engelbart left Ames to pursue graduate studies at the University of California, Berkeley. At Berkeley, he studied electrical engineering with a specialty in computers, earning his MS in 1953 and his PhD in 1955.\n\n",
        "dblp_record": 18
    },
    {
        "letter": "E",
        "name": "Barbara Engelhardt",
        "awards": 6,
        "education": "\nEngelhardt received a Bachelor of Science in Symbolic Systems and a Master of Science in Computer Science from Stanford University. She received a PhD in 2008 from the University of California, Berkeley supervised by Michael I. Jordan.  \n\n",
        "dblp_record": 61
    },
    {
        "letter": "E",
        "name": "David Eppstein",
        "awards": 0,
        "education": "Null",
        "dblp_record": 674
    },
    {
        "letter": "E",
        "name": "Andrey Ershov",
        "awards": 0,
        "education": "Null",
        "dblp_record": 27
    },
    {
        "letter": "E",
        "name": "Don Estridge",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "Oren Etzioni",
        "awards": 6,
        "education": "\nEtzioni is the son of Israeli-American intellectual Amitai Etzioni. He was the first student to major in computer science at Harvard University, where he earned a bachelor's degree in 1986. He earned a PhD from Carnegie Mellon University in January, 1991, supervised by Tom M. Mitchell.\n\n",
        "dblp_record": 187
    },
    {
        "letter": "E",
        "name": "Christopher Riche Evans",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "E",
        "name": "David C. Evans",
        "awards": 1,
        "education": "Null",
        "dblp_record": 4
    },
    {
        "letter": "E",
        "name": "Shimon Even",
        "awards": 0,
        "education": "Null",
        "dblp_record": 103
    },
    {
        "letter": "F",
        "name": "Scott Fahlman",
        "awards": 1,
        "education": "Null",
        "dblp_record": 34
    },
    {
        "letter": "F",
        "name": "Edward Feigenbaum",
        "awards": 3,
        "education": "Null",
        "dblp_record": 44
    },
    {
        "letter": "F",
        "name": "Edward Felten",
        "awards": 2,
        "education": "Null",
        "dblp_record": 111
    },
    {
        "letter": "F",
        "name": "Tim Finin",
        "awards": 3,
        "education": "\nFinin earned an undergraduate degree in Electrical Engineering from MIT in 1971 and a PhD in Computer Science from the University of Illinois at Urbana–Champaign in 1980.\n\n",
        "dblp_record": 357
    },
    {
        "letter": "F",
        "name": "Raphael Finkel",
        "awards": 0,
        "education": "Null",
        "dblp_record": 63
    },
    {
        "letter": "F",
        "name": "Donald Firesmith",
        "awards": 0,
        "education": "Null",
        "dblp_record": 60
    },
    {
        "letter": "F",
        "name": "Gary William Flake",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "Tommy Flowers",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "F",
        "name": "Robert Floyd",
        "awards": 5,
        "education": "Null",
        "dblp_record": 35
    },
    {
        "letter": "F",
        "name": "Sally Floyd",
        "awards": 2,
        "education": "Null",
        "dblp_record": 83
    },
    {
        "letter": "F",
        "name": "Lawrence J. Fogel",
        "awards": 0,
        "education": "Null",
        "dblp_record": 20
    },
    {
        "letter": "F",
        "name": "James D. Foley",
        "awards": 6,
        "education": "\nFoley was born in Pennsylvania. He attended Lehigh University in Bethlehem, Pennsylvania, where he graduated with a bachelor's degree in electrical engineering in 1964. Foley was initiated into the Phi Beta Kappa Society and Tau Beta Pi while at Lehigh. He received his Ph.D. in computer, information, and control engineering from the University of Michigan in 1969.\n\n",
        "dblp_record": 108
    },
    {
        "letter": "F",
        "name": "Ken Forbus",
        "awards": 0,
        "education": "\nForbus earned a Bachelor of Science in computer science, Master of Science in computer science, and PhD in artificial intelligence from the Massachusetts Institute of Technology.\n\n",
        "dblp_record": 208
    },
    {
        "letter": "F",
        "name": "L. R. Ford, Jr.",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "Lance Fortnow",
        "awards": 4,
        "education": "Null",
        "dblp_record": 235
    },
    {
        "letter": "F",
        "name": "Mahmoud Samir Fayed",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "Martin Fowler",
        "awards": 0,
        "education": "Null",
        "dblp_record": 42
    },
    {
        "letter": "F",
        "name": "Robert France",
        "awards": 5,
        "education": "Null",
        "dblp_record": 257
    },
    {
        "letter": "F",
        "name": "Herbert W. Franke",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "Edward Fredkin",
        "awards": 4,
        "education": "\nFredkin's mother and father were both Russian immigrants who met in Los Angeles, and he was the youngest child of four. His mother was a concert pianist, although she did not perform professionally. She died from cancer when he was 11. His father was a businessperson but had lost everything in the 1929 stock market crash and as a result, the family was relatively poor. At times he lived with other families or with his older sister. Eventually, his father remarried, and he and his sister moved back in. As a child, he was both entrepreneurial and interested in science and how things work. He did various weekend and after-school things to earn money, eventually handling a large newspaper delivery route. At age 10 he bought chemistry supplies and made his own fireworks, which were then illegal in Los Angeles. He did poorly in school because he didn't do homework. He graduated from John Marshall High School a semester early so that he could earn money for Caltech tuition and living expenses. Caltech later told him he had been admitted with the worst high school grades they had ever seen. He quit Caltech partway through his sophomore year.\nHe then joined the United States Air Force (USAF) to become a fighter pilot. His computer career started in 1956 when the Air Force assigned him to MIT Lincoln Laboratory where he worked on the SAGE computer.\n\n",
        "dblp_record": 8
    },
    {
        "letter": "F",
        "name": "Yoav Freund",
        "awards": 1,
        "education": "Null",
        "dblp_record": 113
    },
    {
        "letter": "F",
        "name": "Daniel P. Friedman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 79
    },
    {
        "letter": "F",
        "name": "Charlotte Froese Fischer",
        "awards": 4,
        "education": "Null",
        "dblp_record": 19
    },
    {
        "letter": "F",
        "name": "Ping Fu",
        "awards": 0,
        "education": "\nPing Fu was born in 1958 in Nanjing, China, where her father was a professor at the Nanjing University of Aeronautics and Astronautics (NUAA). Fu spent her childhood and early adulthood in China. She grew up during the Cultural Revolution, during which she was separated from both her parents for several years. After the end of the Cultural Revolution, she attended the college that later became the Suzhou University studying Chinese literature. Fu has related in interviews and in her memoir that she chose to research China's one-child policy for her thesis and traveled to the countryside, where she found that infanticide of female infants was common, as was abortion, even late into pregnancy.  Fu said that, after turning in her research, she believes it was passed to a newspaper editor who wrote an editorial on the infanticide of female children.better source needed] Fu has stated that she was later briefly imprisoned by government officials and was told to leave the country. After this event, she left school, without graduating.\nFu left China and arrived in the United States in January 1984. She initially enrolled at the University of New Mexico (UNM) in Albuquerque but later moved to San Diego to study computer science as an undergraduate at the University of California, San Diego. During her time in San Diego, Fu worked part-time at a software company called Resource Systems Group as a programmer and database software consultant. Following her graduation from UC San Diego with a bachelor's degree in computer science, she moved to Illinois, where she took a job with Bell Labs. The company offered a Ph.D assistance program, through which Fu enrolled in the computer science Ph.D program at the University of Illinois at Urbana-Champaign (UIUC). At UIUC she completed a master's degree in computer science.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "Xiaoming Fu",
        "awards": 6,
        "education": "Null",
        "dblp_record": 292
    },
    {
        "letter": "F",
        "name": "Kunihiko Fukushima",
        "awards": 1,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "F",
        "name": "D. R. Fulkerson",
        "awards": 2,
        "education": "\nD. R. Fulkerson was born in Tamms, Illinois, the third of six children of Elbert and Emma Fulkerson. Fulkerson became an undergraduate at Southern Illinois University. His academic career was interrupted by military service during World War II. Having returned to complete his degree after the war, he went on to do a Ph.D. in mathematics at the University of Wisconsin–Madison under the supervision of Cyrus MacDuffee, who was a student of L. E. Dickson. Fulkerson received his Ph.D. in 1951.\n\n",
        "dblp_record": 9
    },
    {
        "letter": "G",
        "name": "Richard P. Gabriel",
        "awards": 2,
        "education": "Null",
        "dblp_record": 81
    },
    {
        "letter": "G",
        "name": "Zvi Galil",
        "awards": 3,
        "education": "\nZvi Galil was born in Tel Aviv in Mandatory Palestine in 1947. He completed both his B.Sc. (1970) and his M.Sc. (1971) in applied mathematics, both summa cum laude, at Tel Aviv University before earning his Ph.D. in computer science at Cornell University in 1975 under the supervision of John Hopcroft. He then spent a year working as a post-doctorate researcher at IBM's Thomas J. Watson Research Center in Yorktown Heights, New York.\n\n",
        "dblp_record": 199
    },
    {
        "letter": "G",
        "name": "Bernard Galler",
        "awards": 0,
        "education": "Null",
        "dblp_record": 56
    },
    {
        "letter": "G",
        "name": "Hector Garcia-Molina",
        "awards": 1,
        "education": "Null",
        "dblp_record": 463
    },
    {
        "letter": "G",
        "name": "Michael Garey",
        "awards": 0,
        "education": "Null",
        "dblp_record": 62
    },
    {
        "letter": "G",
        "name": "Hugo de Garis",
        "awards": 0,
        "education": "Null",
        "dblp_record": 95
    },
    {
        "letter": "G",
        "name": "Bill Gates",
        "awards": 4,
        "education": "\nWilliam Henry Gates III was born on October 28, 1955, in Seattle, Washington as the only son of William H. Gates Sr. (1925–2020) and his first wife, Mary Maxwell Gates (1929–1994). His ancestry includes English, German, and Irish/Scots-Irish. His father was a prominent lawyer, and his mother served on the board of directors of First Interstate BancSystem and United Way of America. Gates's maternal grandfather was J. W. Maxwell, a national bank president. He also has an older sister Kristi (Kristianne) and a younger sister Libby. He is the fourth of his name in his family but is known as William Gates III or \"Trey\" (i.e., three) because his father had the \"II\" suffix. The family lived in the Sand Point area of Seattle in a home that was damaged by a rare tornado when Gates was seven years old.\nAccording to Gates, when he was young, his parents wanted him to pursue a career in law. During his childhood, his family regularly attended a church of the Congregational Christian Churches, a Protestant Reformed denomination. Gates was small for his age and was bullied as a child. The family encouraged competition; one visitor reported that \"it didn't matter whether it was hearts or pickleball or swimming to the dock; there was always a reward for winning and there was always a penalty for losing\".\n\nGates (right) with Paul Allen seated at Teletype Model 33 ASR terminals in Lakeside School, 1970\nAt age 13, he enrolled in the private Lakeside prep school, where he wrote his first software program. When he was in eighth grade, the Mothers' Club at the school used proceeds from Lakeside School's rummage sale to buy a Teletype Model 33 ASR terminal and a block of computer time on a General Electric (GE) computer for the students. Gates took an interest in programming the GE system in BASIC, and he was excused from math classes to pursue his interest. He wrote his first computer program on this machine, an implementation of tic-tac-toe that allowed users to play games against the computer. Gates was fascinated by the machine and how it would always execute software code perfectly. After the Mothers Club donation was exhausted, Gates and other students sought time on systems including DEC PDP minicomputers. One of these systems was a PDP-10 belonging to Computer Center Corporation (CCC) which banned Gates, Paul Allen, Ric Weiland, and Gates's best friend and first business partner Kent Evans for the summer after it caught them exploiting bugs in the operating system to obtain free computer time.\nThe four students formed the Lakeside Programmers Club to make money. At the end of the ban, they offered to find bugs in CCC's software in exchange for extra computer time. Rather than using the system remotely via Teletype, Gates went to CCC's offices and studied source code for various programs that ran on the system, including Fortran, Lisp, and machine language. The arrangement with CCC continued until 1970 when the company went out of business.\nThe following year, a Lakeside teacher enlisted Gates and Evans to automate the school's class-scheduling system, providing them computer time and royalties in return. The duo worked diligently in order to have the program ready for their senior year. Towards the end of their junior year, Evans was killed in a mountain climbing accident, which Gates has described as one of the saddest days of his life. Gates then turned to Allen who helped him finish the system for Lakeside.\nAt 17, Gates formed a venture with Allen called Traf-O-Data to make traffic counters based on the Intel 8008 processor. In 1972, he served as a congressional page in the House of Representatives. He was a National Merit Scholar when he graduated from Lakeside School in 1973. He scored 1590 out of 1600 on the Scholastic Aptitude Tests (SAT) and enrolled at Harvard College in the autumn of 1973. He chose a pre-law major but took mathematics (including Math 55) and graduate level computer science courses. While at Harvard, he met fellow student and future Microsoft CEO Steve Ballmer. Gates left Harvard after two years while Ballmer stayed and graduated magna cum laude. Years later, Ballmer succeeded Gates as Microsoft's CEO and maintained that position from 2000 until his resignation in 2014.\nGates devised an algorithm for pancake sorting as a solution to one of a series of unsolved problems presented in a combinatorics class by professor Harry Lewis. His solution held the record as the fastest version for over 30 years, and its successor is faster by only 2%. His solution was formalized and published in collaboration with Harvard computer scientist Christos Papadimitriou.\nGates remained in contact with Paul Allen and joined him at Honeywell during the summer of 1974. In 1975, the MITS Altair 8800 was released based on the Intel 8080 CPU, and Gates and Allen saw the opportunity to start their own computer software company. Gates dropped out of Harvard that same year. His parents were supportive of him after seeing how much he wanted to start his own company. He explained his decision to leave Harvard: \"if things hadn't worked out, I could always go back to school. I was officially on leave.\"\n\n",
        "dblp_record": 2
    },
    {
        "letter": "G",
        "name": "David Gelernter",
        "awards": 13,
        "education": "\nGelernter grew up on Long Island, New York. His father Herbert Gelernter was a physicist who, in the late 1950s and 1960s, became a pioneer in artificial intelligence and taught computer science at State University of New York at Stony Brook. Gelernter's grandfather was a rabbi, and Gelernter grew up as a Reform Jew; he later became a follower of Orthodox Judaism.\nHe received his Bachelor of Arts and Master of Arts degrees in Classical Hebrew literature from Yale University in 1976. He earned his Ph.D. from State University of New York at Stony Brook in 1982.\n\n",
        "dblp_record": 66
    },
    {
        "letter": "G",
        "name": "Lisa Gelobter",
        "awards": 4,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "G",
        "name": "Charles Geschke",
        "awards": 12,
        "education": "\nCharles Matthew Geschke was born in Cleveland, Ohio, on September 11, 1939.  He attended Saint Ignatius High School.\nGeschke earned an AB in classics in 1962 and an MS in mathematics in 1963, both from Xavier University.  He taught mathematics at John Carroll University from 1963 to 1968.  In 1972, he completed his PhD studies in computer science at Carnegie Mellon University under the advice of William Wulf.  He was a co-author of Wulf's 1975 book The Design of an Optimizing Compiler.\n\n",
        "dblp_record": 10
    },
    {
        "letter": "G",
        "name": "Zoubin Ghahramani",
        "awards": 2,
        "education": "\nGhahramani was educated at the American School of Madrid in Spain and the University of Pennsylvania where he was awarded a double major degree in Cognitive Science and Computer Science in 1990. He obtained his Ph.D. from the Department of Brain and Cognitive Sciences at the Massachusetts Institute of Technology, supervised by Michael I. Jordan and Tomaso Poggio.\n\n",
        "dblp_record": 322
    },
    {
        "letter": "G",
        "name": "Sanjay Ghemawat",
        "awards": 1,
        "education": "Null",
        "dblp_record": 28
    },
    {
        "letter": "G",
        "name": "Jeremy Gibbons",
        "awards": 0,
        "education": "Null",
        "dblp_record": 144
    },
    {
        "letter": "G",
        "name": "Juan E. Gilbert",
        "awards": 19,
        "education": "\nPh.D., University of Cincinnati, Cincinnati, Ohio, 2000 (Computer Science); dissertation: \"Arthur: An Intelligent Tutoring System with Adaptive Instruction\"\n\n",
        "dblp_record": 129
    },
    {
        "letter": "G",
        "name": "Lee Giles",
        "awards": 7,
        "education": "Null",
        "dblp_record": 571
    },
    {
        "letter": "G",
        "name": "Seymour Ginsburg",
        "awards": 0,
        "education": "Null",
        "dblp_record": 117
    },
    {
        "letter": "G",
        "name": "Robert L. Glass",
        "awards": 0,
        "education": "Null",
        "dblp_record": 297
    },
    {
        "letter": "G",
        "name": "Kurt Gödel",
        "awards": 3,
        "education": "\nChildhoodedit]\nGödel was born April 28, 1906, in Brünn, Austria-Hungary (now Brno, Czech Republic), into the German-speaking family of Rudolf Gödel (1874–1929), the managing director and part owner of a major textile firm, and Marianne Gödel (née Handschuh, 1879–1966). At the time of his birth the city had a German-speaking majority which included his parents. His father was Catholic and his mother was Protestant and the children were raised as Protestants. The ancestors of Kurt Gödel were often active in Brünn's cultural life. For example, his grandfather Joseph Gödel was a famous singer in his time and for some years a member of the Brünner Männergesangverein (Men's Choral Union of Brünn).\nGödel automatically became a citizen of Czechoslovakia at age 12 when the Austro-Hungarian Empire collapsed following its defeat in the First World War. According to his classmate Klepetař, like many residents of the predominantly German Sudetenländer, \"Gödel considered himself always Austrian and an exile in Czechoslovakia\". In February 1929, he was granted release from his Czechoslovakian citizenship and then, in April, granted Austrian citizenship. When Germany annexed Austria in 1938, Gödel automatically became a German citizen at age 32. In 1948, after World War II, at the age of 42, he became an American citizen.\nIn his family, the young Gödel was nicknamed Herr Warum (\"Mr. Why\") because of his insatiable curiosity. According to his brother Rudolf, at the age of six or seven, Kurt suffered from rheumatic fever; he completely recovered, but for the rest of his life he remained convinced that his heart had suffered permanent damage. Beginning at age four, Gödel suffered from \"frequent episodes of poor health\", which would continue for his entire life.\nGödel attended the Evangelische Volksschule, a Lutheran school in Brünn from 1912 to 1916, and was enrolled in the Deutsches Staats-Realgymnasium from 1916 to 1924, excelling with honors in all his subjects, particularly in mathematics, languages and religion. Although Gödel had first excelled in languages, he later became more interested in history and mathematics. His interest in mathematics increased when in 1920 his older brother Rudolf (born 1902) left for Vienna, where he attended medical school at the University of Vienna. During his teens, Gödel studied Gabelsberger shorthand, Goethe's Theory of Colours and criticisms of Isaac Newton, and the writings of Immanuel Kant.citation needed]\n\nStudies in Viennaedit]\nPlaque to Gödel at 43-45 Josefstädter Straße de], Vienna, where he discovered his incompleteness theorems\nAt the age of 18, Gödel joined his brother at the University of Vienna. By that time, he had already mastered university-level mathematics. Although initially intending to study theoretical physics, he also attended courses on mathematics and philosophy. During this time, he adopted ideas of mathematical realism. He read Kant's Metaphysische Anfangsgründe der Naturwissenschaft, and participated in the Vienna Circle with Moritz Schlick, Hans Hahn, and Rudolf Carnap. Gödel then studied number theory, but when he took part in a seminar run by Moritz Schlick which studied Bertrand Russell's book Introduction to Mathematical Philosophy, he became interested in mathematical logic. According to Gödel, mathematical logic was \"a science prior to all others, which contains the ideas and principles underlying all sciences.\"\nAttending a lecture by David Hilbert in Bologna on completeness and consistency in mathematical systems may have set Gödel's life course. In 1928, Hilbert and Wilhelm Ackermann published Grundzüge der theoretischen Logik (Principles of Mathematical Logic), an introduction to first-order logic in which the problem of completeness was posed: \"Are the axioms of a formal system sufficient to derive every statement that is true in all models of the system?\"\nThis problem became the topic that Gödel chose for his doctoral work. In 1929, at the age of 23, he completed his doctoral dissertation under Hans Hahn's supervision. In it, he established his eponymous completeness theorem regarding the first-order predicate calculus. He was awarded his doctorate in 1930, and his thesis (accompanied by some additional work) was published by the Vienna Academy of Science.\n\n",
        "dblp_record": 1
    },
    {
        "letter": "G",
        "name": "Ashok Goel",
        "awards": 1,
        "education": "Null",
        "dblp_record": 235
    },
    {
        "letter": "G",
        "name": "Joseph Goguen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 137
    },
    {
        "letter": "G",
        "name": "E. Mark Gold",
        "awards": 0,
        "education": "\nIn 1956, he got a B.S. in mathematics from the California Institute of Technology,\nin 1958, he got a M.S. in physics from Princeton University.: vi \nIn Jan 1965, got his Ph.D. from UCLA, supervised by Abraham Robinson.: i : 403 \n\n",
        "dblp_record": 7
    },
    {
        "letter": "G",
        "name": "Adele Goldberg",
        "awards": 0,
        "education": "\nGoldberg was born in Cleveland, Ohio, on July 22, 1945.  Her parents moved to Chicago, Illinois when she was 11, where she spent the rest of her childhood. She enjoyed problem solving and mathematics from a young age and was encouraged by her teachers to pursue mathematics. In 1967, she earned a bachelor's degree in mathematics at the University of Michigan.  Interested in the subject of computing, Goldberg worked as an intern with IBM during the summer of her junior year of college, where she learned how to program unit record machines.  After graduating, she attended the University of Chicago, where she received her master's degree (in 1969) and a PhD (in 1973) in information science. She completed her dissertation, \"Computer-Assisted Instruction: The Application of Theorem-proving to Adaptive Response Analysis,\" while working as a research associate at Stanford University. She also served as a visiting researcher at Stanford.\n\n",
        "dblp_record": 36
    },
    {
        "letter": "G",
        "name": "Andrew V. Goldberg",
        "awards": 2,
        "education": "Null",
        "dblp_record": 150
    },
    {
        "letter": "G",
        "name": "Ian Goldberg",
        "awards": 0,
        "education": "\nHe attended high school at the University of Toronto Schools, graduating in 1991. In 1995, he received a B.Math from the University of Waterloo in pure mathematics and computer science. He obtained a Ph.D. from the University of California, Berkeley in December 2000. His thesis was entitled A Pseudonymous Communications Infrastructure for the Internet. His advisor was Eric Brewer.\n\n",
        "dblp_record": 145
    },
    {
        "letter": "G",
        "name": "Judy Goldsmith",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "G",
        "name": "Oded Goldreich",
        "awards": 1,
        "education": "Null",
        "dblp_record": 524
    },
    {
        "letter": "G",
        "name": "Shafi Goldwasser",
        "awards": 11,
        "education": "Null",
        "dblp_record": 234
    },
    {
        "letter": "G",
        "name": "Gene Golub",
        "awards": 0,
        "education": "Null",
        "dblp_record": 118
    },
    {
        "letter": "G",
        "name": "Martin Charles Golumbic",
        "awards": 0,
        "education": "Null",
        "dblp_record": 109
    },
    {
        "letter": "G",
        "name": "Gastón Gonnet",
        "awards": 0,
        "education": "Null",
        "dblp_record": 102
    },
    {
        "letter": "G",
        "name": "Ian Goodfellow",
        "awards": 0,
        "education": "\nGoodfellow obtained his B.S. and M.S. in computer science from Stanford University under the supervision of Andrew Ng (co-founder and head of Google Brain), and his Ph.D. in machine learning from the Université de Montréal in April 2014, under the supervision of Yoshua Bengio and Aaron Courville. Goodfellow's thesis is titled Deep learning of representations and its application to computer vision.\n\n",
        "dblp_record": 108
    },
    {
        "letter": "G",
        "name": "James Gosling",
        "awards": 5,
        "education": "Null",
        "dblp_record": 15
    },
    {
        "letter": "G",
        "name": "Paul Graham",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "G",
        "name": "Robert M. Graham",
        "awards": 0,
        "education": "Null",
        "dblp_record": 25
    },
    {
        "letter": "G",
        "name": "Susan L. Graham",
        "awards": 5,
        "education": "Null",
        "dblp_record": 75
    },
    {
        "letter": "G",
        "name": "Jim Gray",
        "awards": 5,
        "education": "Null",
        "dblp_record": 174
    },
    {
        "letter": "G",
        "name": "Sheila Greibach",
        "awards": 0,
        "education": "Null",
        "dblp_record": 77
    },
    {
        "letter": "G",
        "name": "David Gries",
        "awards": 4,
        "education": "Null",
        "dblp_record": 125
    },
    {
        "letter": "G",
        "name": "Ralph Griswold",
        "awards": 0,
        "education": "Null",
        "dblp_record": 46
    },
    {
        "letter": "G",
        "name": "Bill Gropp",
        "awards": 1,
        "education": "Null",
        "dblp_record": 310
    },
    {
        "letter": "G",
        "name": "Tom Gruber",
        "awards": 0,
        "education": "Null",
        "dblp_record": 25
    },
    {
        "letter": "G",
        "name": "Shelia Guberman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "G",
        "name": "Ramanathan V. Guha",
        "awards": 2,
        "education": "\nGuha did his schooling from Loyola High School, Pune and graduated with Bachelor of Technology in Mechanical Engineering from the Indian Institute of Technology Madras, Master of Science from University of California, Berkeley and Ph.D from Stanford University.\n\n",
        "dblp_record": 39
    },
    {
        "letter": "G",
        "name": "Neil J. Gunther",
        "awards": 9,
        "education": "Null",
        "dblp_record": 58
    },
    {
        "letter": "G",
        "name": "Jürg Gutknecht",
        "awards": 0,
        "education": "Null",
        "dblp_record": 46
    },
    {
        "letter": "G",
        "name": "Michael Guy",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "G",
        "name": "Robert Griesemer",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Nico Habermann",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Philipp Matthäus Hahn",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Eldon C. Hall",
        "awards": 1,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "H",
        "name": "Wendy Hall",
        "awards": 6,
        "education": "\nWendy Hall was born in west London and educated at Ealing Grammar School for Girls. She studied for undergraduate and postgraduate degrees in mathematics at the University of Southampton. She completed her Bachelor of Science (BSc) degree in 1974, and her Doctor of Philosophy (PhD) degree in 1977. Her doctoral thesis was titled Automorphisms and coverings of Klein surfaces. She later completed a Master of Science degree in Computing at City University London.\n\n",
        "dblp_record": 271
    },
    {
        "letter": "H",
        "name": "Joseph Halpern",
        "awards": 2,
        "education": "Null",
        "dblp_record": 627
    },
    {
        "letter": "H",
        "name": "Margaret Hamilton",
        "awards": 11,
        "education": "\nMargaret Elaine Heafield was born August 17, 1936, in Paoli, Indiana, to Kenneth Heafield and Ruth Esther Heafield (née Partington). The family later moved to Michigan, where Margaret graduated from Hancock High School in 1954. She studied mathematics at the University of Michigan in 1955 before transferring to Earlham College, where her mother had been a student; she earned a BA in mathematics with a minor in philosophy in 1958. She cites Florence Long, the head of the math department at Earlham, as helping with her desire to pursue abstract mathematics and become a mathematics professor. She says her poet father and headmaster grandfather inspired her to include a minor in philosophy in her studies.\n\n",
        "dblp_record": 10
    },
    {
        "letter": "H",
        "name": "Richard Hamming",
        "awards": 4,
        "education": "Null",
        "dblp_record": 16
    },
    {
        "letter": "H",
        "name": "Jiawei Han",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1231
    },
    {
        "letter": "H",
        "name": "Frank Harary",
        "awards": 0,
        "education": "Null",
        "dblp_record": 117
    },
    {
        "letter": "H",
        "name": "Brian Harris",
        "awards": 0,
        "education": "\nHarris was born in 1929. He was brought up in London, where he took degrees in Classical Arabic and in Middle East History at the School of Oriental and African Studies. He also studied at the American University in Cairo, and did postgraduate work on Lebanese history under Bernard Lewis, the leading Western authority on the Ottoman Empire. Lewis arranged for him to do research in the archives of the Quai d'Orsay in Paris.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Juris Hartmanis",
        "awards": 3,
        "education": "Null",
        "dblp_record": 135
    },
    {
        "letter": "H",
        "name": "Johan Håstad",
        "awards": 4,
        "education": "Null",
        "dblp_record": 179
    },
    {
        "letter": "H",
        "name": "Les Hatton",
        "awards": 3,
        "education": "Null",
        "dblp_record": 49
    },
    {
        "letter": "H",
        "name": "Igor Hawryszkiewycz",
        "awards": 0,
        "education": "Null",
        "dblp_record": 147
    },
    {
        "letter": "H",
        "name": "He Jifeng",
        "awards": 0,
        "education": "Null",
        "dblp_record": 215
    },
    {
        "letter": "H",
        "name": "Eric Hehner",
        "awards": 0,
        "education": "Null",
        "dblp_record": 52
    },
    {
        "letter": "H",
        "name": "Martin Hellman",
        "awards": 5,
        "education": "Null",
        "dblp_record": 50
    },
    {
        "letter": "H",
        "name": "Gernot Heiser",
        "awards": 14,
        "education": "Null",
        "dblp_record": 130
    },
    {
        "letter": "H",
        "name": "James Hendler",
        "awards": 0,
        "education": "\nHendler completed his Doctor of Philosophy degree at Brown University in 1986 with a thesis on automated planning and scheduling.  He also has an MS (1981) in Cognitive Psychology from Southern Methodist University, a MSc (1983) from Brown University, and a BS (1978) from Yale University.\n\n",
        "dblp_record": 307
    },
    {
        "letter": "H",
        "name": "John L. Hennessy",
        "awards": 9,
        "education": "\nHennessy was raised in Huntington, New York, as one of six children. His father was an aerospace engineer, and his mother was a teacher before raising her children. He is of Irish-Catholic descent, with some of his ancestors arriving in America during the potato famine in the 19th century. \nHe earned his bachelor's degree in electrical engineering from Villanova University, and his master's degree and Doctor of Philosophy in computer science from Stony Brook University.\n\n",
        "dblp_record": 113
    },
    {
        "letter": "H",
        "name": "Andrew Herbert",
        "awards": 0,
        "education": "Null",
        "dblp_record": 19
    },
    {
        "letter": "H",
        "name": "Carl Hewitt",
        "awards": 0,
        "education": "Null",
        "dblp_record": 63
    },
    {
        "letter": "H",
        "name": "Kelsey Hightower",
        "awards": 0,
        "education": "\nHightower grew up in Long Beach, California, then moved to Atlanta, Georgia with his mother as he was beginning high school. After high school he enrolled at Clayton State University, but found the technology courses to be lacking and didn't continue. He then began courses to earn his CompTIA A+ information technology (IT) certification.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Danny Hillis",
        "awards": 0,
        "education": "Null",
        "dblp_record": 15
    },
    {
        "letter": "H",
        "name": "Geoffrey Hinton",
        "awards": 9,
        "education": "\nHinton was educated at King's College, Cambridge. After repeatedly changing his degree between different subjects like natural sciences, history of art, and philosophy, he eventually graduated in 1970 with a bachelor of arts in experimental psychology. He continued his study at the University of Edinburgh where he was awarded a PhD in artificial intelligence in 1978 for research supervised by Christopher Longuet-Higgins.\n\n",
        "dblp_record": 294
    },
    {
        "letter": "H",
        "name": "Julia Hirschberg",
        "awards": 2,
        "education": "Null",
        "dblp_record": 229
    },
    {
        "letter": "H",
        "name": "Tin Kam Ho",
        "awards": 0,
        "education": "\nHo completed her undergraduate education at the Chinese University of Hong Kong in 1984.  She received a Ph.D. in computer science from State University of New York at Buffalo in 1992.\n\n",
        "dblp_record": 95
    },
    {
        "letter": "H",
        "name": "C. A. R. Hoare",
        "awards": 5,
        "education": "Null",
        "dblp_record": 194
    },
    {
        "letter": "H",
        "name": "Louis Hodes",
        "awards": 0,
        "education": "Null",
        "dblp_record": 16
    },
    {
        "letter": "H",
        "name": "Betty Holberton",
        "awards": 4,
        "education": "\nHolberton was born Frances Elizabeth Snyder in Philadelphia, Pennsylvania in 1917. Her father was John Amos Snyder (1884–1963), her mother was Frances J. Morrow (1892–1981), and she was the third child in a family of eight children.\nHolberton studied journalism, because its curriculum let her travel far afield. Journalism was also one of the few fields open to women as a career in the 1940s. On her first day of classes at the University of Pennsylvania, her math professor asked her if she wouldn't be better off at home raising children.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "John Henry Holland",
        "awards": 5,
        "education": "Null",
        "dblp_record": 25
    },
    {
        "letter": "H",
        "name": "Herman Hollerith",
        "awards": 3,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Gerard Holzmann",
        "awards": 4,
        "education": "Null",
        "dblp_record": 148
    },
    {
        "letter": "H",
        "name": "John Hopcroft",
        "awards": 7,
        "education": "\nHe received his bachelor's degree from Seattle University in 1961. He received his master's degree and Ph.D. from Stanford University in 1962 and 1964, respectively. He worked for three years at Princeton University and since then has been at Cornell University. Hopcroft is the grandson of Jacob Nist, founder of the Seattle-Tacoma Box Company.\n\n",
        "dblp_record": 203
    },
    {
        "letter": "H",
        "name": "Grace Hopper",
        "awards": 9,
        "education": "\nGrace Brewster Murray was born in New York City. She was the eldest of three children. Her parents, Walter Fletcher Murray and Mary Campbell Van Horne, were of Scottish and Dutch descent, and attended West End Collegiate Church. Her great-grandfather, Alexander Wilson Russell, an admiral in the US Navy, fought in the Battle of Mobile Bay during the Civil War.: 2–3 \nGrace was very curious as a child; this was a lifelong trait. At the age of seven, she decided to determine how an alarm clock worked and dismantled seven alarm clocks before her mother realized what she was doing (she was then limited to one clock). Later in life, she was known for keeping a clock that ran backward, she explained, “Humans are allergic to change. They love to say, ‘We’ve always done it this way.’ I try to fight that. That’s why I have a clock on my wall that runs counterclockwise.” For her preparatory school education, she attended the Hartridge School in Plainfield, New Jersey. Grace was initially rejected for early admission to Vassar College at age 16 (because her test scores in Latin were too low), but she was admitted the following year. She graduated Phi Beta Kappa from Vassar in 1928 with a bachelor's degree in mathematics and physics and earned her master's degree at Yale University in 1930.\nIn 1930, Grace Murray married New York University professor Vincent Foster Hopper (1906–1976); they divorced in 1945. She did not marry again and retained his surname.\nIn 1934, Hopper earned a Ph.D. in mathematics from Yale under the direction of Øystein Ore. Her dissertation, \"New Types of Irreducibility Criteria\", was published that same year. She began teaching mathematics at Vassar in 1931, and was promoted to associate professor in 1941.\n\n",
        "dblp_record": 7
    },
    {
        "letter": "H",
        "name": "Eric Horvitz",
        "awards": 0,
        "education": "Null",
        "dblp_record": 421
    },
    {
        "letter": "H",
        "name": "Alston Householder",
        "awards": 0,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "H",
        "name": "Paul Hudak",
        "awards": 6,
        "education": "Null",
        "dblp_record": 99
    },
    {
        "letter": "H",
        "name": "David A. Huffman",
        "awards": 5,
        "education": "\nHuffman earned his bachelor's degree in electrical engineering from Ohio State University in 1944. Then, he served two years as an officer in the United States Navy. He returned to Ohio State to earn his master's degree in electrical engineering in 1949. In 1953, he earned his Doctor of Science in electrical engineering at the Massachusetts Institute of Technology (MIT), with the thesis The Synthesis of Sequential Switching Circuits, advised by Samuel H. Caldwell.\n\n",
        "dblp_record": 8
    },
    {
        "letter": "H",
        "name": "John Hughes",
        "awards": 2,
        "education": "Null",
        "dblp_record": 99
    },
    {
        "letter": "H",
        "name": "Roger Hui",
        "awards": 2,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "H",
        "name": "Watts Humphrey",
        "awards": 3,
        "education": "Null",
        "dblp_record": 51
    },
    {
        "letter": "H",
        "name": "Sandra Hutchins",
        "awards": 0,
        "education": "\nHutchins received her B.A. from the University of California, San Diego, in 1967. During her undergraduate studies, Hutchins majored in physics and minored in linguistics. In 1970, she received her Ph.D. in computer science, also from the University of California, San Diego.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "I",
        "name": "Jean Ichbiah",
        "awards": 0,
        "education": "Null",
        "dblp_record": 11
    },
    {
        "letter": "I",
        "name": "Roberto Ierusalimschy",
        "awards": 0,
        "education": "Null",
        "dblp_record": 73
    },
    {
        "letter": "I",
        "name": "Dan Ingalls",
        "awards": 12,
        "education": "\nIngalls received his Bachelor of Arts (B.A.) in physics from Harvard University, and his Master of Science (M.S.) in electrical engineering from Stanford University. While working toward a Doctor of Philosophy (Ph.D.) at Stanford, he started a company to sell a software measurement invention that he perfected, and never returned to academia.\n\n",
        "dblp_record": 22
    },
    {
        "letter": "I",
        "name": "Mary Jane Irwin",
        "awards": 14,
        "education": "Null",
        "dblp_record": 370
    },
    {
        "letter": "I",
        "name": "Kenneth E. Iverson",
        "awards": 4,
        "education": "\nIverson began school on 1 April 1926 in a one-room school, initially in Grade 1, promoted to Grade 2 after 3 months and to Grade 4 by the end of June 1927.\nHe left school after Grade 9 because it was the depths of the Great Depression and there was work to do on the family farm, and because he thought further schooling only led to becoming a schoolteacher and he had no desire to become one.  At age 17, while still out of school, he enrolled in a correspondence course on radios with De Forest Training in Chicago, and learned calculus by self-study from a textbook.\nDuring World War II, while serving in the Royal Canadian Air Force, he took correspondence courses toward a high school diploma.\nAfter the war, Iverson enrolled in Queen's University in Kingston, Ontario, taking advantage of government support for ex-servicemen and under threat from an Air Force buddy who said he would \"beat his brains out if he did not grasp the opportunity\". He graduated in 1950 as the top student with a Bachelor's degree in mathematics and physics.\nContinuing his education at Harvard University, he began in the Department of Mathematics and received a Master's degree in 1951.  He then switched to the Department of Engineering and Applied Physics, working with Howard Aiken and Wassily Leontief.\n\n.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}Kenneth Iverson has recalled graduate study under Aiken as \"like an apprenticeship\" in which the student \"learned the tools of the scholarship trade\". Every topic was \"used more as a focus for the development of skills such as clarity of thought and expression than as an end in itself\". Once admitted to the program, a graduate student underwent a rite of \"adoption into the fold\". He was given a desk (or a share of a desk) among a group of other graduate students, the permanent staff, or visiting scholars, \"most of whom were engaged in some aspect of the design and building of computers\". A student was thus \"made to feel part of a scholarly enterprise\" and was provided, \"often for the first time, with easy and intimate access to others more experienced in his chosen field\".— I. Bernard Cohen, Howard Aiken: Portrait of a Computer Pioneer, MIT Press, 1999, page 215.\nWhen interviewing Aiken, I had asked him whether Tropp and I might see his lecture notes; Aiken replied that he had always destroyed his lecture notes at the end of each year, so that he would not be tempted to repeat his lectures.— I. Bernard Cohen and Gregory W. Welch, editors, Makin' Numbers, MIT Press, 1999, page xvi.\nHoward Aiken had developed the Harvard Mark I, one of the first large-scale digital computers, while Wassily Leontief was an economist who was developing the input–output model of economic analysis, work for which he would later receive the Nobel prize. Leontief's model required large matrices and Iverson worked on programs that could evaluate these matrices on the Harvard Mark IV computer. Iverson received a Ph.D. in applied mathematics in 1954 with a dissertation based on this work.\nAt Harvard, Iverson met Eoin Whitney, a 2-time Putnam Fellow and fellow graduate student from Alberta.  This had future ramifications.\n\n",
        "dblp_record": 45
    },
    {
        "letter": "J",
        "name": "Ivar Jacobson",
        "awards": 0,
        "education": "Null",
        "dblp_record": 72
    },
    {
        "letter": "J",
        "name": "Anil K. Jain",
        "awards": 10,
        "education": "Null",
        "dblp_record": 822
    },
    {
        "letter": "J",
        "name": "Ramesh Jain",
        "awards": 0,
        "education": "\nHe graduated with a bachelor's degree from Visvesvaraya National Institute of Technology, Nagpur, India and has a Ph.D. in electronics engineering (1975) from Indian Institute of Technology, Kharagpur, India.\n\n",
        "dblp_record": 505
    },
    {
        "letter": "J",
        "name": "Jonathan James",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "J",
        "name": "David S. Johnson",
        "awards": 2,
        "education": "Null",
        "dblp_record": 165
    },
    {
        "letter": "J",
        "name": "Stephen C. Johnson",
        "awards": 0,
        "education": "\nJohnson's passion for computing started at age five, when his grandfather took him along to his work at the Bureau of Standards. The computer he saw (\"the size of a small house\") made a strong impression on him, and he decided he \"wanted to work with computers, and never looked back after\".\nThere were no computer science classes in college, so he studied mathematics, in which he eventually earned a PhD.\n\n",
        "dblp_record": 34
    },
    {
        "letter": "J",
        "name": "Cliff Jones",
        "awards": 0,
        "education": "Null",
        "dblp_record": 166
    },
    {
        "letter": "J",
        "name": "Michael I. Jordan",
        "awards": 5,
        "education": "\nJordan received his BS magna cum laude in Psychology in 1978 from the Louisiana State University, his MS in Mathematics in 1980 from Arizona State University and his PhD in Cognitive Science in 1985 from the University of California, San Diego. At the University of California, San Diego, Jordan was a student of David Rumelhart and a member of the Parallel Distributed Processing (PDP) Group in the 1980s.\n\n",
        "dblp_record": 841
    },
    {
        "letter": "J",
        "name": "Mathai Joseph",
        "awards": 5,
        "education": "\nJoseph studied for a BSc in physics at Wilson College (Mumbai, India, 1962) and an MSc in the same subject at the University of Mumbai in 1964. He later studied for a Postgraduate Diploma in electronics at the Welsh College of Advanced Technology (1965) and then undertook a PhD in computing at Churchill College, Cambridge under the supervision of David Wheeler (awarded 1968).\nFrom 1968 to 1985, Joseph worked on programming as a fellow and senior research scientist at the Tata Institute of Fundamental Research (Mumbai, India) and then became professor of computer science at the University of Warwick in England for 12 years (1985–97). He returned to India in 1997. He then worked in industry as Executive Director at the Tata Research Development and Design Centre (Pune) and as Executive Vice-President at Tata Consultancy Services (1997–2007).citation needed]\n\n",
        "dblp_record": 44
    },
    {
        "letter": "J",
        "name": "Aravind K. Joshi",
        "awards": 0,
        "education": "Null",
        "dblp_record": 182
    },
    {
        "letter": "J",
        "name": "Bill Joy",
        "awards": 4,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "J",
        "name": "Dan Jurafsky",
        "awards": 3,
        "education": "\nJurafsky received his B.A in linguistics (1983) and Ph.D. in computer science (1992), both at University of California, Berkeley; and then a postdoc at International Computer Science Institute, Berkeley (1992–1995).\n\n",
        "dblp_record": 316
    },
    {
        "letter": "K",
        "name": "William Kahan",
        "awards": 1,
        "education": "Null",
        "dblp_record": 28
    },
    {
        "letter": "K",
        "name": "Robert E. Kahn",
        "awards": 12,
        "education": "Null",
        "dblp_record": 29
    },
    {
        "letter": "K",
        "name": "Avinash Kak",
        "awards": 0,
        "education": "Null",
        "dblp_record": 171
    },
    {
        "letter": "K",
        "name": "Poul-Henning Kamp",
        "awards": 0,
        "education": "Null",
        "dblp_record": 44
    },
    {
        "letter": "K",
        "name": "David Karger",
        "awards": 3,
        "education": "\nKarger received a Bachelor of Arts degree from Harvard University and a PhD in computer science from Stanford University.\n\n",
        "dblp_record": 279
    },
    {
        "letter": "K",
        "name": "Richard Karp",
        "awards": 16,
        "education": "Null",
        "dblp_record": 251
    },
    {
        "letter": "K",
        "name": "Narendra Karmarkar",
        "awards": 11,
        "education": "Null",
        "dblp_record": 21
    },
    {
        "letter": "K",
        "name": "Marek Karpinski",
        "awards": 0,
        "education": "Null",
        "dblp_record": 338
    },
    {
        "letter": "K",
        "name": "Ted Kaehler",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "K",
        "name": "Alan Kay",
        "awards": 6,
        "education": "Null",
        "dblp_record": 39
    },
    {
        "letter": "K",
        "name": "Neeraj Kayal",
        "awards": 2,
        "education": "\nKayal was born and raised in Guwahati, India.\nKayal graduated with a B.Tech from the Computer Science Department of the Indian Institute of Technology, Kanpur (IITK), India in 2002. In that year, Neeraj along with Manindra Agrawal and Nitin Saxena proposed the AKS primality test, which attracted worldwide attention, including an article in The New York Times.\nKayal received his PhD in theoretical computer science from the Department of Computer Science and Engineering at the Indian Institute of Technology, Kanpur. He did postdoctoral research at the Institute for Advanced Study in Princeton and at Rutgers University. Since 2008, he has been working with the Microsoft Research Lab India as a researcher.\n\n",
        "dblp_record": 78
    },
    {
        "letter": "K",
        "name": "Manolis Kellis",
        "awards": 3,
        "education": "Null",
        "dblp_record": 45
    },
    {
        "letter": "K",
        "name": "John George Kemeny",
        "awards": 4,
        "education": "Null",
        "dblp_record": 7
    },
    {
        "letter": "K",
        "name": "Ken Kennedy",
        "awards": 0,
        "education": "Null",
        "dblp_record": 206
    },
    {
        "letter": "K",
        "name": "Brian Kernighan",
        "awards": 0,
        "education": "\nBrian Kernighan speaks at a tribute to Dennis Ritchie in 2012 at Bell Labs.\nKernighan was born in Toronto. He attended the University of Toronto between 1960 and 1964, earning his bachelor's degree in engineering physics. He received his Ph.D. in electrical engineering from Princeton University in 1969, completing a doctoral dissertation titled \"Some graph partitioning problems related to program segmentation\" under the supervision of Peter G. Weiner.\n\n",
        "dblp_record": 54
    },
    {
        "letter": "K",
        "name": "Carl Kesselman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 171
    },
    {
        "letter": "K",
        "name": "Gregor Kiczales",
        "awards": 0,
        "education": "Null",
        "dblp_record": 69
    },
    {
        "letter": "K",
        "name": "Peter T. Kirstein",
        "awards": 3,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "K",
        "name": "Stephen Cole Kleene",
        "awards": 8,
        "education": "Null",
        "dblp_record": 11
    },
    {
        "letter": "K",
        "name": "Dan Klein",
        "awards": 1,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "K",
        "name": "Leonard Kleinrock",
        "awards": 5,
        "education": "Null",
        "dblp_record": 180
    },
    {
        "letter": "K",
        "name": "Donald Knuth",
        "awards": 13,
        "education": "Null",
        "dblp_record": 185
    },
    {
        "letter": "K",
        "name": "Andrew Koenig",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "K",
        "name": "Daphne Koller",
        "awards": 5,
        "education": "\nKoller received a bachelor's degree from the Hebrew University of Jerusalem in 1985, at the age of 17, and a master's degree from the same institution in 1986, at the age of 18. She completed her PhD at Stanford in 1993 under the supervision of Joseph Halpern.\n\n",
        "dblp_record": 264
    },
    {
        "letter": "K",
        "name": "Michael Kölling",
        "awards": 8,
        "education": "Null",
        "dblp_record": 93
    },
    {
        "letter": "K",
        "name": "Andrey Nikolaevich Kolmogorov",
        "awards": 7,
        "education": "Null",
        "dblp_record": 4
    },
    {
        "letter": "K",
        "name": "Janet L. Kolodner",
        "awards": 8,
        "education": "\nKolodner graduated with a Bachelor of Arts degree in math and computer science from Brandeis University in 1976. She then completed her Master of Science degree in computer science in 1977 and her PhD in computer science in 1980 from Yale University.\n\n",
        "dblp_record": 70
    },
    {
        "letter": "K",
        "name": "David Korn",
        "awards": 0,
        "education": "Null",
        "dblp_record": 10
    },
    {
        "letter": "K",
        "name": "Kees Koster",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "K",
        "name": "Robert Kowalski",
        "awards": 2,
        "education": "\nHe was educated at the University of Chicago, University of Bridgeport (BA in mathematics, 1963), Stanford University (MSc in mathematics, 1966), University of Warsaw and the University of Edinburgh (PhD in computer science, 1970).\n\n",
        "dblp_record": 104
    },
    {
        "letter": "K",
        "name": "John Koza",
        "awards": 0,
        "education": "Null",
        "dblp_record": 73
    },
    {
        "letter": "K",
        "name": "John Krogstie",
        "awards": 0,
        "education": "Null",
        "dblp_record": 260
    },
    {
        "letter": "K",
        "name": "Joseph Kruskal",
        "awards": 0,
        "education": "Null",
        "dblp_record": 9
    },
    {
        "letter": "K",
        "name": "Maarja Kruusmaa",
        "awards": 4,
        "education": "Null",
        "dblp_record": 57
    },
    {
        "letter": "K",
        "name": "Thomas E. Kurtz",
        "awards": 1,
        "education": "\nIn 1951, Kurtz' first experience with computing came at the Summer Session of the Institute for Numerical Analysis at University of California, Los Angeles. His interests have included numerical analysis, statistics, and computer science ever since. He graduated in 1950 when he obtained his bachelor's degree majoring in mathematics and in 1956, at the age of 28, he went on to acquire his PhD from Princeton University. His thesis was on a problem of multiple comparisons in mathematical statistics. Kurtz composed his first computer program in 1951 while working with computers at UCLA in the institute of numerical analysis. He performed this feat just after finishing grad school and one year into his tuition at Princeton University.\n\n",
        "dblp_record": 6
    },
    {
        "letter": "L",
        "name": "Richard E. Ladner",
        "awards": 4,
        "education": "Null",
        "dblp_record": 249
    },
    {
        "letter": "L",
        "name": "Monica S. Lam",
        "awards": 9,
        "education": "Null",
        "dblp_record": 168
    },
    {
        "letter": "L",
        "name": "Leslie Lamport",
        "awards": 6,
        "education": "\nLamport was born into a Jewish family in Brooklyn, New York, the son of Benjamin and Hannah Lamport (née Lasser).citation needed] His father was an immigrant from Volkovisk in the Russian Empire (now Vawkavysk, Belarus) and his mother was an immigrant from the Austro-Hungarian Empire, now southeastern Poland.\nA graduate of Bronx High School of Science, Lamport received a B.S. in mathematics from the Massachusetts Institute of Technology in 1960, followed by M.A. (1963) and Ph.D. (1972) degrees in mathematics from Brandeis University. His dissertation, The analytic Cauchy problem with singular data, is about singularities in analytic partial differential equations.\n\n",
        "dblp_record": 173
    },
    {
        "letter": "L",
        "name": "Butler Lampson",
        "awards": 6,
        "education": "Null",
        "dblp_record": 82
    },
    {
        "letter": "L",
        "name": "Peter Landin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 8
    },
    {
        "letter": "L",
        "name": "Tom Lane",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Börje Langefors",
        "awards": 0,
        "education": "Null",
        "dblp_record": 9
    },
    {
        "letter": "L",
        "name": "Chris Lattner",
        "awards": 2,
        "education": "\nLattner studied computer science at the University of Portland, graduating in with a Bachelor of Science degree in 2000. While in Oregon, he worked as an operating system developer, enhancing Sequent Computer Systems's DYNIX/ptx. He moved to the University of Illinois at Urbana-Champaign where he was awarded a Master of Science degree in 2002, followed by a PhD in 2005 for research on optimizing pointer-intensive programs, supervised by Vikram Adve.\n\n",
        "dblp_record": 14
    },
    {
        "letter": "L",
        "name": "Steve Lawrence",
        "awards": 0,
        "education": "Null",
        "dblp_record": 74
    },
    {
        "letter": "L",
        "name": "Edward D. Lazowska",
        "awards": 0,
        "education": "Null",
        "dblp_record": 107
    },
    {
        "letter": "L",
        "name": "Joshua Lederberg",
        "awards": 3,
        "education": "\nLederberg was born in Montclair, New Jersey, to a Jewish family, son of Esther Goldenbaum Schulman Lederberg and Rabbi Zvi Hirsch Lederberg, in 1925, and moved to Washington Heights, Manhattan as an infant. He had two younger brothers. Lederberg graduated from Stuyvesant High School in New York City at the age of 15 in 1941. After graduation, he was allowed lab space as part of the American Institute Science Laboratory, a forerunner of the Westinghouse Science Talent Search. He enrolled in Columbia University in 1941, majoring in zoology. Under the mentorship of Francis J. Ryan, he conducted biochemical and genetic studies on the bread mold Neurospora crassa. Intending to receive his MD and fulfill his military service obligations, Lederberg worked as a hospital corpsman during 1943 in the clinical pathology laboratory at St. Albans Naval Hospital, where he examined sailors' blood and stool samples for malaria. He went on to receive his undergraduate degree in 1944.\n\n",
        "dblp_record": 6
    },
    {
        "letter": "L",
        "name": "Manny M Lehman",
        "awards": 3,
        "education": "Null",
        "dblp_record": 73
    },
    {
        "letter": "L",
        "name": "Charles E. Leiserson",
        "awards": 0,
        "education": "Null",
        "dblp_record": 136
    },
    {
        "letter": "L",
        "name": "Douglas Lenat",
        "awards": 6,
        "education": "\nLenat was born in Philadelphia, United States, on September 13, 1950. When he was 5, the family moved to Wilmington, Delaware, where his father, Nathan Lenat, owned a bottling plant.  His father died when he was 13 and the family then returned to Pennsylvania, where he attended Cheltenham High School.  His after-school job was cleaning rat cages and goose pens at Beaver College which motivated him to learn programming as a better occupation.\nHe attended the University of Pennsylvania, supporting himself by programming, including the design and development of a natural language interface for a United States Navy online operations manual.  He graduated with bachelor's degrees in Mathematics and Physics, and a master's degree in Applied Mathematics, all in 1972.\nFor his senior thesis, advised in part by Dennis Gabor, was to bounce acoustic waves in the 40 mHz range off real-world objects, record their interference patterns on a 2-meter square plot, photo-reduce those to a 10-mm square film image, shine a laser through the film, and thus project the three-dimensional imaged object—i.e., the first known acoustic hologram.citation needed] To settle an argument with Dr. Gabor, Lenat computer-generated a five-dimensional hologram, by photo-reducing computer printout of the interference pattern of a globe rotating and expanding over time, reducing the large two-dimensional paper printout to a moderately large 5-cm square film surface through which a conventional laser beam was then able to project a three-dimensional image, which changed in two independent ways (rotating and changing in size) as the film was moved up-down or left-right.citation needed]\nLenat was a Ph.D. student in Computer Science at Stanford University, where his published research included automatic program synthesis from input/output pairs and from natural language clarification dialogues.\n\n",
        "dblp_record": 64
    },
    {
        "letter": "L",
        "name": "Yann LeCun",
        "awards": 3,
        "education": "\nHe received a Diplôme d'Ingénieur from the ESIEE Paris in 1983 and a PhD in Computer Science from Université Pierre et Marie Curie (today Sorbonne University) in 1987 during which he proposed an early form of the back-propagation learning algorithm for neural networks.\n\n",
        "dblp_record": 343
    },
    {
        "letter": "L",
        "name": "Rasmus Lerdorf",
        "awards": 0,
        "education": "\nLerdorf was born on Disko Island in Greenland and moved to Denmark in his early years. Lerdorf's family moved to Canada from Denmark in 1980, and later moved to King City, Ontario in 1983. He graduated from King City Secondary School in 1988, and in 1993 he graduated from the University of Waterloo with a Bachelor of Applied Science in Systems Design Engineering. He contributed to the Apache HTTP Server and he added the LIMIT clause to the mSQL DBMS. A variant of this LIMIT clause had already been around for a decade in mainframe relational database management systems (like Oracle Rdb running on VMS, formerly from Digital Equipment Corporation), but apparently it had not yet been picked up by the emerging PC-based databases. It was later adapted by several other SQL-compatible DBMS. He released the first version of PHP in 1995.\n\n",
        "dblp_record": 5
    },
    {
        "letter": "L",
        "name": "Max Levchin",
        "awards": 0,
        "education": "\nBorn in Kyiv, Ukrainian SSR to a Ukrainian-Jewish family, Levchin moved to the United States and settled in Chicago in 1991. In an interview with Emily Chang of Bloomberg, Levchin discussed his overcoming adversity as a child. He had respiratory problems and doctors doubted his chance of living. With guidance from his grandmother and his parents he took up the clarinet to expand his lung capacity. He attended Mather High School, and then the University of Illinois at Urbana-Champaign, where he earned a bachelor's degree in computer science in 1997.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Leonid Levin",
        "awards": 1,
        "education": "Null",
        "dblp_record": 66
    },
    {
        "letter": "L",
        "name": "Kevin Leyton-Brown",
        "awards": 2,
        "education": "Null",
        "dblp_record": 195
    },
    {
        "letter": "L",
        "name": "J.C.R. Licklider",
        "awards": 0,
        "education": "Null",
        "dblp_record": 8
    },
    {
        "letter": "L",
        "name": "David Liddle",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Jochen Liedtke",
        "awards": 0,
        "education": "Null",
        "dblp_record": 37
    },
    {
        "letter": "L",
        "name": "John Lions",
        "awards": 0,
        "education": "Null",
        "dblp_record": 10
    },
    {
        "letter": "L",
        "name": "Charles H. Lindsey",
        "awards": 0,
        "education": "Null",
        "dblp_record": 5
    },
    {
        "letter": "L",
        "name": "Richard J. Lipton",
        "awards": 3,
        "education": "Null",
        "dblp_record": 229
    },
    {
        "letter": "L",
        "name": "Barbara Liskov",
        "awards": 3,
        "education": "\nLiskov was born November 7, 1939, in Los Angeles, California, to a Jewish family, the eldest of Jane (née Dickhoff) and Moses Huberman's four children. She earned her bachelor's degree in mathematics with a minor in physics at the University of California, Berkeley in 1961. At Berkeley, she had only one other female classmate in her major. She applied to graduate mathematics programs at Berkeley and Princeton. At the time Princeton was not accepting female students in mathematics. She was accepted at Berkeley but instead moved to Boston and began working at Mitre Corporation, where she became interested in computers and programming. She worked at Mitre for one year before taking a programming job at Harvard working on language translation.\nShe then decided to go back to school and applied again to Berkeley, but also to Stanford and Harvard. In March 1968 she became one of the first women in the United States to be awarded a Ph.D. from a computer science department when she was awarded her degree from Stanford University. At Stanford, she worked with John McCarthy and was supported to work in artificial intelligence. The topic of her Ph.D. thesis was a computer program to play chess endgames for which she developed the important killer heuristic.\n\n",
        "dblp_record": 163
    },
    {
        "letter": "L",
        "name": "Yanhong Annie Liu",
        "awards": 0,
        "education": "\nLiu studied computer science at Peking University earning a Bachelor of Science (B.Sc.). She moved to Tsinghua University for her graduate studies, earning a Master of Science (M.Sc.) in engineering in 1988. Liu was a graduate student at Cornell University, where she earned a Doctor of Philosophy (Ph.D.) in 1996.\n\n",
        "dblp_record": 117
    },
    {
        "letter": "L",
        "name": "Darrell Long",
        "awards": 5,
        "education": "Null",
        "dblp_record": 188
    },
    {
        "letter": "L",
        "name": "Patricia D. Lopez",
        "awards": 7,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Gillian Lovegrove",
        "awards": 0,
        "education": "\nGillian Lesley Lowther, now Gillian Lovegrove, was born in Yorkshire on 28 October 1942 and grew up in the Hull area. She went to Malet Lambert School and then to Newnham College, Cambridge to study mathematics. After her first degree in 1964, she did a Masters-equivalent Diploma at Cambridge University in Numerical Analysis and Automatic Computing.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Ada Lovelace",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "David Luckham",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "L",
        "name": "Eugene Luks",
        "awards": 0,
        "education": "Null",
        "dblp_record": 40
    },
    {
        "letter": "L",
        "name": "Nancy Lynch",
        "awards": 9,
        "education": "Null",
        "dblp_record": 386
    },
    {
        "letter": "M",
        "name": "Nadia Magnenat Thalmann",
        "awards": 2,
        "education": "Null",
        "dblp_record": 734
    },
    {
        "letter": "M",
        "name": "Tom Maibaum",
        "awards": 6,
        "education": "Null",
        "dblp_record": 200
    },
    {
        "letter": "M",
        "name": "Simon Marlow",
        "awards": 0,
        "education": "Null",
        "dblp_record": 45
    },
    {
        "letter": "M",
        "name": "Zohar Manna",
        "awards": 3,
        "education": "Null",
        "dblp_record": 190
    },
    {
        "letter": "M",
        "name": "James Martin",
        "awards": 29,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Robert C. Martin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "John Mashey",
        "awards": 0,
        "education": "Null",
        "dblp_record": 18
    },
    {
        "letter": "M",
        "name": "Yuri Matiyasevich",
        "awards": 7,
        "education": "Null",
        "dblp_record": 46
    },
    {
        "letter": "M",
        "name": "Yukihiro Matsumoto",
        "awards": 0,
        "education": "Null",
        "dblp_record": 5
    },
    {
        "letter": "M",
        "name": "John Mauchly",
        "awards": 2,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "M",
        "name": "Ujjwal Maulik",
        "awards": 0,
        "education": "\nHe did his schooling from Nabadwip Bakultala High School, Nabadwip, Nadia and Ramakrishna Mission Vivekananda Centenary College, Rahara, 24 Parganas (North) both in West Bengal.  Subsequently, he completed B.Sc. in Physics and B. Tech. in Computer Science from University of Calcutta, Kolkata, West Bengal, India in 1986 and 1989.  He also received his M. Tech. in Computer Science and Ph.D. in Engineering in 1992 and 1997 at Jadavpur University, Kolkata, West Bengal, India. He did post-doctoral research at the University of New South Wales, Australia in 1999 and the University of Texas, Arlington, U.S. in 2001.\n\n",
        "dblp_record": 212
    },
    {
        "letter": "M",
        "name": "Derek McAuley",
        "awards": 1,
        "education": "Null",
        "dblp_record": 83
    },
    {
        "letter": "M",
        "name": "John McCarthy",
        "awards": 7,
        "education": "\nJohn McCarthy was born in Boston, Massachusetts, on September 4, 1927, to an Irish immigrant father and a Lithuanian Jewish immigrant mother, John Patrick and Ida (Glatt) McCarthy. The family was obliged to relocate frequently during the Great Depression, until McCarthy's father found work as an organizer for the Amalgamated Clothing Workers in Los Angeles, California. His father came from Cromane, a small fishing village in County Kerry, Ireland. His mother died in 1957.\nBoth parents were active members of the Communist Party during the 1930s, and they encouraged learning and critical thinking. Before he attended high school, he got interested in science by reading a translation of a Russian popular science book for children, called 100,000 Whys.  John was fluent in the Russian language and made friends with Russian scientists during multiple trips to the Soviet Union but he distanced himself after making visits to the Soviet Bloc, which led to him becoming a conservative Republican.\nMcCarthy graduated from Belmont High School two years early. McCarthy was accepted into Caltech in 1944.\nMcCarthy showed an early aptitude for mathematics; during his teens he taught himself college mathematics by studying the textbooks used at the nearby California Institute of Technology (Caltech). As a result, he was able to skip the first two years of mathematics at Caltech.\nMcCarthy was suspended from Caltech for failure to attend physical education courses. He then served in the US Army and was readmitted, receiving a BS in mathematics in 1948.\nIt was at Caltech that he attended a lecture by John von Neumann that inspired his future endeavors.\nMcCarthy initially completed graduate studies at Caltech before moving to Princeton University. He received a PhD in mathematics from Princeton in 1951 after completing a doctoral dissertation, titled \"Projection operators and partial differential equations\", under the supervision of Donald C. Spencer.\n\n",
        "dblp_record": 79
    },
    {
        "letter": "M",
        "name": "Andrew McCallum",
        "awards": 2,
        "education": "Null",
        "dblp_record": 412
    },
    {
        "letter": "M",
        "name": "Douglas McIlroy",
        "awards": 0,
        "education": "Null",
        "dblp_record": 25
    },
    {
        "letter": "M",
        "name": "Chris McKinstry",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Marshall Kirk McKusick",
        "awards": 0,
        "education": "Null",
        "dblp_record": 40
    },
    {
        "letter": "M",
        "name": "Lambert Meertens",
        "awards": 2,
        "education": "Null",
        "dblp_record": 26
    },
    {
        "letter": "M",
        "name": "Kurt Mehlhorn",
        "awards": 4,
        "education": "Null",
        "dblp_record": 449
    },
    {
        "letter": "M",
        "name": "Dora Metcalf",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Bertrand Meyer",
        "awards": 3,
        "education": "Null",
        "dblp_record": 355
    },
    {
        "letter": "M",
        "name": "Silvio Micali",
        "awards": 3,
        "education": "Null",
        "dblp_record": 168
    },
    {
        "letter": "M",
        "name": "Robin Milner",
        "awards": 5,
        "education": "Null",
        "dblp_record": 107
    },
    {
        "letter": "M",
        "name": "Jack Minker",
        "awards": 1,
        "education": "Null",
        "dblp_record": 153
    },
    {
        "letter": "M",
        "name": "Marvin Minsky",
        "awards": 6,
        "education": "Null",
        "dblp_record": 33
    },
    {
        "letter": "M",
        "name": "James G. Mitchell",
        "awards": 9,
        "education": "Null",
        "dblp_record": 19
    },
    {
        "letter": "M",
        "name": "Tom M. Mitchell",
        "awards": 4,
        "education": "\nMitchell was born in Blossburg, Pennsylvania and grew up in Upstate New York, in the town of Vestal. He received his bachelor of Science degree in Electrical Engineering from the Massachusetts Institute of Technology in 1973 and a Ph.D. from Stanford University under the direction of Bruce G. Buchanan in 1979.\n\n",
        "dblp_record": 251
    },
    {
        "letter": "M",
        "name": "Arvind Mithal",
        "awards": 0,
        "education": "Null",
        "dblp_record": 157
    },
    {
        "letter": "M",
        "name": "Paul Mockapetris",
        "awards": 4,
        "education": "\nMockapetris graduated from the Boston Latin School in 1966, received his bachelor's degrees in physics and electrical engineering from the Massachusetts Institute of Technology in 1971 and his doctorate in information and computer science from the University of California at Irvine in 1982.\n\n",
        "dblp_record": 13
    },
    {
        "letter": "M",
        "name": "Cleve Moler",
        "awards": 2,
        "education": "Null",
        "dblp_record": 20
    },
    {
        "letter": "M",
        "name": "Faron Moller",
        "awards": 0,
        "education": "Null",
        "dblp_record": 77
    },
    {
        "letter": "M",
        "name": "John P. Moon",
        "awards": 0,
        "education": "\nMoon's best subjects in school were Mathematics, Science and English.  After he graduated high school with honors, he enrolled at Pennsylvania State University where he received a degree in mechanical engineering in 1960. After graduating from there he decided to further pursue his education and get his masters from New York University (NYU) where he continued his studies in engineering.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Charles H. Moore",
        "awards": 0,
        "education": "Null",
        "dblp_record": 5
    },
    {
        "letter": "M",
        "name": "Edward F. Moore",
        "awards": 0,
        "education": "Null",
        "dblp_record": 4
    },
    {
        "letter": "M",
        "name": "Gordon Moore",
        "awards": 9,
        "education": "\nGordon Moore was born in 1929 as the second son of Walter Harold Moore (a county sheriff stationed in San Mateo County) and Florence Almira \"Mira\" Williamson (a homemaker). When Moore started school in 1935, the faculty noted his introverted personality. His father accepted a promotion to deputy sheriff in 1938 and moved the family to Redwood City, California. In 1940, Moore received a chemistry set as a Christmas gift, which inspired him to become a chemist. From 1942 to 1946, Moore studied at Sequoia High School, where he was involved in athletic activities. From 1946 to 1947, Moore attended San José State College (now San José State University), studying chemistry. He transferred to University of California, Berkeley in 1948, taking courses from Glenn Seaborg, Melvin Calvin, and William Giauque. He graduated in 1950 with a Bachelor of Science degree in chemistry.\nIn September 1950, Moore enrolled at the California Institute of Technology (\"Caltech\"), where he would ultimately receive a Ph.D. in chemistry in 1954. Moore conducted postdoctoral research at the Applied Physics Laboratory at Johns Hopkins University from 1953 to 1956.\n\n",
        "dblp_record": 5
    },
    {
        "letter": "M",
        "name": "J Strother Moore",
        "awards": 0,
        "education": "Null",
        "dblp_record": 86
    },
    {
        "letter": "M",
        "name": "Roger Moore",
        "awards": 4,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Hans Moravec",
        "awards": 0,
        "education": "Null",
        "dblp_record": 18
    },
    {
        "letter": "M",
        "name": "Carroll Morgan",
        "awards": 0,
        "education": "Null",
        "dblp_record": 121
    },
    {
        "letter": "M",
        "name": "Robert Tappan Morris",
        "awards": 0,
        "education": "Null",
        "dblp_record": 106
    },
    {
        "letter": "M",
        "name": "Joel Moses",
        "awards": 0,
        "education": "Null",
        "dblp_record": 23
    },
    {
        "letter": "M",
        "name": "Rajeev Motwani",
        "awards": 5,
        "education": "\nRajeev Motwani was born in Jammu,  Jammu and Kashmir, India on 24 March 1962, and grew up in New Delhi. His father was in the Indian Army. He had two brothers. As a child, inspired by luminaries like Gauss, he wanted to become a mathematician.\nMotwani went to St Columba's School, New Delhi. He completed his B.Tech. in Computer Science from the Indian Institute of Technology Kanpur in Kanpur, Uttar Pradesh in 1983 and got his Ph.D. in Computer Science from the University of California, Berkeley in Berkeley, California, United States in 1988, under the supervision of Richard M. Karp.\n\n",
        "dblp_record": 210
    },
    {
        "letter": "M",
        "name": "Oleg A. Mukhanov",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "M",
        "name": "Stephen Muggleton",
        "awards": 4,
        "education": "\nMuggleton received his Bachelor of Science degree in computer science (1982) and Doctor of Philosophy in artificial intelligence (1986) supervised by Donald Michie at the University of Edinburgh.\n\n",
        "dblp_record": 208
    },
    {
        "letter": "M",
        "name": "Klaus-Robert Müller",
        "awards": 1,
        "education": "Null",
        "dblp_record": 524
    },
    {
        "letter": "M",
        "name": "Alan Mycroft",
        "awards": 0,
        "education": "\nMycroft read mathematics at Cambridge then moved to Edinburgh where he completed his Doctor of Philosophy degree with a thesis on Abstract interpretation and optimising transformations for applicative programs supervised by Rod Burstall and Robin Milner.\n\n",
        "dblp_record": 122
    },
    {
        "letter": "M",
        "name": "Brad A. Myers",
        "awards": 4,
        "education": "\nMyers received his BS degree in Computer Science and MS degree in Computer Science and Engineering under MIT in 1980, whilst simultaneously interning at Xerox Parc for his Master's thesis. He then received his PhD in Computer Science from the University of Toronto in 1987.\n\n",
        "dblp_record": 363
    },
    {
        "letter": "N",
        "name": "Mihai Nadin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "N",
        "name": "Makoto Nagao",
        "awards": 10,
        "education": "Null",
        "dblp_record": 82
    },
    {
        "letter": "N",
        "name": "Frieder Nake",
        "awards": 9,
        "education": "Null",
        "dblp_record": 29
    },
    {
        "letter": "N",
        "name": "Bonnie Nardi",
        "awards": 0,
        "education": "Null",
        "dblp_record": 181
    },
    {
        "letter": "N",
        "name": "Peter Naur",
        "awards": 15,
        "education": "Null",
        "dblp_record": 38
    },
    {
        "letter": "N",
        "name": "Roger Needham",
        "awards": 4,
        "education": "\nNeedham was born in Birmingham, England, the only child of Phyllis Mary, née Baker (c.1904–1976) and Leonard William Needham (c.1905–1973), a university chemistry lecturer. He attended Doncaster Grammar School for Boys in Doncaster (then in the West Riding) going on to St John's College, Cambridge in 1953, and graduating with a BA in 1956 in mathematics and philosophy. His PhD thesis was on applications of digital computers to the automatic classification and retrieval of documents. He worked on a variety of key computing projects in security, operating systems, computer architecture (capability systems) and local area networks.\n\n",
        "dblp_record": 82
    },
    {
        "letter": "N",
        "name": "James G. Nell",
        "awards": 0,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "N",
        "name": "Greg Nelson",
        "awards": 2,
        "education": "Null",
        "dblp_record": 29
    },
    {
        "letter": "N",
        "name": "Bernard de Neumann",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "N",
        "name": "Klara Dan von Neumann",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "N",
        "name": "John von Neumann",
        "awards": 6,
        "education": "\nFamily backgroundedit]\nVon Neumann was born in Budapest, Kingdom of Hungary (which was then part of the Austro-Hungarian Empire), on December 28, 1903, to a wealthy, acculturated, and non-observant Jewish family. His Hungarian birth name was Neumann János Lajos. In Hungarian, the family name comes first, and his given names are equivalent to John Louis in English.\nHe was the eldest of three brothers; his two younger siblings were Mihály (English: Michael von Neumann; 1907–1989) and Miklós (Nicholas von Neumann, 1911–2011). His father, Neumann Miksa (Max von Neumann, 1873–1928) was a banker, who held a doctorate in law. He had moved to Budapest from Pécs at the end of the 1880s. Miksa's father and grandfather were both born in Ond (now part of the town of Szerencs), Zemplén County, northern Hungary. John's mother was Kann Margit (English: Margaret Kann); her parents were Jakab Kann and Katalin Meisels of the Meisels family. Three generations of the Kann family lived in spacious apartments above the Kann-Heller offices in Budapest; von Neumann's family occupied an 18-room apartment on the top floor.\nOn February 20, 1913, Emperor Franz Joseph elevated John's father to the Hungarian nobility for his service to the Austro-Hungarian Empire. The Neumann family thus acquired the hereditary appellation Margittai, meaning \"of Margitta\" (today Marghita, Romania). The family had no connection with the town; the appellation was chosen in reference to Margaret, as was their chosen coat of arms depicting three marguerites. Neumann János became margittai Neumann János (John Neumann de Margitta), which he later changed to the German Johann von Neumann.\n\nChild prodigyedit]\nVon Neumann was a child prodigy who at six years old could divide two eight-digit numbers in his head and could converse in Ancient Greek. When the six-year-old von Neumann caught his mother staring aimlessly, he asked her, \"What are you calculating?\"\nWhen they were young, von Neumann, his brothers and his cousins were instructed by governesses. Von Neumann's father believed that knowledge of languages other than their native Hungarian was essential, so the children were tutored in English, French, German and Italian. By the age of eight, von Neumann was familiar with differential and integral calculus, and by twelve he had read and understood Borel's Théorie des Fonctions. He was also interested in history, reading his way through Wilhelm Oncken's 46-volume world history series Allgemeine Geschichte in Einzeldarstellungen (General History in Monographs). One of the rooms in the apartment was converted into a library and reading room, with bookshelves from ceiling to floor.\nVon Neumann entered the Lutheran Fasori Evangélikus Gimnázium in 1914. Eugene Wigner was a year ahead of von Neumann at the Lutheran School and soon became his friend.\nAlthough von Neumann's father insisted that he attend school at the grade level appropriate to his age, he agreed to hire private tutors to give von Neumann advanced instruction. At the age of 15, he began to study advanced calculus under the renowned analyst Gábor Szegő. By the age of 19, von Neumann had published two major mathematical papers, the second of which gave the modern definition of ordinal numbers, which superseded Georg Cantor's definition. At the conclusion of his education at the gymnasium, he applied for and won the Eötvös Prize, a national award for mathematics.\n\nUniversity studiesedit]\nAccording to his friend Theodore von Kármán, von Neumann's father wanted John to follow him into industry, and asked von Kármán to persuade his son not to take mathematics as his major. Von Neumann and his father decided that the best career path was chemical engineering. This was not something that von Neumann had much knowledge of, so it was arranged for him to take a two-year, non-degree course in chemistry at the University of Berlin, after which he sat for the entrance exam to  ETH Zurich, which he passed in September 1923. Simultaneously von Neumann also entered Pázmány Péter University in Budapest, as a Ph.D. candidate in mathematics. For his thesis, he produced an axiomatization of Cantor's set theory. He graduated as a chemical engineer from ETH Zurich in 1926, and passed his final examinations summa cum laude for his Ph.D. in mathematics (with minors in experimental physics and chemistry) simultaneous with his chemical engineering degree.  He then went to the University of Göttingen on a grant from the Rockefeller Foundation to study mathematics under David Hilbert. Hermann Weyl, in his obituary of Emmy Noether, remembers how in the winter of 1926-1927 von Neumann, Noether, and he would take walks after his classes through \"the cold, wet, rain-wet streets of Göttingen\" discussing hypercomplex number systems and their representations.\n\n",
        "dblp_record": 10
    },
    {
        "letter": "N",
        "name": "Allen Newell",
        "awards": 20,
        "education": "Null",
        "dblp_record": 76
    },
    {
        "letter": "N",
        "name": "Max Newman",
        "awards": 5,
        "education": "\nNewman was born Maxwell Herman Alexander Neumann in Chelsea, London, England, to a Jewish family, on 7 February 1897. His father was Herman Alexander Neumann, originally from the German city of Bromberg (now in Poland), who had emigrated with his family to London at the age of 15. Herman worked as a secretary in a company, and married Sarah Ann Pike, an Irish schoolteacher, in 1896.\nThe family moved to Dulwich in 1903, and Newman attended Goodrich Road school, then City of London School from 1908. At school, he excelled in classics and in mathematics. He played chess and the piano well.\nNewman won a scholarship to study mathematics at St John's College, Cambridge in 1915, and in 1916 gained a First in Part I of the Cambridge Mathematical Tripos.\n\n",
        "dblp_record": 1
    },
    {
        "letter": "N",
        "name": "Andrew Ng",
        "awards": 9,
        "education": "Null",
        "dblp_record": 293
    },
    {
        "letter": "N",
        "name": "Nils John Nilsson",
        "awards": 0,
        "education": "\nNilsson was born in Saginaw, Michigan, in 1933. He received his Ph.D. from Stanford in 1958, and spent much of his career at SRI International, a private research lab spun off from Stanford.\nNilsson served as a lieutenant in the U.S. Air Force from 1958 to 1961; he was stationed at the Rome Air Development Center in Rome, New York.\n\n",
        "dblp_record": 45
    },
    {
        "letter": "N",
        "name": "G.M. Nijssen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 36
    },
    {
        "letter": "N",
        "name": "Tobias Nipkow",
        "awards": 0,
        "education": "Null",
        "dblp_record": 219
    },
    {
        "letter": "N",
        "name": "Maurice Nivat",
        "awards": 7,
        "education": "\nNivat was born in Clermont-Ferrand, France. His parents were high-school teachers; his father taught languages while his mother taught mathematics. His sister, Aline, became a notable mathematician.\nIn 1954, Nivat moved with his family to Paris. Nivat was admitted to the École Normale Supérieure in 1956, but began working at the Blaise Pascal Institute of the French National Centre for Scientific Research, a newly established computing laboratory, in 1959. He returned to study mathematics in 1961 under the supervision of Marcel-Paul Schützenberger. His 1967 thesis was entitled Transductions des langages de Chomsky (\"Transductions of Chomsky Languages\").\n\n",
        "dblp_record": 110
    },
    {
        "letter": "N",
        "name": "Phiwa Nkambule",
        "awards": 3,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "N",
        "name": "Jerre Noe",
        "awards": 0,
        "education": "\nNoe was born in McCloud, California. He received a Bachelor's degree in electrical engineering from the University of California, Berkeley. Stationed in Europe during World War II, he conducted research and development related to radar, before returning to California to complete a Ph.D. in electrical engineering at Stanford University.\n\n",
        "dblp_record": 16
    },
    {
        "letter": "N",
        "name": "Peter Nordin",
        "awards": 0,
        "education": "Null",
        "dblp_record": 44
    },
    {
        "letter": "N",
        "name": "Donald Norman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 82
    },
    {
        "letter": "N",
        "name": "Peter Norvig",
        "awards": 2,
        "education": "\nNorvig received a Bachelor of Science in applied mathematics from Brown University and a Ph.D. in computer science from the University of California, Berkeley.\n\n",
        "dblp_record": 41
    },
    {
        "letter": "N",
        "name": "George Novacky",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "N",
        "name": "Kristen Nygaard",
        "awards": 1,
        "education": "Null",
        "dblp_record": 21
    },
    {
        "letter": "O",
        "name": "Martin Odersky",
        "awards": 0,
        "education": "Null",
        "dblp_record": 140
    },
    {
        "letter": "O",
        "name": "Peter O'Hearn",
        "awards": 9,
        "education": "\nO'Hearn attained a BSc degree in computer science from Dalhousie University, Halifax, Nova Scotia (1985), followed by MSc (1987) and PhD (1991) degrees from Queen's University, Kingston, Ontario, Canada. His dissertation was on Semantics of Non-interference: A natural approach, supervised by Robert D. Tennent.\n\n",
        "dblp_record": 108
    },
    {
        "letter": "O",
        "name": "T. William Olle",
        "awards": 0,
        "education": "Null",
        "dblp_record": 35
    },
    {
        "letter": "O",
        "name": "Steve Omohundro",
        "awards": 0,
        "education": "\nOmohundro has degrees in physics and mathematics from Stanford University (Phi Beta Kappa) and a Ph.D. in physics from the University of California, Berkeley.\n\n",
        "dblp_record": 5
    },
    {
        "letter": "O",
        "name": "Severo Ornstein",
        "awards": 0,
        "education": "Null",
        "dblp_record": 11
    },
    {
        "letter": "O",
        "name": "John O'Sullivan",
        "awards": 4,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "O",
        "name": "John Ousterhout",
        "awards": 2,
        "education": "Null",
        "dblp_record": 83
    },
    {
        "letter": "O",
        "name": "Mark Overmars",
        "awards": 0,
        "education": "Null",
        "dblp_record": 242
    },
    {
        "letter": "O",
        "name": "Susan Owicki",
        "awards": 0,
        "education": "Null",
        "dblp_record": 36
    },
    {
        "letter": "P",
        "name": "Larry Page",
        "awards": 0,
        "education": "\nPage attended Okemos Montessori School (now called Montessori Radmoor) in Okemos, Michigan, from ages 2 to 7 (1975 to 1979). He attended East Lansing High School, graduating in 1991. In summer school, he attended Interlochen Center for the Arts at Interlochen, Michigan, playing flute but mainly saxophone for two summers.\nPage received a Bachelor of Science in a major in computer engineering with honors from the University of Michigan in 1995 and a Master of Science in computer science from Stanford University in 1998.\nWhile at the University of Michigan, Page created an inkjet printer made of Lego bricks (literally a line plotter), after he thought it possible to print large posters cheaply with the use of inkjet cartridges—Page reverse-engineered the ink cartridge and built the electronics and mechanics to drive it. Page served as the president of the Beta Epsilon chapter of the Eta Kappa Nu honor society, and was a member of the 1993 \"Maize &amp; Blue\" University of Michigan Solar Car team. As an undergraduate at the University of Michigan, he proposed that the school replace its bus system with a personal rapid-transit system, which is essentially a driverless monorail with separate cars for every passenger. He also developed a business plan for a company that would use software to build a music synthesizer during this time.\n\n",
        "dblp_record": 5
    },
    {
        "letter": "P",
        "name": "Sankar Pal",
        "awards": 5,
        "education": "Null",
        "dblp_record": 327
    },
    {
        "letter": "P",
        "name": "Paritosh Pandya",
        "awards": 6,
        "education": "Null",
        "dblp_record": 82
    },
    {
        "letter": "P",
        "name": "Christos Papadimitriou",
        "awards": 5,
        "education": "\nPapadimitriou studied at the National Technical University of Athens, where in 1972 he received his Bachelor of Arts degree in electrical engineering. He then pursued graduate studies at Princeton University, where he received his Ph.D. in electrical engineering and computer science in 1976 after completing a doctoral dissertation titled \"The complexity of combinatorial optimization problems.\"\n\n",
        "dblp_record": 494
    },
    {
        "letter": "P",
        "name": "David Park",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "David Parnas",
        "awards": 0,
        "education": "Null",
        "dblp_record": 179
    },
    {
        "letter": "P",
        "name": "DJ Patil",
        "awards": 0,
        "education": "\nPatil attended Kennedy Middle School, Monta Vista High School and De Anza College, all in Cupertino, California. While at Kennedy, he participated in a student exchange program, visiting Toyokawa, Cupertino's sister city in Japan, in 1988. In high school, he often got into trouble and graduated in 1992 near the bottom of his class. He followed his girlfriend to De Anza Community College, which he attended for one year. He earned a B.A. in mathematics from Earl Warren College at University of California, San Diego. He received a PhD in applied mathematics from the University of Maryland College of Computer, Mathematical, and Natural Sciences. While a faculty member at University of Maryland College Park, he used open datasets published by NOAA to improve numerical weather forecasting.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "Yale Patt",
        "awards": 6,
        "education": "Null",
        "dblp_record": 211
    },
    {
        "letter": "P",
        "name": "David Patterson",
        "awards": 6,
        "education": "\nDavid Patterson grew up in Evergreen Park, Illinois. He graduated from South High School in Torrance, California. He then attended the University of California, Los Angeles (UCLA), receiving his Bachelor of Arts degree in Mathematics in 1969. He continued on to obtain his Master of Science degree in 1970 and PhD in 1976, both in Computer Science at UCLA. Patterson's PhD was advised by David F. Martin and Gerald Estrin.\n\n",
        "dblp_record": 271
    },
    {
        "letter": "P",
        "name": "Mike Paterson",
        "awards": 10,
        "education": "Null",
        "dblp_record": 150
    },
    {
        "letter": "P",
        "name": "Mihai Pătraşcu",
        "awards": 0,
        "education": "Null",
        "dblp_record": 84
    },
    {
        "letter": "P",
        "name": "Lawrence Paulson",
        "awards": 1,
        "education": "\nPaulson graduated from the California Institute of Technology in 1977, and obtained his PhD in Computer Science from Stanford University in 1981 for research on programming languages and compiler-compilers supervised by John L. Hennessy.\n\n",
        "dblp_record": 221
    },
    {
        "letter": "P",
        "name": "Randy Pausch",
        "awards": 1,
        "education": "Null",
        "dblp_record": 81
    },
    {
        "letter": "P",
        "name": "Juan Pavón",
        "awards": 0,
        "education": "Null",
        "dblp_record": 148
    },
    {
        "letter": "P",
        "name": "Judea Pearl",
        "awards": 4,
        "education": "Null",
        "dblp_record": 309
    },
    {
        "letter": "P",
        "name": "Alan Perlis",
        "awards": 2,
        "education": "Null",
        "dblp_record": 51
    },
    {
        "letter": "P",
        "name": "Radia Perlman",
        "awards": 11,
        "education": "\nAs an undergraduate at MIT Perlman learned programming for a physics class. She was given her first paid job in 1971 as part-time programmer for the LOGO Lab at the (then) MIT Artificial Intelligence Laboratory, programming system software such as debuggers. \nWorking under the supervision of Seymour Papert, she developed a child-friendly version of the educational robotics language LOGO, called TORTIS (\"Toddler's Own Recursive Turtle Interpreter System\"). During research performed in 1974–76, young children—the youngest aged 3½ years, programmed a LOGO educational robot called a Turtle. Perlman has been described as a pioneer of teaching young children computer programming. Afterwards, she was inspired to make a new programming language that would teach much younger children similar to Logo, but using special \"keyboards\" and input devices. This project was abandoned because \"being the only woman around, I wanted to be taken seriously as a 'scientist' and was a little embarrassed that my project involved cute little kids\". MIT media project later tracked her down and told her that she started a new field called tangible user interface from the leftovers of her abandoned project.  As a math grad at MIT she needed to find an adviser for her thesis, and joined the MIT group at BBN Technologies. There she first got involved with designing network protocols. Perlman obtained a B.S. and M.S. in Mathematics and a Ph.D. in Computer Science from MIT in 1988.  Her doctoral thesis on routing in environments where malicious network failures are present serves as the basis for much of the work that now exists in this area. \nWhen studying at MIT in the late 60s she was one among the 50 or so women students, in a class of about 1,000 students. To begin with MIT only had one women’s dorm, limiting the number of women students that could study. When the men’s dorms at MIT became coed Perlman moved out of the women’s dorm into a mixed dorm, where she became the \"resident female\". She later said that she was so used to the gender imbalance, that it became normal. Only when she saw other women students among a crowd of men she noticed that \"it kind of looked weird\".\n\n",
        "dblp_record": 67
    },
    {
        "letter": "P",
        "name": "Pier Giorgio Perotto",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "P",
        "name": "Rózsa Péter",
        "awards": 0,
        "education": "\nPéter was born in Budapest, Hungary, as Rózsa Politzer (Hungarian: Politzer Rózsa). She attended Pázmány Péter University (now Eötvös Loránd University), originally studying chemistry but later switching to mathematics. She attended lectures by Lipót Fejér and József Kürschák. While at university, she met László Kalmár; they would collaborate in future years and Kalmár encouraged her to pursue her love of mathematics.\nAfter graduating in 1927, Péter could not find a permanent teaching position although she had passed her exams to qualify as a mathematics teacher. Due to the effects of the Great Depression, many university graduates could not find work and Péter began private tutoring. At this time, she also began her graduate studies.\n\n",
        "dblp_record": 4
    },
    {
        "letter": "P",
        "name": "Simon Peyton Jones",
        "awards": 2,
        "education": "\nPeyton Jones graduated from the University of Cambridge with a Bachelor of Science degree in Electrical Sciences in 1979. During this time he was an undergraduate student of Trinity College, Cambridge, and subsequently went on to complete the Cambridge Diploma in Computer Science in 1980. He never did a PhD.\n\n",
        "dblp_record": 251
    },
    {
        "letter": "P",
        "name": "Kathy Pham",
        "awards": 0,
        "education": "\nPham’s parents were Vietnamese boat people, who spent several years in refugee camps before immigrating to the United States. Her brother, United States Marine Corps Major David Pham, was presented the Purple Heart medal during combat operations in Afghanistan.\nPham attended Windsor Forest High School in Savannah, Georgia where she was a member of the volleyball team and graduated as Salutatorian of her graduating class.\nPham earned a Bachelor of Science in Computer Science from the Georgia Institute of Technology. She also holds a Master of Science in Computer Science from both the Georgia Institute of Technology and Supélec, specializing in cryptography and human computer interaction. While in university, Pham was the chair of Georgia Tech's Women in Computing, director of technology at Phi Mu fraternity, researcher in the Bio-Medical Informatics and Bio-Imaging Lab, and founded the southeast chapter of United for Sight.\n\n",
        "dblp_record": 1
    },
    {
        "letter": "P",
        "name": "Roberto Pieraccini",
        "awards": 2,
        "education": "\nHe obtained a degree in electrical engineering from the University of Pisa in 1980 with a thesis on the equalization of data channels.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "Keshav Pingali",
        "awards": 3,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "Gordon Plotkin",
        "awards": 3,
        "education": "\nPlotkin was educated at the University of Glasgow and the University of Edinburgh, gaining his Bachelor of Science degree in 1967 and PhD in 1972 supervised by Rod Burstall.\n\n",
        "dblp_record": 158
    },
    {
        "letter": "P",
        "name": "Amir Pnueli",
        "awards": 6,
        "education": "Null",
        "dblp_record": 277
    },
    {
        "letter": "P",
        "name": "Willem van der Poel",
        "awards": 3,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "Cicely Popplewell",
        "awards": 0,
        "education": "\nPopplewell was born on 29 October 1920 in Bramhall, Stockport, England. Her parents were Bessie (née Fazakerley) and Alfred Popplewell, a chartered accountant. She attended Sherbrook Private Girls School at Greaves Hall in Lancashire.\nShe studied the Mathematical Tripos at the University of Cambridge where she worked with statistics in the form of punched cards. She was considered an expert in the Brunsviga desk calculator.\nShe graduated with a Bachelor of Arts degree in 1942, which was converted to a Master of Arts degree in 1949 from Girton College, Cambridge.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "P",
        "name": "Emil Post",
        "awards": 0,
        "education": "Null",
        "dblp_record": 3
    },
    {
        "letter": "P",
        "name": "Jon Postel",
        "awards": 4,
        "education": "Null",
        "dblp_record": 230
    },
    {
        "letter": "P",
        "name": "Franco Preparata",
        "awards": 1,
        "education": "Null",
        "dblp_record": 199
    },
    {
        "letter": "P",
        "name": "William H. Press",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Rapelang Rabana",
        "awards": 0,
        "education": "\nRapelang was born in Gaborone, Botswana. She started her schooling in Gaborone before moving to Johannesburg and attended Roedean School. Rapelang graduated with honours from the University of Cape Town in 2005 with a bachelor's degree in Business Science with a specialty in Computer Science. Rapelang returned to the University of Cape Town to give a commencement speech in 2019.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Grzegorz Rozenberg",
        "awards": 0,
        "education": "Null",
        "dblp_record": 615
    },
    {
        "letter": "R",
        "name": "Michael O. Rabin",
        "awards": 10,
        "education": "Null",
        "dblp_record": 67
    },
    {
        "letter": "R",
        "name": "Dragomir R. Radev",
        "awards": 2,
        "education": "Null",
        "dblp_record": 310
    },
    {
        "letter": "R",
        "name": "T. V. Raman",
        "awards": 13,
        "education": "\nHe grew up in Pune, India. Raman became blind at the age of 14 due to glaucoma, being previously partially sighted and able to see with his left eye.  To deal with his blindness he had his brother, his mentors, and his aide read out textbooks and problems to him.  Although unable to see, he was able to solve Rubik's Cube with a braille version, write computer programs, and perform mathematics.\nRaman attended the University of Pune with a BS in mathematics, IIT Bombay with an MS in mathematics, and Cornell University earning an MS in computer science and a PhD in applied mathematics under advisor David Gries. His PhD thesis titled \"Audio System For Technical Readings (AsTeR)\" was awarded the ACM Doctoral Dissertation Award in 1994.\n\n",
        "dblp_record": 29
    },
    {
        "letter": "R",
        "name": "Brian Randell",
        "awards": 0,
        "education": "Null",
        "dblp_record": 111
    },
    {
        "letter": "R",
        "name": "Anders P. Ravn",
        "awards": 4,
        "education": "Null",
        "dblp_record": 91
    },
    {
        "letter": "R",
        "name": "Raj Reddy",
        "awards": 6,
        "education": "\nRaj Reddy was born in a Telugu family in Katur village of Chittoor district of present-day Andhra Pradesh, India. His father, Sreenivasulu Reddy, was a farmer, and his mother, Pitchamma, was a homemaker. He was the first member of his family to attend college.\nHe received his bachelor's degree in civil engineering from College of Engineering, Guindy, then affiliated to the University of Madras (now to Anna University, Chennai), India, in 1958, and a MEng degree from the University of New South Wales, Australia, in 1960. He received his PhD degree in Computer Science from Stanford University in 1966.\n\n",
        "dblp_record": 60
    },
    {
        "letter": "R",
        "name": "David P. Reed",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Trygve Reenskaug",
        "awards": 0,
        "education": "Null",
        "dblp_record": 18
    },
    {
        "letter": "R",
        "name": "John C. Reynolds",
        "awards": 2,
        "education": "Null",
        "dblp_record": 47
    },
    {
        "letter": "R",
        "name": "Joyce K. Reynolds",
        "awards": 0,
        "education": "Null",
        "dblp_record": 68
    },
    {
        "letter": "R",
        "name": "Reinder van de Riet",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Bernard Richards",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Martin Richards",
        "awards": 2,
        "education": "\nRichards studied mathematics as an undergraduate student at the University of Cambridge and took the Cambridge Diploma in Computer Science. His PhD was on programming language design and implementation. He was a senior lecturer at the University of Cambridge Computer Laboratory until his retirement in 2007.\n\n",
        "dblp_record": 11
    },
    {
        "letter": "R",
        "name": "Adam Riese",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "C. J. van Rijsbergen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 139
    },
    {
        "letter": "R",
        "name": "Dennis Ritchie",
        "awards": 5,
        "education": "Null",
        "dblp_record": 16
    },
    {
        "letter": "R",
        "name": "Ron Rivest",
        "awards": 5,
        "education": "\nRivest earned a Bachelor's degree in Mathematics from Yale University in 1969, and a Ph.D. degree in Computer Science from Stanford University in 1974 for research supervised by Robert W. Floyd.\n\n",
        "dblp_record": 234
    },
    {
        "letter": "R",
        "name": "Ken Robinson",
        "awards": 4,
        "education": "\nKen Robinson was born in 1938. He received his BE degree in electrical engineering in 1959 and a BSc degree in physics and mathematics in 1961, both from the University of Sydney.citation needed]\n\n",
        "dblp_record": 24
    },
    {
        "letter": "R",
        "name": "Colette Rolland",
        "awards": 0,
        "education": "Null",
        "dblp_record": 178
    },
    {
        "letter": "R",
        "name": "John Romero",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Azriel Rosenfeld",
        "awards": 5,
        "education": "Null",
        "dblp_record": 461
    },
    {
        "letter": "R",
        "name": "Douglas T. Ross",
        "awards": 1,
        "education": "Null",
        "dblp_record": 30
    },
    {
        "letter": "R",
        "name": "Guido van Rossum",
        "awards": 4,
        "education": "\nVan Rossum was born and raised in the Netherlands, where he received a master's degree in mathematics and computer science from the University of Amsterdam in 1982. He received a bronze medal in 1974 in the International Mathematical Olympiad. He has a brother, Just van Rossum, who is a type designer and programmer who designed the typeface used in the \"Python Powered\" logo.\nVan Rossum lives in Belmont, California, with his wife, Kim Knapp, and their son. According to his home page and Dutch naming conventions, the \"van\" in his name is capitalized when he is referred to by surname alone, but not when using his first and last name together.\n\n",
        "dblp_record": 14
    },
    {
        "letter": "R",
        "name": "M. A. Rothman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "R",
        "name": "Winston W. Royce",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "R",
        "name": "Rudy Rucker",
        "awards": 0,
        "education": "Null",
        "dblp_record": 5
    },
    {
        "letter": "R",
        "name": "Steven Rudich",
        "awards": 4,
        "education": "Null",
        "dblp_record": 40
    },
    {
        "letter": "R",
        "name": "Jeff Rulifson",
        "awards": 3,
        "education": "\nJohns Frederick Rulifson was born August 20, 1941, in Bellefontaine, Ohio. His father was Erwin Charles Rulifson and mother was Virginia Helen Johns. Rulifson married Janet Irving on June 8, 1963, and had two children. He received a B.S. in mathematics from the University of Washington in 1966. Rulifson earned a Ph.D. in computer science from Stanford University in 1973.\n\n",
        "dblp_record": 6
    },
    {
        "letter": "R",
        "name": "James Rumbaugh",
        "awards": 0,
        "education": "Null",
        "dblp_record": 50
    },
    {
        "letter": "R",
        "name": "Peter Ružička",
        "awards": 0,
        "education": "Null",
        "dblp_record": 47
    },
    {
        "letter": "S",
        "name": "George Sadowsky",
        "awards": 0,
        "education": "\n1953–1957   Harvard College, majored in mathematics,  A.B. 1957.\n1957–1958   Harvard University, graduate study in mathematics\n1963–1966   Yale University, graduate study in economics, M.A. 1965, Ph.D. 1988\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Mehrnoosh Sadrzadeh",
        "awards": 0,
        "education": "\nSadrzadeh is from Iran. She received her undergraduate and master's degrees at Sharif University of Technology. After earning her master's degree Sadrzadeh moved to Canada. She was a doctoral researcher first at the University of Ottawa, where she was awarded an Ontario Graduate Scholarship, a University of Ottawa Excellence Scholarship, and a Canada Female Doctoral Student Award, and then at the Université du Québec à Montréal.citation needed] Her research considered epistemic logic. Alongside earning her doctorate, Sadrzadeh moved to the University of Oxford as an EPSRC postdoctoral fellow.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Umar Saif",
        "awards": 0,
        "education": "\nSaif attended Aitchison College before enrolling at Lahore University of Management Sciences where he obtained a Bachelor of Science degree in computer science in 1998. He received a doctor of philosophy degree in computer science from the University of Cambridge at the age of 22 in 2001. In 2002 he did his postdoc at MIT, also in computer science. From 2001 to 2005 he taught at MIT and worked at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL) as a research scientist, becoming part of the team which developed Project Oxygen. \n\n",
        "dblp_record": 37
    },
    {
        "letter": "S",
        "name": "Gerard Salton",
        "awards": 6,
        "education": "Null",
        "dblp_record": 181
    },
    {
        "letter": "S",
        "name": "Jean E. Sammet",
        "awards": 3,
        "education": "Null",
        "dblp_record": 56
    },
    {
        "letter": "S",
        "name": "Claude Sammut",
        "awards": 0,
        "education": "Null",
        "dblp_record": 133
    },
    {
        "letter": "S",
        "name": "Carl Sassenrath",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Mahadev Satyanarayanan",
        "awards": 5,
        "education": "\nHe has a bachelor's and master's degree from Indian Institute of Technology, Madras in 1975 and 1977, and his Ph.D. in computer science from CMU in 1983.citation needed]\n\n",
        "dblp_record": 220
    },
    {
        "letter": "S",
        "name": "Walter Savitch",
        "awards": 0,
        "education": "Null",
        "dblp_record": 32
    },
    {
        "letter": "S",
        "name": "Jonathan Schaeffer",
        "awards": 2,
        "education": "Null",
        "dblp_record": 236
    },
    {
        "letter": "S",
        "name": "Wilhelm Schickard",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Jürgen Schmidhuber",
        "awards": 0,
        "education": "Null",
        "dblp_record": 461
    },
    {
        "letter": "S",
        "name": "Steve Schneider",
        "awards": 0,
        "education": "Null",
        "dblp_record": 170
    },
    {
        "letter": "S",
        "name": "Bruce Schneier",
        "awards": 0,
        "education": "Null",
        "dblp_record": 164
    },
    {
        "letter": "S",
        "name": "Fred B. Schneider",
        "awards": 14,
        "education": "Null",
        "dblp_record": 153
    },
    {
        "letter": "S",
        "name": "Sarita Schoenebeck",
        "awards": 0,
        "education": "\nSchoenebeck is from California and is of Indian and Australian descent. She was an undergraduate student in engineering at Dartmouth College. As an undergraduate student played tennis, and earned first team all-ivy honours three times. She moved to the University of California, Berkeley for her graduate studies, where she completed a Master's in information management. She was selected as the 2006 UC Berkeley School of Information Class Speaker. Schoenebeck was a doctoral researcher at Georgia Tech, where she studied ways that parents could support young people's use of social media.\n\n",
        "dblp_record": 78
    },
    {
        "letter": "S",
        "name": "Glenda Schroeder",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Bernhard Schölkopf",
        "awards": 1,
        "education": "Null",
        "dblp_record": 866
    },
    {
        "letter": "S",
        "name": "Dana Scott",
        "awards": 6,
        "education": "Null",
        "dblp_record": 54
    },
    {
        "letter": "S",
        "name": "Michael L. Scott",
        "awards": 0,
        "education": "Null",
        "dblp_record": 158
    },
    {
        "letter": "S",
        "name": "Robert Sedgewick",
        "awards": 3,
        "education": "\nSedgewick earned his Bachelor of Science (1968) and Master of Science (1969) degrees in applied mathematics from Brown University, where he was a student of Andries van Dam.  He went on to graduate work at Stanford University where he was an advisee of Donald E. Knuth, receiving his PhD in 1975. His thesis was entitled Quicksort and was named an outstanding dissertation in computer science.\n\n",
        "dblp_record": 99
    },
    {
        "letter": "S",
        "name": "Ravi Sethi",
        "awards": 0,
        "education": "Null",
        "dblp_record": 70
    },
    {
        "letter": "S",
        "name": "Nigel Shadbolt",
        "awards": 5,
        "education": "\nShadbolt was born in London but adopted and raised in the Derbyshire village of Ashford-in-the-Water, living a \"bucolic existence\" until he went to university. He went to Lady Manners School, then a grammar school. He obtained an undergraduate degree in philosophy and psychology at Newcastle University. His PhD degree was received from the Department of Artificial Intelligence at the University of Edinburgh. His thesis resulted in a framework for understanding how human dialogue is organised and was supervised by Barry Richards and Henry S. Thompson.\n\n",
        "dblp_record": 338
    },
    {
        "letter": "S",
        "name": "Adi Shamir",
        "awards": 6,
        "education": "Null",
        "dblp_record": 275
    },
    {
        "letter": "S",
        "name": "Claude Shannon",
        "awards": 10,
        "education": "Null",
        "dblp_record": 19
    },
    {
        "letter": "S",
        "name": "David E. Shaw",
        "awards": 0,
        "education": "\nShaw was raised in Los Angeles, California. His father was a theoretical physicist who specialised in plasma and fluid flows, and his mother is an artist and educator. They divorced when he was 12. His stepfather, Irving Pfeffer, was professor of finance at University of California, Los Angeles, and the author of papers supporting the efficient market hypothesis.\nShaw earned a bachelor's degree summa cum laude from the University of California, San Diego, a PhD from Stanford University in 1980, and then became an assistant professor of the department of computer science at Columbia University. While at Columbia, Shaw conducted research in massively parallel computing with the NON-VON supercomputer. This supercomputer was composed of processing elements in a tree structure meant to be used for fast relational database searches. Earlier in his career, he founded Stanford Systems Corporation.\n\n",
        "dblp_record": 66
    },
    {
        "letter": "S",
        "name": "Cliff Shaw",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Scott Shenker",
        "awards": 3,
        "education": "Null",
        "dblp_record": 370
    },
    {
        "letter": "S",
        "name": "Shashi Shekhar",
        "awards": 0,
        "education": "\nShekhar received a B.Tech. in Computer Science from the IIT Kanpur in 1985. He then earned a M.S. in Computer Science (1987), a M.S. in Business Administration (1989) and a Ph.D. in Computer Science (1989) from the University of California, Berkeley. Earlier, he attended the Netarhat Residential School.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Ben Shneiderman",
        "awards": 15,
        "education": "\nBorn in New York, Shneiderman, attended the Bronx High School of Science, and received a BS in Mathematics and Physics from the City College of New York in 1968. He then went on to study at the State University of New York at Stony Brook, where he received an MS in Computer Science in 1972 and graduated with a PhD in 1973.\n\n",
        "dblp_record": 502
    },
    {
        "letter": "S",
        "name": "Edward H. Shortliffe",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Daniel Siewiorek",
        "awards": 2,
        "education": "\nDaniel P. Siewiorek received a Bachelor of Arts (B.A.) in Electrical Engineering from the University of Michigan, Ann Arbor in 1968. He then attended Stanford University, graduating with an Master of Arts (M.A.) in Electrical Engineering with a minor in Computer Science in 1969, and a Doctor of Philosophy (Ph.D.), also in Electrical Engineering, in 1972.\n\n",
        "dblp_record": 270
    },
    {
        "letter": "S",
        "name": "Joseph Sifakis",
        "awards": 10,
        "education": "Null",
        "dblp_record": 228
    },
    {
        "letter": "S",
        "name": "Herbert A. Simon",
        "awards": 10,
        "education": "\nHerbert Alexander Simon was born in Milwaukee, Wisconsin on June 15, 1916. Simon's father, Arthur Simon (1881–1948), was a Jewish electrical engineer who came to the United States from Germany in 1903 after earning his engineering degree at Technische Hochschule Darmstadt. An inventor, Arthur also was an independent patent attorney. Simon's mother, Edna Marguerite Merkel (1888–1969), was an accomplished pianist whose Jewish, Lutheran, and Catholic ancestors came from Braunschweig, Prague and Cologne. Simon's European ancestors were piano makers, goldsmiths, and vintners.\nSimon attended Milwaukee Public Schools, where he developed an interest in science and established himself as an atheist. While attending middle school, Simon wrote a letter to \"the editor of the Milwaukee Journal defending the civil liberties of atheists\". Unlike most children, Simon's family introduced him to the idea that human behavior could be studied scientifically; his mother's younger brother, Harold Merkel (1892–1922), who studied economics at the University of Wisconsin–Madison under John R. Commons, became one of his earliest influences. Through Harold's books on economics and psychology, Simon discovered social science. Among his earliest influences, Simon cited Norman Angell for his book The Great Illusion and Henry George for his book Progress and Poverty. While attending high school, Simon joined the debate team, where he argued \"from conviction, rather than cussedness\" in favor of George's single tax.\nIn 1933, Simon entered the University of Chicago, and, following his early influences, decided to study social science and mathematics. Simon was interested in studying biology but chose not to pursue the field because of his \"color-blindness and awkwardness in the laboratory\". At an early age, Simon learned he was color blind and discovered the external world is not the same as the perceived world. While in college, Simon focused on political science and economics. Simon's most important mentor was Henry Schultz, an econometrician and mathematical economist. Simon received both his B.A. (1936) and his Ph.D. (1943) in political science from the University of Chicago, where he studied under Harold Lasswell, Nicolas Rashevsky, Rudolf Carnap, Henry Schultz, and Charles Edward Merriam. After enrolling in a course on \"Measuring Municipal Governments,\" Simon became a research assistant for Clarence Ridley, and the two co-authored Measuring Municipal Activities: A Survey of Suggested Criteria for Appraising Administration in 1938. Simon's studies led him to the field of organizational decision-making, which became the subject of his doctoral dissertation.\n\n",
        "dblp_record": 85
    },
    {
        "letter": "S",
        "name": "Munindar P. Singh",
        "awards": 2,
        "education": "\nSingh received his B.Tech. in computer science &amp; engineering from the Indian Institute of Technology Delhi in 1986. He obtained a Ph.D. in computer science from the University of Texas at Austin in 1993 under the supervision of E. Allen Emerson and Nicholas M. Asher.\n\n",
        "dblp_record": 473
    },
    {
        "letter": "S",
        "name": "Ramesh Sitaraman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 159
    },
    {
        "letter": "S",
        "name": "Daniel Sleator",
        "awards": 4,
        "education": "Null",
        "dblp_record": 42
    },
    {
        "letter": "S",
        "name": "Aaron Sloman",
        "awards": 0,
        "education": "\nSloman was born in 1936, in the town of Que Que (now called Kwe Kwe), in what was then Southern Rhodesia (now Zimbabwe). His parents were Lithuanian Jews who emigrated to Southern Rhodesia around the turn of the century. Sloman describes himself as an atheist. He went to school in Cape Town between 1948 and 1953, then earned a degree in Mathematics and Physics at the University of Cape Town in 1956, after which a Rhodes Scholarship (from South African College School) took him to the University of Oxford (first Balliol College, and then St Antony's College). In Oxford, he became interested in philosophy after a brief period studying mathematical logic supervised by Hao Wang, eventually writing a DPhil in philosophy, defending the ideas of Immanuel Kant about the nature of mathematical knowledge as non-empirical and non-analytic ('Knowing and Understanding', 1962, now online at AARON SLOMAN DPHIL 1962).\n\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Arne Sølvberg",
        "awards": 0,
        "education": "Null",
        "dblp_record": 50
    },
    {
        "letter": "S",
        "name": "Brian Cantwell Smith",
        "awards": 0,
        "education": "Null",
        "dblp_record": 15
    },
    {
        "letter": "S",
        "name": "David Canfield Smith",
        "awards": 1,
        "education": "Null",
        "dblp_record": 24
    },
    {
        "letter": "S",
        "name": "Steven Spewak",
        "awards": 0,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "S",
        "name": "Carol Spradling",
        "awards": 0,
        "education": "Null",
        "dblp_record": 9
    },
    {
        "letter": "S",
        "name": "Robert Sproull",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Rohini Kesavan Srihari",
        "awards": 0,
        "education": "\nRohini Srihari received  her early education in Lansing, Michigan, Kanpur India and Waterloo, Ontario.  She received an undergraduate degree in Computer Science from the University of Waterloo, Ontario, Canada and the M.S. and Ph.D. degrees in Computer Science from the University at Buffalo, The State University of New York.\n\n",
        "dblp_record": 122
    },
    {
        "letter": "S",
        "name": "Sargur Srihari",
        "awards": 4,
        "education": "\nMethod used for exploiting contextual information in the first handwritten address interpretation system developed by Sargur Srihari and Jonathan Hull\nSrihari received undergraduate degrees in Science and in Electrical Communication Engineering from the National College of Bangalore University and the Indian Institute of Science in Bangalore respectively.  He received Master's and Doctoral degrees in Computer and Information Science from Ohio State University, Columbus.\n\n",
        "dblp_record": 282
    },
    {
        "letter": "S",
        "name": "Maciej Stachowiak",
        "awards": 0,
        "education": "\nAfter graduating from East High School (Rochester, New York) in 1994, Stachowiak was accepted into MIT where he completed Course 6 - Electrical Engineering and Computer Science and received both his S.B. and M.Eng. in 1998.\nWhile at MIT Stachowiak worked on the Rethinking CS101 project, and in 1997 he began the Scheme Constraints Window Manager project with Greg J. Badros.  He also contributed to a paper with the Cognitive &amp; Neural Sciences Office of Naval Research.  Stachowiak's MIT M.Eng. thesis on \"Automated Extraction of Structured data from HTML Documents\" was indicative of his early interest in web standards and development.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Richard Stallman",
        "awards": 5,
        "education": "Null",
        "dblp_record": 13
    },
    {
        "letter": "S",
        "name": "Ronald Stamper",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Thad Starner",
        "awards": 0,
        "education": "Null",
        "dblp_record": 265
    },
    {
        "letter": "S",
        "name": "Richard E. Stearns",
        "awards": 4,
        "education": "Null",
        "dblp_record": 103
    },
    {
        "letter": "S",
        "name": "Guy L. Steele, Jr.",
        "awards": 2,
        "education": "Null",
        "dblp_record": 105
    },
    {
        "letter": "S",
        "name": "Thomas Sterling",
        "awards": 3,
        "education": "\nSterling began his undergraduate studies in 1968 at the Polytechnic Institute of Brooklyn completing his BSEE degree in 1972 (Summa Cum Laude) from the Old Dominion University. Upon separation from the US Navy in 1977, he matriculated at the Massachusetts Institute of Technology (MIT). Thomas Sterling earned his SMEE from MIT in 1981, his EE in 1983, and his Ph.D in 1984 as a Hertz Fellow under the supervision of Prof. Robert H. Halstead.\n\n",
        "dblp_record": 106
    },
    {
        "letter": "S",
        "name": "Alexander Stepanov",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "W. Richard Stevens",
        "awards": 0,
        "education": "Null",
        "dblp_record": 18
    },
    {
        "letter": "S",
        "name": "Larry Stockmeyer",
        "awards": 0,
        "education": "Null",
        "dblp_record": 86
    },
    {
        "letter": "S",
        "name": "Salvatore Stolfo",
        "awards": 0,
        "education": "Null",
        "dblp_record": 180
    },
    {
        "letter": "S",
        "name": "Michael Stonebraker",
        "awards": 9,
        "education": "Null",
        "dblp_record": 420
    },
    {
        "letter": "S",
        "name": "Olaf Storaasli",
        "awards": 0,
        "education": "\nStoraasli received a B.A. in Physics, Mathematics &amp; French (Concordia College, 1964), M.A. in Mathematics (USD,1966), Ph.D in Engineering Mechanics (NCSU, 1970) and post-doc fellowships: NTNU (1984–85), University of Edinburgh (2008).\n\n",
        "dblp_record": 0
    },
    {
        "letter": "S",
        "name": "Christopher Strachey",
        "awards": 0,
        "education": "\nChristopher Strachey was born on 16 November 1916 to Oliver Strachey and Rachel (Ray) Costelloe in Hampstead, England. Oliver Strachey was the son of Richard Strachey and the great-grandson of Sir Henry Strachey, 1st Baronet. His elder sister was the writer Barbara Strachey. In 1919, the family moved to 51 Gordon Square. The Stracheys belonged to the Bloomsbury Group whose members included Virginia Woolf, John Maynard Keynes and Christopher's uncle Lytton Strachey. At 13, Christopher went to Gresham's School, Holt where he showed signs of brilliance but in general performed poorly. He was admitted to King's College, Cambridge (the same college as Alan Turing) in 1935 where he continued to neglect his studies. Strachey studied mathematics and then transferred to physics. At the end of his third year at Cambridge, Strachey suffered a nervous breakdown, possibly related to coming to terms with his homosexuality. He returned to Cambridge but managed only a \"lower second\" in the Natural Sciences Tripos.\n\n",
        "dblp_record": 17
    },
    {
        "letter": "S",
        "name": "Volker Strassen",
        "awards": 0,
        "education": "Null",
        "dblp_record": 21
    },
    {
        "letter": "S",
        "name": "Bjarne Stroustrup",
        "awards": 11,
        "education": "\nStroustrup was born in Aarhus, Denmark. His family was working class, and he attended local schools.\nHe attended Aarhus University from 1969 to 1975 and graduated with a Candidatus Scientiarum in mathematics with computer science. His interests focused on microprogramming and machine architecture. He learned the fundamentals of object-oriented programming from its inventor, Kristen Nygaard, who frequently visited Aarhus.\nIn 1979, he received his PhD in computer science from the University of Cambridge, where his research on distributed computing was supervised by David Wheeler.\n\n",
        "dblp_record": 78
    },
    {
        "letter": "S",
        "name": "Madhu Sudan",
        "awards": 3,
        "education": "Null",
        "dblp_record": 329
    },
    {
        "letter": "S",
        "name": "Gerald Jay Sussman",
        "awards": 6,
        "education": "\nSussman attended the Massachusetts Institute of Technology as an undergraduate and received his SB in mathematics in 1968. He continued his studies at MIT and obtained a PhD in 1973, also in mathematics, under the supervision of Seymour Papert. His doctoral thesis was titled \"A Computational Model of Skill Acquisition\" focusing on artificial intelligence and machine learning, using a computational performance model named HACKER.\n\n",
        "dblp_record": 38
    },
    {
        "letter": "S",
        "name": "Bert Sutherland",
        "awards": 4,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "S",
        "name": "Ivan Sutherland",
        "awards": 11,
        "education": "Null",
        "dblp_record": 48
    },
    {
        "letter": "S",
        "name": "Latanya Sweeney",
        "awards": 0,
        "education": "\nSweeney graduated from Dana Hall Schools in Wellesley, Massachusetts, receiving her high school diploma in 1977. She delivered the valedictory at the graduation ceremony.\nShe began her undergraduate work in computer science at MIT, but left to found a company. She completed her undergraduate degree in computer science at the Harvard University Extension School. In 2001, Sweeney was awarded a Ph.D. in computer science from the Massachusetts Institute of Technology, the first African American woman to do so.  Of this career move she has said, \"I would do something that was really quite noteworthy, but there was nowhere to publish about it. You could get paid for it, but there was no way to say, 'You won’t believe what I just did!' The only way to get it was to go back to school.\"\n\n",
        "dblp_record": 49
    },
    {
        "letter": "S",
        "name": "Mario Szegedy",
        "awards": 1,
        "education": "Null",
        "dblp_record": 119
    },
    {
        "letter": "T",
        "name": "Parisa Tabriz",
        "awards": 0,
        "education": "\nTabriz initially enrolled at the University of Illinois at Urbana–Champaign to study computer engineering, but soon became interested in computer science instead. She completed a bachelor of science and master of science degree at the university and did research in wireless security and attacks on privacy-enhancing technologies, co-authoring papers with her advisor Nikita Borisov. She was an active member of a student club interested in computer security, which she joined because her own website was hacked.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "T",
        "name": "Roberto Tamassia",
        "awards": 0,
        "education": "Null",
        "dblp_record": 305
    },
    {
        "letter": "T",
        "name": "Andrew S. Tanenbaum",
        "awards": 22,
        "education": "Null",
        "dblp_record": 212
    },
    {
        "letter": "T",
        "name": "Austin Tate",
        "awards": 6,
        "education": "\nTate was born 12 May 1951, Knottingley, West Yorkshire, UK. He completed his  B.A. (Hons) Computer Studies, Lancaster University, 1969-1972. He completed his postgraduate study in Machine Intelligence at University of Edinburgh, supervised by Donald Michie, 1972-1975 and a Master of Science degree in e-Learning at the University of Edinburgh, 2011-2012.\n\n",
        "dblp_record": 60
    },
    {
        "letter": "T",
        "name": "Bernhard Thalheim",
        "awards": 3,
        "education": "Null",
        "dblp_record": 383
    },
    {
        "letter": "T",
        "name": "Éva Tardos",
        "awards": 1,
        "education": "Null",
        "dblp_record": 235
    },
    {
        "letter": "T",
        "name": "Gábor Tardos",
        "awards": 4,
        "education": "Null",
        "dblp_record": 150
    },
    {
        "letter": "T",
        "name": "Robert Tarjan",
        "awards": 5,
        "education": "\nHe was born in Pomona, California. His father, raised in Hungary, was a child psychiatrist, specializing in mental retardation, and ran a state hospital. As a child, Tarjan read a lot of science fiction, and wanted to be an astronomer. He became interested in mathematics after reading Martin Gardner's mathematical games column in Scientific American. He became seriously interested in math in the eighth grade, thanks to a \"very stimulating\" teacher.\nWhile he was in high school, Tarjan got a job, where he worked with IBM punch card collators. He first worked with real computers while studying astronomy at the Summer Science Program in 1964.\nTarjan obtained a Bachelor's degree in mathematics from the California Institute of Technology in 1969.  At Stanford University, he received his master's degree in computer science in 1971 and a Ph.D. in computer science (with a minor in mathematics) in 1972. At Stanford, he was supervised by Robert Floyd and  Donald Knuth, both highly prominent computer scientists, and his Ph.D. dissertation was An Efficient Planarity Algorithm. Tarjan selected computer science as his area of interest because he believed that computer science was a way of doing mathematics that could have a practical impact.\nTarjan now lives in Princeton, NJ, and Silicon Valley.  He is married to Nayla Rizk.\nHe has three daughters:  Alice Tarjan, Sophie Zawacki, and Maxine Tarjan.\n\n",
        "dblp_record": 347
    },
    {
        "letter": "T",
        "name": "Valerie Taylor",
        "awards": 7,
        "education": "\nValerie Elaine Taylor was born May 24, 1963, in Chicago, Illinois.  Her father, Willie Taylor, was an electrical engineer at Sonicraft and would bring his children to work with him on Saturdays. Taylor credits her pursuit of a career in science to that early exposure to building circuit boards, reading schematics, and soldering boards. While in high school, she spent her Saturdays attending the Illinois Institute of Technology's Early Identification Program and spent summers in various STEM programs. Taylor received her bachelor's and master's degrees in electrical engineering from Purdue University in 1985 and 1986, respectively.\nIn 1991, Taylor received her PhD at the University of California, Berkeley in electrical engineering and computer science, under advisor David Messerschmitt. She holds a patent for her dissertation work on sparse matrices.\n\n",
        "dblp_record": 106
    },
    {
        "letter": "T",
        "name": "Mario Tchou",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "T",
        "name": "Jaime Teevan",
        "awards": 1,
        "education": "Null",
        "dblp_record": 145
    },
    {
        "letter": "T",
        "name": "Shang-Hua Teng",
        "awards": 3,
        "education": "Null",
        "dblp_record": 250
    },
    {
        "letter": "T",
        "name": "Larry Tesler",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "T",
        "name": "Avie Tevanian",
        "awards": 0,
        "education": "Null",
        "dblp_record": 8
    },
    {
        "letter": "T",
        "name": "Charles P. Thacker",
        "awards": 1,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "T",
        "name": "Daniel Thalmann",
        "awards": 3,
        "education": "Null",
        "dblp_record": 585
    },
    {
        "letter": "T",
        "name": "Ken Thompson",
        "awards": 9,
        "education": "\nThompson was born in New Orleans, Louisiana. When asked how he learned to program, Thompson stated, \"I was always fascinated with logic and even in grade school I'd work on arithmetic problems in binary, stuff like that. Just because I was fascinated.\"\n\nDEC PDP-7, as used for initial work on Unix\nThompson received a Bachelor of Science in 1965 and a master's degree in 1966, both in Electrical Engineering and Computer Sciences, from the University of California, Berkeley, where his master's thesis advisor was Elwyn Berlekamp.\n\n",
        "dblp_record": 38
    },
    {
        "letter": "T",
        "name": "Sebastian Thrun",
        "awards": 10,
        "education": "\nThrun was born in 1967 in Solingen, Germany (former West Germany), the son of Winfried and Kristin (Grüner) Thrun. He completed his Vordiplom (intermediate examination) in computer science, economics, and medicine at the University of Hildesheim in 1988.  At the University of Bonn, he completed a Diplom (first degree) in 1993 and a Ph.D. (summa cum laude) in 1995 in computer science and statistics.Later in his career, he was awarded many honorary Ph.D. degrees from European universities, including his first alma mater.\n\n",
        "dblp_record": 328
    },
    {
        "letter": "T",
        "name": "Walter F. Tichy",
        "awards": 0,
        "education": "Null",
        "dblp_record": 204
    },
    {
        "letter": "T",
        "name": "Seinosuke Toda",
        "awards": 0,
        "education": "Null",
        "dblp_record": 41
    },
    {
        "letter": "T",
        "name": "Linus Torvalds",
        "awards": 0,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "T",
        "name": "Leonardo Torres Quevedo",
        "awards": 7,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "T",
        "name": "Godfried Toussaint",
        "awards": 11,
        "education": "Null",
        "dblp_record": 211
    },
    {
        "letter": "T",
        "name": "Gloria Townsend",
        "awards": 3,
        "education": "Null",
        "dblp_record": 42
    },
    {
        "letter": "T",
        "name": "Edwin E. Tozer",
        "awards": 0,
        "education": "Null",
        "dblp_record": 3
    },
    {
        "letter": "T",
        "name": "Joseph F Traub",
        "awards": 0,
        "education": "Null",
        "dblp_record": 97
    },
    {
        "letter": "T",
        "name": "John V. Tucker",
        "awards": 0,
        "education": "Null",
        "dblp_record": 114
    },
    {
        "letter": "T",
        "name": "John Tukey",
        "awards": 7,
        "education": "Null",
        "dblp_record": 6
    },
    {
        "letter": "T",
        "name": "Alan Turing",
        "awards": 5,
        "education": "\nFamily\nEnglish Heritage plaque in Maida Vale, London marking Turing's birthplace in 1912\nTuring was born in Maida Vale, London, while his father, Julius Mathison Turing was on leave from his position with the Indian Civil Service (ICS) of the British Raj government at Chatrapur, then in the Madras Presidency and presently in Odisha state, in India. Turing's father was the son of a clergyman, the Rev. John Robert Turing, from a Scottish family of merchants that had been based in the Netherlands and included a baronet. Turing's mother, Julius's wife, was Ethel Sara Turing (née Stoney), daughter of Edward Waller Stoney, chief engineer of the Madras Railways. The Stoneys were a Protestant Anglo-Irish gentry family from both County Tipperary and County Longford, while Ethel herself had spent much of her childhood in County Clare. Julius and Ethel married on 1 October 1907 at Bartholomew's church on Clyde Road, in Dublin.\nJulius's work with the ICS brought the family to British India, where his grandfather had been a general in the Bengal Army. However, both Julius and Ethel wanted their children to be brought up in Britain, so they moved to Maida Vale, London, where Alan Turing was born on 23 June 1912, as recorded by a blue plaque on the outside of the house of his birth, later the Colonnade Hotel. Turing had an elder brother, John Ferrier Turing, father of Sir John Dermot Turing, 12th Baronet of the Turing baronets.\nTuring's father's civil service commission was still active during Turing's childhood years, and his parents travelled between Hastings in the United Kingdom and India, leaving their two sons to stay with a retired Army couple. At Hastings, Turing stayed at Baston Lodge, Upper Maze Hill, St Leonards-on-Sea, now marked with a blue plaque. The plaque was unveiled on 23 June 2012, the centenary of Turing's birth.\nVery early in life, Turing showed signs of the genius that he was later to display prominently. His parents purchased a house in Guildford in 1927, and Turing lived there during school holidays. The location is also marked with a blue plaque.\n\nSchool\nTuring's parents enrolled him at St Michael's, a primary school at 20 Charles Road, St Leonards-on-Sea, from the age of six to nine. The headmistress recognised his talent, noting that she has \"...had clever boys and hardworking boys, but Alan is a genius\".\nBetween January 1922 and 1926, Turing was educated at Hazelhurst Preparatory School, an independent school in the village of Frant in Sussex (now East Sussex). In 1926, at the age of 13, he went on to Sherborne School, an independent boarding school in the market town of Sherborne in Dorset, where he boarded at Westcott House. The first day of term coincided with the 1926 General Strike, in Britain, but Turing was so determined to attend that he rode his bicycle unaccompanied 60 miles (97 km) from Southampton to Sherborne, stopping overnight at an inn.\nTuring's natural inclination towards mathematics and science did not earn him respect from some of the teachers at Sherborne, whose definition of education placed more emphasis on the classics. His headmaster wrote to his parents: \"I hope he will not fall between two stools. If he is to stay at public school, he must aim at becoming educated. If he is to be solely a Scientific Specialist, he is wasting his time at a public school\". Despite this, Turing continued to show remarkable ability in the studies he loved, solving advanced problems in 1927 without having studied even elementary calculus. In 1928, aged 16, Turing encountered Albert Einstein's work; not only did he grasp it, but it is possible that he managed to deduce Einstein's questioning of Newton's laws of motion from a text in which this was never made explicit.\n\nChristopher Morcom\nAt Sherborne, Turing formed a significant friendship with fellow pupil Christopher Collan Morcom (13 July 1911 – 13 February 1930), who has been described as Turing's first love. Their relationship provided inspiration in Turing's future endeavours, but it was cut short by Morcom's death, in February 1930, from complications of bovine tuberculosis, contracted after drinking infected cow's milk some years previously.\n\nThe event caused Turing great sorrow. He coped with his grief by working that much harder on the topics of science and mathematics that he had shared with Morcom. In a letter to Morcom's mother, Frances Isobel Morcom (née Swan), Turing wrote:.mw-parser-output .templatequote{overflow:hidden;margin:1em 0;padding:0 40px}.mw-parser-output .templatequote .templatequotecite{line-height:1.5em;text-align:left;padding-left:1.6em;margin-top:0}I am sure I could not have found anywhere another companion so brilliant and yet so charming and unconceited. I regarded my interest in my work, and in such things as astronomy (to which he introduced me) as something to be shared with him and I think he felt a little the same about me ... I know I must put as much energy if not as much interest into my work as if he were alive, because that is what he would like me to do.\nTuring's relationship with Morcom's mother continued long after Morcom's death, with her sending gifts to Turing, and him sending letters, typically on Morcom's birthday. A day before the third anniversary of Morcom's death (13 February 1933), he wrote to Mrs. Morcom: I expect you will be thinking of Chris when this reaches you. I shall too, and this letter is just to tell you that I shall be thinking of Chris and of you tomorrow. I am sure that he is as happy now as he was when he was here. Your affectionate Alan.\nSome have speculated that Morcom's death was the cause of Turing's atheism and materialism. Apparently, at this point in his life he still believed in such concepts as a spirit, independent of the body and surviving death. In a later letter, also written to Morcom's mother, Turing wrote: Personally, I believe that spirit is really eternally connected with matter but certainly not by the same kind of body ... as regards the actual connection between spirit and body I consider that the body can hold on to a 'spirit', whilst the body is alive and awake the two are firmly connected. When the body is asleep I cannot guess what happens but when the body dies, the 'mechanism' of the body, holding the spirit is gone and the spirit finds a new body sooner or later, perhaps immediately.\nUniversity and work on computability\nAfter graduating from Sherborne, Turing studied the undergraduate course in Schedule B (that is, a three-year Parts I and II, of the Mathematical Tripos, with extra courses at the end of the third year, as Part III only emerged as a separate degree in 1934) from February 1931 to November 1934 at King's College, Cambridge, where he was awarded first-class honours in mathematics. His dissertation, On the Gaussian error function, written during his senior year and delivered in November 1934 (with a deadline date of 6 December) proved a version of the central limit theorem. It was finally accepted on 16 March 1935. By spring of that same year, Turing started his master's course (Part III)—which he completed in 1937—and, at the same time, he published his first paper, a one-page article called Equivalence of left and right almost periodicity (sent on 23 April), featured in the tenth volume of the Journal of the London Mathematical Society. Later that year, Turing was elected a Fellow of King's College on the strength of his dissertation. However, and, unknown to Turing, this version of the theorem he proved in his paper, had already been proven, in 1922, by Jarl Waldemar Lindeberg. Despite this, the committee found Turing's methods original and so regarded the work worthy of consideration for the fellowship. Abram Besicovitch's report for the committee went so far as to say that if Turing's work had been published before Lindeberg's, it would have been \"an important event in the mathematical literature of that year\".\nBetween the springs of 1935 and 1936, at the same time as Church, Turing worked on the decidability of problems, starting from Godel's incompleteness theorems. In mid-April 1936, Turing sent Max Newman the first draft typescript of his investigations. That same month, Alonzo Church published his An Unsolvable Problem of Elementary Number Theory, with similar conclusions to Turing's then-yet unpublished work. Finally, on 28 May of that year, he finished and delivered his 36-page paper for publication called \"On Computable Numbers, with an Application to the Entscheidungsproblem\". It was published in the Proceedings of the London Mathematical Society journal in two parts, the first on 30 November and the second on 23 December. In this paper, Turing reformulated Kurt Gödel's 1931 results on the limits of proof and computation, replacing Gödel's universal arithmetic-based formal language with the formal and simple hypothetical devices that became known as Turing machines. The Entscheidungsproblem (decision problem) was originally posed by German mathematician David Hilbert in 1928. Turing proved that his \"universal computing machine\" would be capable of performing any conceivable mathematical computation if it were representable as an algorithm. He went on to prove that there was no solution to the decision problem by first showing that the halting problem for Turing machines is undecidable: it is not possible to decide algorithmically whether a Turing machine will ever halt. This paper has been called \"easily the most influential math paper in history\".\n\nKing's College, Cambridge, where Turing was an undergraduate in 1931 and became a Fellow in 1935. The computer room is named after him.\nAlthough Turing's proof was published shortly after Alonzo Church's equivalent proof using his lambda calculus, Turing's approach is considerably more accessible and intuitive than Church's. It also included a notion of a 'Universal Machine' (now known as a universal Turing machine), with the idea that such a machine could perform the tasks of any other computation machine (as indeed could Church's lambda calculus). According to the Church–Turing thesis, Turing machines and the lambda calculus are capable of computing anything that is computable. John von Neumann acknowledged that the central concept of the modern computer was due to Turing's paper. To this day, Turing machines are a central object of study in theory of computation.\nFrom September 1936 to July 1938, Turing spent most of his time studying under Church at Princeton University, in the second year as a Jane Eliza Procter Visiting Fellow. In addition to his purely mathematical work, he studied cryptology and also built three of four stages of an electro-mechanical binary multiplier. In June 1938, he obtained his PhD from the Department of Mathematics at Princeton; his dissertation, Systems of Logic Based on Ordinals, introduced the concept of ordinal logic and the notion of relative computing, in which Turing machines are augmented with so-called oracles, allowing the study of problems that cannot be solved by Turing machines. John von Neumann wanted to hire him as his postdoctoral assistant, but he went back to the United Kingdom.\n\n",
        "dblp_record": 12
    },
    {
        "letter": "T",
        "name": "David Turner",
        "awards": 0,
        "education": "Null",
        "dblp_record": 15
    },
    {
        "letter": "T",
        "name": "Murray Turoff",
        "awards": 5,
        "education": "Null",
        "dblp_record": 135
    },
    {
        "letter": "U",
        "name": "Jeffrey D. Ullman",
        "awards": 12,
        "education": "Null",
        "dblp_record": 341
    },
    {
        "letter": "V",
        "name": "Leslie Valiant",
        "awards": 6,
        "education": "\nValiant was educated at King's College, Cambridge, Imperial College London, and the University of Warwick where he received a PhD in computer science in 1974.\n\n",
        "dblp_record": 119
    },
    {
        "letter": "V",
        "name": "Vladimir Vapnik",
        "awards": 6,
        "education": "\nVladimir Vapnik was born to a Jewish family in the Soviet Union. He received his master's degree in mathematics from the Uzbek State University, Samarkand, Uzbek SSR in 1958 and Ph.D in statistics at the Institute of Control Sciences, Moscow in 1964. He worked at this institute from 1961 to 1990 and became Head of the Computer Science Research Department.\n\n",
        "dblp_record": 84
    },
    {
        "letter": "V",
        "name": "Moshe Vardi",
        "awards": 7,
        "education": "\nVardi was an undergraduate student at Bar-Ilan University and received his Master of Science degree from the Weizmann Institute of Science. His PhD was supervised by Catriel Beeri and awarded by the Hebrew University of Jerusalem in 1981.\n\n",
        "dblp_record": 771
    },
    {
        "letter": "V",
        "name": "Dorothy Vaughan",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "V",
        "name": "Bernard Vauquois",
        "awards": 0,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "V",
        "name": "Umesh Vazirani",
        "awards": 6,
        "education": "Null",
        "dblp_record": 112
    },
    {
        "letter": "V",
        "name": "Manuela M. Veloso",
        "awards": 9,
        "education": "\nManuela Veloso received her Licenciatura and Master of Science degree in electrical engineering from Lisbon's Instituto Superior Técnico in 1980 and 1984 respectively. She then attended Boston University, and received a Master of Arts in computer science in 1986.citation needed] She moved to Carnegie Mellon University and received her Ph.D. in computer science there in 1992. Her thesis Learning by Analogical Reasoning in General Purpose Problem Solving was supervised by Jaime Carbonell.\n\n",
        "dblp_record": 623
    },
    {
        "letter": "V",
        "name": "François Vernadat",
        "awards": 0,
        "education": "Null",
        "dblp_record": 57
    },
    {
        "letter": "V",
        "name": "Richard Veryard",
        "awards": 0,
        "education": "Null",
        "dblp_record": 8
    },
    {
        "letter": "V",
        "name": "Sergiy Vilkomir",
        "awards": 6,
        "education": "Null",
        "dblp_record": 39
    },
    {
        "letter": "V",
        "name": "Paul Vitanyi",
        "awards": 0,
        "education": "Null",
        "dblp_record": 254
    },
    {
        "letter": "V",
        "name": "Andrew Viterbi",
        "awards": 2,
        "education": "\nViterbi attended the Boston Latin School, and then entered Massachusetts Institute of Technology (MIT) in 1952, studying electrical engineering. He received both BS and MS in electrical engineering in 1957 from MIT. He was elected to membership in the honor society Eta Kappa Nu in 1956 through the MIT chapter.\nHe worked at Raytheon and later at Jet Propulsion Laboratory (JPL) in Pasadena, California, where he started working on telemetry for uncrewed space missions, also helping to develop the phase-locked loop. Simultaneously, he was carrying out PhD studies at the University of Southern California, where he graduated in 1963 in digital communications.\n\n",
        "dblp_record": 43
    },
    {
        "letter": "V",
        "name": "Jeffrey Scott Vitter",
        "awards": 0,
        "education": "\nVitter was born and raised in New Orleans, Louisiana. He earned a Bachelor of Science in mathematics with highest honors from the University of Notre Dame in 1977, a Ph.D. in computer science from Stanford University under the supervision of Donald Knuth in 1980 and a master of business administration from Duke University in 2002.\n\n",
        "dblp_record": 307
    },
    {
        "letter": "V",
        "name": "Paul Vixie",
        "awards": 0,
        "education": "Null",
        "dblp_record": 35
    },
    {
        "letter": "W",
        "name": "Eiiti Wada",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "David Wagner",
        "awards": 0,
        "education": "Null",
        "dblp_record": 246
    },
    {
        "letter": "W",
        "name": "David Waltz",
        "awards": 2,
        "education": "\nWaltz was born in Boston, Massachusetts in 1943. He attended the Massachusetts Institute of Technology (MIT) where, as a student of artificial intelligence pioneer Marvin Minsky, he was part of the MIT Artificial Intelligence Laboratory and received S.B. (1965), M.S. (1968) and Ph.D. (1972) degrees, all in Electrical Engineering.\nHis Ph.D. dissertation on computer vision initiated the field of constraint propagation, which allowed a computer program to generate a detailed three-dimensional view of an object given a two dimensional drawing with shadows.\n\n",
        "dblp_record": 57
    },
    {
        "letter": "W",
        "name": "James Z. Wang",
        "awards": 2,
        "education": "\nThis section of a biography of a living person does not include any references or sources. Please help by adding reliable sources. Contentious material about living people that is unsourced or poorly sourced must be removed immediately.Find sources: \"James Z. Wang\" – news · newspapers · books · scholar · JSTOR (May 2019) (Learn how and when to remove this template message)\nWang received a summa cum laude bachelor's degree in mathematics and computer science from the University of Minnesota (advisor: Dennis Hejhal), an M.S. in mathematics and an M.S. in computer science, both from Stanford University, and a Ph.D. degree in medical information sciences from Stanford University's Biomedical Informatics and Database groups (advisor: Gio Wiederhold, committee members: Hector Garcia-Molina and Stephen T.C. Wong).\n\n",
        "dblp_record": 181
    },
    {
        "letter": "W",
        "name": "Steve Ward",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "Manfred K. Warmuth",
        "awards": 2,
        "education": "Null",
        "dblp_record": 240
    },
    {
        "letter": "W",
        "name": "David H. D. Warren",
        "awards": 0,
        "education": "\nWarren received a Ph.D. in artificial intelligence from the University of Edinburgh in 1977 under advisor Robert Kowalski, and (a second advisor) Donald Michie.\n\n",
        "dblp_record": 38
    },
    {
        "letter": "W",
        "name": "Kevin Warwick",
        "awards": 4,
        "education": "Null",
        "dblp_record": 118
    },
    {
        "letter": "W",
        "name": "Jan Weglarz",
        "awards": 0,
        "education": "Null",
        "dblp_record": 72
    },
    {
        "letter": "W",
        "name": "Philip Wadler",
        "awards": 4,
        "education": "\nWadler received a Bachelor of Science degree in mathematics from Stanford University in 1977, and a Master of Science degree in computer science from Carnegie Mellon University in 1979. He completed his Doctor of Philosophy in computer science at Carnegie Mellon University in 1984. His thesis was entitled \"Listlessness is better than laziness\" and was supervised by Nico Habermann.\n\n",
        "dblp_record": 168
    },
    {
        "letter": "W",
        "name": "Peter Wegner",
        "awards": 3,
        "education": "\nWegner was educated at the University of Cambridge and received a Post-Graduate Diploma in Numerical Analysis and Automatic Computing in 1954, at a time when there were no PhD programs in computer science. He was awarded a PhD from the University of London in 1968 for his book Programming Languages, Information Structures, and Machine Organization, with Maurice Wilkes listed as his supervisor.\n\n",
        "dblp_record": 102
    },
    {
        "letter": "W",
        "name": "Joseph Henry Wegstein",
        "awards": 0,
        "education": "Null",
        "dblp_record": 12
    },
    {
        "letter": "W",
        "name": "Peter J. Weinberger",
        "awards": 0,
        "education": "Null",
        "dblp_record": 11
    },
    {
        "letter": "W",
        "name": "Mark Weiser",
        "awards": 0,
        "education": "\nWeiser was born in Chicago, Illinois, to David and Audra Weiser. He grew up in Stony Brook, New York. He moved to Sarasota, Florida, to study philosophy at New College of Florida but dropped out in his second year when he ran out of money. He then moved to Ann Arbor, Michigan, where he found a job as a computer programmer. While working as a computer programmer he began taking computer science classes and excelled to the point that he was directly admitted into a master's program at the University of Michigan. He studied Computer and Communication Science at the University of Michigan, receiving an M.A. in 1976, and a Ph.D. in 1979.\n\n",
        "dblp_record": 48
    },
    {
        "letter": "W",
        "name": "Joseph Weizenbaum",
        "awards": 0,
        "education": "Null",
        "dblp_record": 19
    },
    {
        "letter": "W",
        "name": "David Wheeler",
        "awards": 6,
        "education": "\nWheeler was born in Birmingham, England, the second of the three children of (Agnes) Marjorie, née Gudgeon, and Arthur Wheeler, a press tool maker, engineer, and proprietor of a small shopfitting firm. He was educated at a local primary school in Birmingham and then went on to King Edward VI Camp Hill School after winning a scholarship in 1938. His education was disrupted by World War II, and he completed his sixth form studies at Hanley High School. In 1945 he gained a scholarship to study the Cambridge Mathematical Tripos at Trinity College, Cambridge, graduating in 1948. He was awarded the world's first PhD in computer science in 1951.\n\n",
        "dblp_record": 11
    },
    {
        "letter": "W",
        "name": "Franklin H. Westervelt",
        "awards": 0,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "W",
        "name": "Steve Whittaker",
        "awards": 2,
        "education": "Null",
        "dblp_record": 195
    },
    {
        "letter": "W",
        "name": "Jennifer Widom",
        "awards": 4,
        "education": "\nWidom earned a BS degree in trumpet performance from the Indiana University Jacobs School of Music in 1982 and a PhD in computer science under David Gries from Cornell University in 1987.\n\n",
        "dblp_record": 218
    },
    {
        "letter": "W",
        "name": "Gio Wiederhold",
        "awards": 8,
        "education": "\nGio Wiederhold was born June 24, 1936, in Varese, Italy. He graduated C.Ae. cum laude in Aeronautical Engineering from the TMS Technicum in Rotterdam, Netherlands in 1957. From 1957 to 1958 he did graduate work at the Technische Hogeschool in Delft. He emigrated to the United States in 1958. Since 1966 he had been married to Voy Yat Jew.\n\n",
        "dblp_record": 204
    },
    {
        "letter": "W",
        "name": "Norbert Wiener",
        "awards": 1,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "W",
        "name": "Adriaan van Wijngaarden",
        "awards": 4,
        "education": "Null",
        "dblp_record": 7
    },
    {
        "letter": "W",
        "name": "Mary Allen Wilkes",
        "awards": 0,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "W",
        "name": "Maurice Vincent Wilkes",
        "awards": 5,
        "education": "Null",
        "dblp_record": 84
    },
    {
        "letter": "W",
        "name": "Yorick Wilks",
        "awards": 19,
        "education": "Null",
        "dblp_record": 199
    },
    {
        "letter": "W",
        "name": "James H. Wilkinson",
        "awards": 3,
        "education": "\nBorn in Strood, England, he won a Foundation Scholarship to Sir Joseph Williamson's Mathematical School in Rochester. He studied the Cambridge Mathematical Tripos at Trinity College, Cambridge, where he graduated as Senior Wrangler.\n\n",
        "dblp_record": 25
    },
    {
        "letter": "W",
        "name": "Sophie Wilson",
        "awards": 6,
        "education": "\nWilson was born in 1957 and brought up in Leeds, Yorkshire. Her parents were both teachers, with her father specialising in English and her mother in physics. From 1975, she studied computer science and the Mathematical Tripos at Selwyn College, University of Cambridge and was a member of their Microprocessor society. In an Easter break from university, Wilson designed a microcomputer with a MOS Technology 6502 microprocessor, inspired by the earlier MK14, which was used to electronically control feed for cows.\n\n",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "Shmuel Winograd",
        "awards": 0,
        "education": "Null",
        "dblp_record": 40
    },
    {
        "letter": "W",
        "name": "Terry Winograd",
        "awards": 5,
        "education": "\nWinograd grew up in Colorado and graduated from Colorado College in 1966. He wrote SHRDLU as a PhD thesis at MIT in the years from 1968–70. In making the program Winograd was concerned with the problem of providing a computer with sufficient \"understanding\" to be able to use natural language. Winograd built a blocks world, restricting the program's intellectual world to a simulated \"world of toy blocks\". The program could accept commands such as, \"Find a block which is taller than the one you are holding and put it into the box\" and carry out the requested action using a simulated block-moving  arm. The program could also respond verbally, for example, \"I do not know which block you mean.\" The SHRDLU program can be viewed historically as one of the classic examples of how difficult it is for a programmer to build up a computer's semantic memory by hand and how limited or \"brittle\" such programs are.\n\n",
        "dblp_record": 116
    },
    {
        "letter": "W",
        "name": "Patrick Winston",
        "awards": 7,
        "education": "Null",
        "dblp_record": 33
    },
    {
        "letter": "W",
        "name": "Niklaus Wirth",
        "awards": 5,
        "education": "Null",
        "dblp_record": 92
    },
    {
        "letter": "W",
        "name": "Neil Wiseman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "Dennis E. Wisnosky",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "Stephen Wolfram",
        "awards": 4,
        "education": "Null",
        "dblp_record": 37
    },
    {
        "letter": "W",
        "name": "Mike Woodger",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "W",
        "name": "Philip Woodward",
        "awards": 3,
        "education": "Null",
        "dblp_record": 10
    },
    {
        "letter": "W",
        "name": "Beatrice Helen Worsley",
        "awards": 5,
        "education": "Null",
        "dblp_record": 2
    },
    {
        "letter": "W",
        "name": "Steve Wozniak",
        "awards": 13,
        "education": "Null",
        "dblp_record": 1
    },
    {
        "letter": "W",
        "name": "Jie Wu",
        "awards": 0,
        "education": "Null",
        "dblp_record": 1147
    },
    {
        "letter": "W",
        "name": "William Wulf",
        "awards": 0,
        "education": "\nBorn in Chicago, Wulf attended the University of Illinois Urbana–Champaign, receiving a Bachelor of Science (B.S.) in engineering physics in 1961 and an Master of Science (M.S.) in electrical engineering in 1963. He then achieved the first Doctor of Philosophy (Ph.D.) in computer science from the University of Virginia in 1968.\n\n",
        "dblp_record": 84
    },
    {
        "letter": "Y",
        "name": "Mihalis Yannakakis",
        "awards": 1,
        "education": "Null",
        "dblp_record": 290
    },
    {
        "letter": "Y",
        "name": "Andrew Chi-Chih Yao",
        "awards": 7,
        "education": "\nYao was born in Shanghai, China. He completed his undergraduate education in physics at the National Taiwan University, before completing a Doctor of Philosophy in physics at Harvard University in 1972, and then a second PhD in computer science from the University of Illinois at Urbana–Champaign in 1975.\n\n",
        "dblp_record": 179
    },
    {
        "letter": "Y",
        "name": "John Yen",
        "awards": 2,
        "education": "Null",
        "dblp_record": 216
    },
    {
        "letter": "Y",
        "name": "Nobuo Yoneda",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "Y",
        "name": "Edward Yourdon",
        "awards": 4,
        "education": "Null",
        "dblp_record": 18
    },
    {
        "letter": "Y",
        "name": "Moti Yung",
        "awards": 6,
        "education": "Null",
        "dblp_record": 604
    },
    {
        "letter": "Z",
        "name": "Lotfi Zadeh",
        "awards": 4,
        "education": "\nZadeh became the Chair of Department of Electrical Engineering at the University of California, Berkeley, in 1963. One of the lasting impacts of his leadership in this role is the expansion and the integration of computer science. He initiated and completed (in 1968) the transformation of the Electrical Engineering department at UC Berkeley to the Department of Electrical Engineering and Computer Science (EECS). This strategic move not only led UC Berkeley's advancement into the top ranks of computer science education and research, but also led other research universities globally to add computer science to their electrical engineering departments. \nIn 1973, Lotfi Zadeh received the prestigious (Institute of Electronic and Electrical Engineers) IEEE Education Award, largely in recognition of his performance as chair of EE and then EECS. Other important services to UC Berkeley include his Academic Senate committee memberships: Academic Planning &amp; Resource Allocation (1992–95); Committees (1969–70; 1980–81); Courses of Instruction (1975–80); and Faculty Awards (1990–92). Professor Zadeh graduated more than 50 PhD students, many of whom went on to become leaders in various areas of engineering, management and information sciences.\n\n",
        "dblp_record": 194
    },
    {
        "letter": "Z",
        "name": "Hans Zantema",
        "awards": 0,
        "education": "Null",
        "dblp_record": 118
    },
    {
        "letter": "Z",
        "name": "Arif Zaman",
        "awards": 0,
        "education": "Null",
        "dblp_record": 0
    },
    {
        "letter": "Z",
        "name": "Stanley Zdonik",
        "awards": 0,
        "education": "\nZdonik has received a number of non-honorary degrees during his career, all from MIT.\n\nPh.D., Computer Science, June 1983. Massachusetts Institute of Technology\nM.S., Computer Science, 1980. Massachusetts Institute of Technology\nM.S., Electrical Engineering, 1980. Massachusetts Institute of Technology\nB.S., Computer Science, 1970. Massachusetts Institute of Technology\nB.S., Electrical Engineering, 1970. Massachusetts Institute of Technology\n",
        "dblp_record": 194
    },
    {
        "letter": "Z",
        "name": "Hussein Zedan",
        "awards": 0,
        "education": "Null",
        "dblp_record": 97
    },
    {
        "letter": "Z",
        "name": "Shlomo Zilberstein",
        "awards": 6,
        "education": "Null",
        "dblp_record": 270
    },
    {
        "letter": "Z",
        "name": "Jill Zimmerman",
        "awards": 0,
        "education": "\nZimmerman is from Naperville, Illinois. While in high school in 1975, Zimmerman and her father built a computer with four kilobytes of memory after being inspired by the January cover story of Popular Mechanics by Ed Roberts on building your own computers. Zimmerman later remarked that it was this same article that inspired Bill Gates.\nIn 1981, Zimmerman earned a Bachelor of Science with distinction in Computer and Informational Sciences with a minor in Mathematics from Purdue University. At graduation, she ranked among the top ten students in the School of Science and was a member of Phi Beta Kappa and Phi Kappa Phi. Upon enrolling in doctoral studies at the University of Minnesota Institute of Technology, Zimmerman was named a Corporate Associate Fellow. In 1990, she earned a doctorate in computer science, specializing in computational and recursion theory. Zimmerman completed her dissertation titled Classes of Grzegorczyk-Computable Real Numbers under her doctoral advisor Marian Pour-El.\n\n",
        "dblp_record": 4
    },
    {
        "letter": "Z",
        "name": "Konrad Zuse",
        "awards": 5,
        "education": "\nKonrad Zuse was born in Berlin on 22 June 1910. In 1912, his family moved to East Prussian Braunsberg (now Braniewo in Poland), where his father was a postal clerk. Zuse attended the Collegium Hosianum in Braunsberg, and in 1923, the family moved to Hoyerswerda, where he passed his Abitur in 1928, qualifying him to enter university.citation needed]\nHe enrolled in the Technical University of Berlin and explored both engineering and architecture, but found them boring. Zuse then pursued civil engineering, graduating in 1935.\n\n",
        "dblp_record": 18
    }
]